{
	"version": "https://jsonfeed.org/version/1",
	"title": "Adam Wood",
	"icon": "https://micro.blog/adam/avatar.jpg",
	"home_page_url": "https://blog.zioibi.com/",
	"feed_url": "https://blog.zioibi.com/feed.json",
	"items": [
		
			{
				"id": "http://adam.micro.blog/2023/10/01/its-that-time.html",
				"title": "The End of the 2023 Online Season 🍂",
				"content_html": "<p>It&rsquo;s that time of year again. Today, I kicked some dry leaves on a walk into town, bought and drank my traditional one-per-annum Pumpkin Spice Latte™, and listened to <a href=\"https://album.link/gb/i/1589139584\"><em>Red (Taylor&rsquo;s Version)</em></a> with rapture.</p>\n<!-- raw HTML omitted -->\n<p>A whole 364 days ago, I wrote what proved to be <a href=\"https://blog.zioibi.com/tendrils022/\">the final issue</a> (to date) of my erstwhile newsletter. In it, I explained the reasons behind my practice of taking an extended period each year, away from the social internet. I won&rsquo;t repeat all that here; it suffices to say that when the Chicago Cubs are playing baseball, you&rsquo;ll find me online, and when they&rsquo;re not, I aim to be far less connected. The way things have worked out, a rough month for the Cubs has seen playoff hopes evaporate, and the final game of the season is due to start in just a few hours' time. Hence, I&rsquo;m publishing this note to say goodbye for a while — there will be less activity here between now and next spring.</p>\n<p>Some people reading this may recall that, last time around, the whole &lsquo;defaulting to disconnection&rsquo; thing didn&rsquo;t work out as planned. Elon Musk&rsquo;s acquisition of Twitter (<!-- raw HTML omitted -->RIP<!-- raw HTML omitted -->) a few weeks after I pulled the plugs, created such fascinating turmoil that I couldn&rsquo;t look away. As I wrote here <a href=\"https://blog.zioibi.com/2023/01/01/i-know-im.html\">back in January</a>, the earthquakes sent through the landscape of the social web felt genuinely exciting for a while. Mastodon had a moment; Bluesky threatened to have a moment, and then never really did; many others (cohost; T2 / Pebble; Nostr; Post News) made ripples of varying sizes; Meta launched Threads to great fanfare, and then set about the harder work of making it stick. All of which is beside the point to a large extent, save to say that — for me — the excitement has given way to baseline intrigue. The rise and fall of individual platforms is less interesting than the fact that things are changing. For what it&rsquo;s worth, I&rsquo;ve very much enjoyed continuing to share notes and updates of various types right here.</p>\n<p>Will I continue to post throughout my offline season? Possibly. The long-heralded trip to Japan is a few weeks away, and will likely yield a good number of photos — some of those will probably appear here. I&rsquo;ll also feel free to drop by with anything else that seems worth saying. As explained in that post from a year ago, this isn&rsquo;t a monastic practice, but a shift in default. One thing is virtually certain: the <a href=\"https://blog.zioibi.com/thelists\">end of year list</a> of my favourite records of 2023 will be posted in the final week of the year.</p>\n<p>For now, let me wish you a happy and cosy autumn and winter. Keep the internet warm for me, and I hope to be back here with you next spring. The Cubs play the White Sox, Friday 23 February 2024, 14:05 CST.</p>\n<p>If you need me in the meantime, <a href=\"mailto:hello@zioibi.com\">you can always write</a>.</p>\n",
				"content_text": "It's that time of year again. Today, I kicked some dry leaves on a walk into town, bought and drank my traditional one-per-annum Pumpkin Spice Latte™, and listened to [*Red (Taylor's Version)*](https://album.link/gb/i/1589139584) with rapture. \n\n<img src=\"uploads/2023/img-0087-large.png\" width=\"600\" height=\"450\" alt=\"\">\n\nA whole 364 days ago, I wrote what proved to be [the final issue](https://blog.zioibi.com/tendrils022/) (to date) of my erstwhile newsletter. In it, I explained the reasons behind my practice of taking an extended period each year, away from the social internet. I won't repeat all that here; it suffices to say that when the Chicago Cubs are playing baseball, you'll find me online, and when they're not, I aim to be far less connected. The way things have worked out, a rough month for the Cubs has seen playoff hopes evaporate, and the final game of the season is due to start in just a few hours' time. Hence, I'm publishing this note to say goodbye for a while — there will be less activity here between now and next spring. \n\nSome people reading this may recall that, last time around, the whole 'defaulting to disconnection' thing didn't work out as planned. Elon Musk's acquisition of Twitter (<sc>RIP</sc>) a few weeks after I pulled the plugs, created such fascinating turmoil that I couldn't look away. As I wrote here [back in January](https://blog.zioibi.com/2023/01/01/i-know-im.html), the earthquakes sent through the landscape of the social web felt genuinely exciting for a while. Mastodon had a moment; Bluesky threatened to have a moment, and then never really did; many others (cohost; T2 / Pebble; Nostr; Post News) made ripples of varying sizes; Meta launched Threads to great fanfare, and then set about the harder work of making it stick. All of which is beside the point to a large extent, save to say that — for me — the excitement has given way to baseline intrigue. The rise and fall of individual platforms is less interesting than the fact that things are changing. For what it's worth, I've very much enjoyed continuing to share notes and updates of various types right here.  \n\nWill I continue to post throughout my offline season? Possibly. The long-heralded trip to Japan is a few weeks away, and will likely yield a good number of photos — some of those will probably appear here. I'll also feel free to drop by with anything else that seems worth saying. As explained in that post from a year ago, this isn't a monastic practice, but a shift in default. One thing is virtually certain: the [end of year list](https://blog.zioibi.com/thelists) of my favourite records of 2023 will be posted in the final week of the year. \n\nFor now, let me wish you a happy and cosy autumn and winter. Keep the internet warm for me, and I hope to be back here with you next spring. The Cubs play the White Sox, Friday 23 February 2024, 14:05 CST.\n\nIf you need me in the meantime, [you can always write](mailto:hello@zioibi.com).\n",
				"date_published": "2023-10-01T16:02:23+01:00",
				"url": "https://blog.zioibi.com/2023/10/01/its-that-time.html",
				"tags": ["personal"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/29/a-second-album.html",
				
				"content_html": "<p>A second album of new material from Cleo Sol in as many weeks, and new Wilco, amongst the records added to the queue. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A second album of new material from Cleo Sol in as many weeks, and new Wilco, amongst the records added to the queue. 🎵\n\n<img src=\"uploads/2023/img-0066.png\" width=\"600\" height=\"2892\" alt=\"\">\n",
				"date_published": "2023-09-29T09:08:44+01:00",
				"url": "https://blog.zioibi.com/2023/09/29/a-second-album.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/26/with-the-exception.html",
				
				"content_html": "<p>With the exception of a few key things — travel money; travel insurance; transport to the airport — it feels increasingly as though the planning for our upcoming trip to Japan is in good shape. All of the hotels are booked; <!-- raw HTML omitted -->SIM<!-- raw HTML omitted --> cards are in hand; rail passes are winging their way here as I type; I even managed to successfully navigate the byzantine complexities of booking tickets for Universal Studios.</p>\n<p>Alongside all of the admin, there have been a couple of other strands of prep: I&rsquo;ve been watching a <em>lot</em> of YouTube videos (of varying quality and usefulness), and taking notes as I&rsquo;ve made my way through the guidebooks I <a href=\"https://blog.zioibi.com/2023/06/20/back-in-january.html\">posted about a while ago</a>. Another book just got added to that stack, with the news that W. David Marx&rsquo;s <em>Ametora: How Japan Saved American Style</em> (2015) is <a href=\"https://culture.ghost.io/ametora-revised-edition-2023/\">being reissued in a revised edition</a>.<br>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>I&rsquo;m also trying to read more Japanese fiction in the run-up. I&rsquo;ve long been an admirer of some of the bigger names: I read some Banana Yoshimoto in my teens; Haruki Murakami, about whom I&rsquo;ve written before (<a href=\"https://blog.zioibi.com/2015/01/17/in-praise-of.html\">1</a>, <a href=\"https://zioibi.com/siv2\">2</a>, <a href=\"https://blog.zioibi.com/2020/04/12/a-feminist-critique.html\">3</a>); &amp; Sayaka Murata (whose <em>Convenience Store Woman</em> (2016 trans. 2018) remains one of my favourite reading surprises in recent memory. In an effort to broaden those horizons somewhat, I&rsquo;m currently enjoying Emi Yagi’s <em>Diary of a Void</em> (2023) &amp; Seichō Matsumoto’s <em>Tokyo Express</em> (1958 trans. 2023).<br>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n",
				"content_text": "With the exception of a few key things — travel money; travel insurance; transport to the airport — it feels increasingly as though the planning for our upcoming trip to Japan is in good shape. All of the hotels are booked; <sc>SIM</sc> cards are in hand; rail passes are winging their way here as I type; I even managed to successfully navigate the byzantine complexities of booking tickets for Universal Studios. \n\nAlongside all of the admin, there have been a couple of other strands of prep: I've been watching a *lot* of YouTube videos (of varying quality and usefulness), and taking notes as I've made my way through the guidebooks I [posted about a while ago](https://blog.zioibi.com/2023/06/20/back-in-january.html). Another book just got added to that stack, with the news that W. David Marx's *Ametora: How Japan Saved American Style* (2015) is [being reissued in a revised edition](https://culture.ghost.io/ametora-revised-edition-2023/).  \n<br>\n<img src=\"uploads/2023/ametora.png\" width=\"600\" height=\"906\" alt=\"Cover of Ametora: How Japan Saved American Style, featuring images of a flannel shirt, and a pair of blue jeans.\">\n\nI'm also trying to read more Japanese fiction in the run-up. I've long been an admirer of some of the bigger names: I read some Banana Yoshimoto in my teens; Haruki Murakami, about whom I've written before ([1](https://blog.zioibi.com/2015/01/17/in-praise-of.html), [2](https://zioibi.com/siv2), [3](https://blog.zioibi.com/2020/04/12/a-feminist-critique.html)); & Sayaka Murata (whose *Convenience Store Woman* (2016 trans. 2018) remains one of my favourite reading surprises in recent memory. In an effort to broaden those horizons somewhat, I'm currently enjoying Emi Yagi’s *Diary of a Void* (2023) & Seichō Matsumoto’s *Tokyo Express* (1958 trans. 2023).  \n<br>\n<img src=\"uploads/2023/diaryexpress.png\" width=\"600\" height=\"428\" alt=\"\">\n",
				"date_published": "2023-09-26T17:22:02+01:00",
				"url": "https://blog.zioibi.com/2023/09/26/with-the-exception.html",
				"tags": ["books","travel"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/26/123648.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<img src=\"uploads/2023/img-0031.jpeg\" width=\"600\" height=\"450\" alt=\"A small bronze statue of the Buddha, hooked on which is a rosewood mala.\">\n",
				"date_published": "2023-09-26T12:36:48+01:00",
				"url": "https://blog.zioibi.com/2023/09/26/123648.html"
			},
			{
				"id": "http://adam.micro.blog/2023/09/23/i-dont-recall.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>I dont recall when, or why, I started giving my Apple devices names beginning with sibilants, but it’s too late to stop now!</p>\n",
				"content_text": "<img src=\"uploads/2023/img-0001.png\" width=\"600\" height=\"321\" alt=\"\">\n\nI dont recall when, or why, I started giving my Apple devices names beginning with sibilants, but it’s too late to stop now!\n",
				"date_published": "2023-09-23T18:32:30+01:00",
				"url": "https://blog.zioibi.com/2023/09/23/i-dont-recall.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/23/i-have-just.html",
				
				"content_html": "<p>I have just archived 63% of the entries in my Contacts, keeping only the people I&rsquo;ve communicated with — one way or another — across the last five years or so. It&rsquo;s amazing how much extraneous stuff builds up in these places if you&rsquo;re not paying attention: your old landlord; people you worked with for two weeks, eight years ago; window cleaners from other places you&rsquo;ve lived.</p>\n<p>And then there&rsquo;s another tier, of folks you once called friends, but one or other of you moved on from a job, or a city. There&rsquo;s a tinge of sadness in archiving those names and numbers, and it&rsquo;s partially attributable to how historically poor I am at keeping in touch with people. Honestly, it&rsquo;s bordering on a failure to grasp object permanence! People who still regularly talk with their old school friends, and former colleagues, put me to shame.</p>\n<p>When it comes to physical clutter, I try my hardest to resist the <a href=\"https://youtu.be/9dmeWE-qfMo\">&lsquo;Monica&rsquo;s closet&rsquo;</a> approach; I&rsquo;m pretty good at letting that stuff go. When it comes to digital clutter though, I see little harm in keeping it around past its immediate usefulness, as long as it&rsquo;s all organised in some way. I have a partitioned external hard drive dedicated to timestamped backups and archives of this kind: a whole lot of 1s &amp; 0s, not cluttering up the place day-to-day, but retrievable if it should become necessary. You never know when someone might ask for a window cleaner recommendation.</p>\n",
				"content_text": "I have just archived 63% of the entries in my Contacts, keeping only the people I've communicated with — one way or another — across the last five years or so. It's amazing how much extraneous stuff builds up in these places if you're not paying attention: your old landlord; people you worked with for two weeks, eight years ago; window cleaners from other places you've lived. \r\n\r\nAnd then there's another tier, of folks you once called friends, but one or other of you moved on from a job, or a city. There's a tinge of sadness in archiving those names and numbers, and it's partially attributable to how historically poor I am at keeping in touch with people. Honestly, it's bordering on a failure to grasp object permanence! People who still regularly talk with their old school friends, and former colleagues, put me to shame. \r\n\r\nWhen it comes to physical clutter, I try my hardest to resist the ['Monica's closet'](https://youtu.be/9dmeWE-qfMo) approach; I'm pretty good at letting that stuff go. When it comes to digital clutter though, I see little harm in keeping it around past its immediate usefulness, as long as it's all organised in some way. I have a partitioned external hard drive dedicated to timestamped backups and archives of this kind: a whole lot of 1s & 0s, not cluttering up the place day-to-day, but retrievable if it should become necessary. You never know when someone might ask for a window cleaner recommendation. \n",
				"date_published": "2023-09-23T09:41:56+01:00",
				"url": "https://blog.zioibi.com/2023/09/23/i-have-just.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/22/i-dont-want.html",
				
				"content_html": "<p>I don&rsquo;t want to jinx anything, but my bracket for the <a href=\"https://www.chess.com/events/info/2023-speed-chess-championship\">2023 Speed Chess Championship</a> has proven to be pretty solid thus far. The final begins this evening at 19:00 (GMT +1), and it&rsquo;s the match-up I predicted: Magnus Carlsen vs Hikaru Nakamura. It should be fun, and you can watch via the link above, on Twitch, or on YouTube. ♟️</p>\n",
				"content_text": "I don't want to jinx anything, but my bracket for the [2023 Speed Chess Championship](https://www.chess.com/events/info/2023-speed-chess-championship) has proven to be pretty solid thus far. The final begins this evening at 19:00 (GMT +1), and it's the match-up I predicted: Magnus Carlsen vs Hikaru Nakamura. It should be fun, and you can watch via the link above, on Twitch, or on YouTube. ♟️\n",
				"date_published": "2023-09-22T09:33:43+01:00",
				"url": "https://blog.zioibi.com/2023/09/22/i-dont-want.html",
				"tags": ["chess"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/22/twenty-new-records.html",
				
				"content_html": "<p>Twenty new records added to the queue this week. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Twenty new records added to the queue this week. 🎵\r\n\r\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8971.png\" width=\"600\" height=\"3615\" alt=\"\">\n",
				"date_published": "2023-09-22T09:25:31+01:00",
				"url": "https://blog.zioibi.com/2023/09/22/twenty-new-records.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/21/filed-under-visual.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>Another batch of material, filed under <a href=\"https://blog.zioibi.com/categories/visual-inspo/\">visual inspo</a>.</p>\n",
				"content_text": "<img src=\"https://cdn.uploads.micro.blog/108401/2023/085717f177702a56efa01f.png\" width=\"600\" height=\"417\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/d5c903c098264ddad8bb50.png\" width=\"600\" height=\"337\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/eccdfcdc2add56a3b663d3.png\" width=\"600\" height=\"600\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/ef056e4afafb022a74fa0b.png\" width=\"600\" height=\"912\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8954.png\" width=\"600\" height=\"746\" alt=\"\">\n\nAnother batch of material, filed under [visual inspo](https://blog.zioibi.com/categories/visual-inspo/).\n",
				"date_published": "2023-09-21T18:00:27+01:00",
				"url": "https://blog.zioibi.com/2023/09/21/filed-under-visual.html",
				"tags": ["visual inspo"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/21/another-batch-of.html",
				
				"content_html": "<p><strong>Another batch of quick notes:</strong></p>\n<p>• Circumstances over the last couple of weeks have conspired to preclude my seeing <a href=\"https://mubi.com/en/gb/films/past-lives\"><em>Past Lives</em></a> in cinemas, which I&rsquo;m disappointed about. Hopefully it&rsquo;ll arrive on MUBI in the not-too-distant future.</p>\n<p>• Depending on the day you ask, I might tell you that my favourite record of all time is Nirvana&rsquo;s <a href=\"https://album.link/gb/i/1440858699\"><em>In Utero</em> (1993)</a>, which was released <strong>30 years ago today</strong>.</p>\n<p>• I have received the shipping &amp; tracking info for my iPhone 15, arriving tomorrow!</p>\n",
				"content_text": "**Another batch of quick notes:**  \n\n• Circumstances over the last couple of weeks have conspired to preclude my seeing [*Past Lives*](https://mubi.com/en/gb/films/past-lives) in cinemas, which I'm disappointed about. Hopefully it'll arrive on MUBI in the not-too-distant future. \n\n• Depending on the day you ask, I might tell you that my favourite record of all time is Nirvana's [*In Utero* (1993)](https://album.link/gb/i/1440858699), which was released **30 years ago today**. \n\n• I have received the shipping & tracking info for my iPhone 15, arriving tomorrow!\n",
				"date_published": "2023-09-21T17:40:26+01:00",
				"url": "https://blog.zioibi.com/2023/09/21/another-batch-of.html"
			},
			{
				"id": "http://adam.micro.blog/2023/09/18/as-an-experiment.html",
				
				"content_html": "<p><strong>As an experiment, things I’ve jotted down during the day:</strong></p>\n<p>• A striking sentiment in this piece by <a href=\"https://newsletterss.com/post/2VWWSt7Zjsq3yoKyv9gNYt5AgFa/rss\">Annie Lowrey</a>:</p>\n<p><!-- raw HTML omitted -->You read a poem; it takes three minutes or 20 minutes; you get drop-kicked out of the galaxy and torn apart and rebuilt and returned home anew.<!-- raw HTML omitted --></p>\n<p>• The mix of sounds and styles on <a href=\"https://album.link/gb/i/1690201036\">Corinne Bailey Rae’s new LP</a> is head-spinning.</p>\n<p>• Eight days since I <a href=\"https://blog.zioibi.com/2023/09/09/yesterday-afternoon-i.html\">messed my ankle up</a> — the swelling has receded; most of the bruising has begun to fade a little; I’m now fairly mobile on the flat, and going up stairs, but down stairs remains a tricky proposition. Still quite a fair bit of soreness though, and if that persists a few days beyond the bruising, maybe I’ll go see about an x-ray to check I didn’t fracture something.</p>\n<p>• Very much enjoyed my second playthrough of the Puma Blue LP: <a href=\"https://album.link/gb/i/1682664550\"><em>Holy Waters</em></a> (2023)</p>\n<p>• I loved this Sophie Robinson poem: <a href=\"https://bombmagazine.org/articles/sophie-robinson-poem/\">‘art in america’</a></p>\n<p>• Babak Jalali’s <a href=\"https://youtu.be/wu8CzVfik-4\"><em>Fremont</em> (2023)</a> isn’t playing anywhere near me right now, but I will absolutely see it <!-- raw HTML omitted -->ASAP<!-- raw HTML omitted -->.</p>\n<p>• I’ve kept an eye on Cory Doctorow’s work for many years; the <a href=\"https://www.wired.com/story/have-a-nice-future-podcast-21/\">latest episode of Wired’s <em>Have a Nice Future</em> podcast</a> is a succinct encapsulation of where his thoughts about the internet stand right now.</p>\n<p>• If you&rsquo;ll excuse me, I need to go and update iOS, chiefly so that I can create inline links in Apple Notes!</p>\n",
				"content_text": "**As an experiment, things I’ve jotted down during the day:**  \r\n\r\n• A striking sentiment in this piece by [Annie Lowrey](https://newsletterss.com/post/2VWWSt7Zjsq3yoKyv9gNYt5AgFa/rss): \r\n\r\n<mark>You read a poem; it takes three minutes or 20 minutes; you get drop-kicked out of the galaxy and torn apart and rebuilt and returned home anew.</mark>\r\n\r\n• The mix of sounds and styles on [Corinne Bailey Rae’s new LP](https://album.link/gb/i/1690201036) is head-spinning. \r\n\r\n• Eight days since I [messed my ankle up](https://blog.zioibi.com/2023/09/09/yesterday-afternoon-i.html) — the swelling has receded; most of the bruising has begun to fade a little; I’m now fairly mobile on the flat, and going up stairs, but down stairs remains a tricky proposition. Still quite a fair bit of soreness though, and if that persists a few days beyond the bruising, maybe I’ll go see about an x-ray to check I didn’t fracture something.\r\n\r\n• Very much enjoyed my second playthrough of the Puma Blue LP: [*Holy Waters*](https://album.link/gb/i/1682664550) (2023)\r\n\r\n• I loved this Sophie Robinson poem: [‘art in america’](https://bombmagazine.org/articles/sophie-robinson-poem/)\r\n\r\n• Babak Jalali’s [*Fremont* (2023)](https://youtu.be/wu8CzVfik-4) isn’t playing anywhere near me right now, but I will absolutely see it <sc>ASAP</sc>. \r\n\r\n• I’ve kept an eye on Cory Doctorow’s work for many years; the [latest episode of Wired’s *Have a Nice Future* podcast](https://www.wired.com/story/have-a-nice-future-podcast-21/) is a succinct encapsulation of where his thoughts about the internet stand right now. \r\n\r\n• If you'll excuse me, I need to go and update iOS, chiefly so that I can create inline links in Apple Notes!\n",
				"date_published": "2023-09-18T18:20:16+01:00",
				"url": "https://blog.zioibi.com/2023/09/18/as-an-experiment.html"
			},
			{
				"id": "http://adam.micro.blog/2023/09/15/for-the-record.html",
				
				"content_html": "<p>For the record, I don&rsquo;t listen to all that much metal. I used to — for around a decade, starting in the mid 90s, it was one of the staples of my listening diet. My most music-obsessed friend still enjoys a lot of the stuff, and suggestion from him is how most of the metal crops up on these lists. I&rsquo;m always happy to dip into any record once, and every now and again, I still find something that ignites a spark. I mention this now because there&rsquo;s a new Otep LP released this week, and <a href=\"https://album.link/gb/i/724782295\">their debut ep from 2001</a> was a revelation to me at the time. I do not hold out much hope that this new album will have similar impact. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "For the record, I don't listen to all that much metal. I used to — for around a decade, starting in the mid 90s, it was one of the staples of my listening diet. My most music-obsessed friend still enjoys a lot of the stuff, and suggestion from him is how most of the metal crops up on these lists. I'm always happy to dip into any record once, and every now and again, I still find something that ignites a spark. I mention this now because there's a new Otep LP released this week, and [their debut ep from 2001](https://album.link/gb/i/724782295) was a revelation to me at the time. I do not hold out much hope that this new album will have similar impact. 🎵\r\n\r\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8934.png\" width=\"600\" height=\"2910\" alt=\"\">\n",
				"date_published": "2023-09-15T11:04:44+01:00",
				"url": "https://blog.zioibi.com/2023/09/15/for-the-record.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/14/im-currently-deep.html",
				
				"content_html": "<p>I&rsquo;m currently deep in the planning stages for a trip to Japan in a couple of months' time. Flights and hotels are all booked, and SIM cards have been acquired. I&rsquo;ve done my research on things like public transport and the necessity of having both cash and a Suica card in your pocket at all times. I&rsquo;ve figured out which Japan Rail Pass option works best (given that we&rsquo;re going to be using it both directions between Tokyo and Kyoto, as well as down to Osaka), I just need to pre-order it for collection.</p>\n<p>Honestly, the most confusing aspect of the whole trip so far has been coming to grips with the overly-complex method for securing entry to <a href=\"https://super-nintendo-world.usj.co.jp/en/us/about\">Super Nintendo World</a>!<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<p>The most recent research I&rsquo;ve been conducting is on architecturally significant buildings, and I wanted to take a second to note the extent to which Kenzō Tange&rsquo;s design for St. Mary&rsquo;s Cathedral in Sekiguchi (constructed 1963-4), resembles a PlayStation 5.<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup></p>\n<p><img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8922.png\" alt=\"\"></p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>If you think buying an entry ticket for Universal Studios Japan will guarantee that you get into SNW — let <em>alone</em> get on any rides — you are a but an innocent naïf.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>Or rather, I suppose I should say, how much a PS5 resembles the Cathedral.&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "I'm currently deep in the planning stages for a trip to Japan in a couple of months' time. Flights and hotels are all booked, and SIM cards have been acquired. I've done my research on things like public transport and the necessity of having both cash and a Suica card in your pocket at all times. I've figured out which Japan Rail Pass option works best (given that we're going to be using it both directions between Tokyo and Kyoto, as well as down to Osaka), I just need to pre-order it for collection. \n\nHonestly, the most confusing aspect of the whole trip so far has been coming to grips with the overly-complex method for securing entry to [Super Nintendo World](https://super-nintendo-world.usj.co.jp/en/us/about)![^1]\n\nThe most recent research I've been conducting is on architecturally significant buildings, and I wanted to take a second to note the extent to which Kenzō Tange's design for St. Mary's Cathedral in Sekiguchi (constructed 1963-4), resembles a PlayStation 5.[^2]\n\n![](https://cdn.uploads.micro.blog/108401/2023/img-8922.png)\n\n[^1]: If you think buying an entry ticket for Universal Studios Japan will guarantee that you get into SNW — let *alone* get on any rides — you are a but an innocent naïf. \n\n[^2]: Or rather, I suppose I should say, how much a PS5 resembles the Cathedral.\n",
				"date_published": "2023-09-14T09:14:59+01:00",
				"url": "https://blog.zioibi.com/2023/09/14/im-currently-deep.html",
				"tags": ["travel"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/13/a-note-of.html",
				
				"content_html": "<p>A note of follow-up to <a href=\"https://blog.zioibi.com/2023/09/12/its-that-time.html\">yesterday&rsquo;s post</a>: the Apple event went pretty much as expected. They got that brief Apple Vision Pro segment in at the top, and unveiled some neat evolutions to both Apple Watch and iPhone. The former arguably got the bigger bump, with the new phones a more modest update. Nevertheless, I saw what I needed to regarding the camera specifically: the jump from the 12MP on my iPhone 12, to the 48MP on an iPhone 15 (with double the optical zoom) is substantial.<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<p>Aside from the new hardware, I applaud the company&rsquo;s discontinuation of leather products. This was framed as part of a comprehensive environmental sustainability project, but also has significant animal welfare implications.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>I was also impressed by the demo of 24MP images at double resolution.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "A note of follow-up to [yesterday's post](https://blog.zioibi.com/2023/09/12/its-that-time.html): the Apple event went pretty much as expected. They got that brief Apple Vision Pro segment in at the top, and unveiled some neat evolutions to both Apple Watch and iPhone. The former arguably got the bigger bump, with the new phones a more modest update. Nevertheless, I saw what I needed to regarding the camera specifically: the jump from the 12MP on my iPhone 12, to the 48MP on an iPhone 15 (with double the optical zoom) is substantial.[^1]\n\nAside from the new hardware, I applaud the company's discontinuation of leather products. This was framed as part of a comprehensive environmental sustainability project, but also has significant animal welfare implications. \n\n[^1]: I was also impressed by the demo of 24MP images at double resolution.\n",
				"date_published": "2023-09-13T12:57:05+01:00",
				"url": "https://blog.zioibi.com/2023/09/13/a-note-of.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/12/its-that-time.html",
				
				"content_html": "<p>It&rsquo;s that time again: Apple Event day, and this is an upgrade year for me. More by circumstance than design, I tend to pick up every third iPhone. And, whilst the performance of my iPhone 12 is still perfectly good, the battery has certainly started to degrade. What&rsquo;s more, I&rsquo;m currently in the middle of planning a trip to Japan this autumn, and I&rsquo;ll want to have the best camera possible in my pocket. I&rsquo;m excited to tune in a little later and learn what&rsquo;s on offer; my expectation is that — beyond the switch to <!-- raw HTML omitted -->USB-C<!-- raw HTML omitted -->, and the debut of Dynamic Island on non-Pro models — the hardware will be a relatively modest update.</p>\n<p>Beyond the new iPhones, and the expected new Apple Watch model, I&rsquo;m wondering whether any time will be devoted to Apple Vision Pro. Even if it&rsquo;s limited to a short segment showcasing a different use case, I&rsquo;d expect that Apple will want to remind the world that the product exists, and is shipping relatively soon.</p>\n<p>On the software side: there&rsquo;s plenty in iOS 17, iPadOS 17, watchOS 10, &amp; macOS Sonoma that I&rsquo;m keen to play with<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. I&rsquo;ve held off on installing any of the public betas, so it&rsquo;ll all be new to me when the full releases drop.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>not least of which: I intend to barrage people with an overabundance of iMessage stickers&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "It's that time again: Apple Event day, and this is an upgrade year for me. More by circumstance than design, I tend to pick up every third iPhone. And, whilst the performance of my iPhone 12 is still perfectly good, the battery has certainly started to degrade. What's more, I'm currently in the middle of planning a trip to Japan this autumn, and I'll want to have the best camera possible in my pocket. I'm excited to tune in a little later and learn what's on offer; my expectation is that — beyond the switch to <sc>USB-C</sc>, and the debut of Dynamic Island on non-Pro models — the hardware will be a relatively modest update.\r\n\r\nBeyond the new iPhones, and the expected new Apple Watch model, I'm wondering whether any time will be devoted to Apple Vision Pro. Even if it's limited to a short segment showcasing a different use case, I'd expect that Apple will want to remind the world that the product exists, and is shipping relatively soon. \r\n\r\nOn the software side: there's plenty in iOS 17, iPadOS 17, watchOS 10, & macOS Sonoma that I'm keen to play with[^1]. I've held off on installing any of the public betas, so it'll all be new to me when the full releases drop.\r\n\r\n[^1]: not least of which: I intend to barrage people with an overabundance of iMessage stickers\n",
				"date_published": "2023-09-12T13:02:25+01:00",
				"url": "https://blog.zioibi.com/2023/09/12/its-that-time.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/10/174610.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>Another set of visual inspo bookmarks, as I&rsquo;ve <a href=\"https://blog.zioibi.com/categories/visual-inspo/\">shared before</a>. Previously, I was cataloguing these in a service called Savee, which is still a good source, but I don&rsquo;t recommend the tool: significant elements of their Pro plan simply do not work, and their customer service was lacking. I did some looking around at alternatives (eg. <a href=\"https://dropmark.com\">Dropmark</a>, which I used many years ago; <a href=\"https://are.na\">Are.na</a>, which seems popular), but I&rsquo;ve now taken to scrapbooking them in <a href=\"https://www.apple.com/newsroom/2022/12/apple-launches-freeform-a-powerful-new-app-designed-for-creative-collaboration/\">Freeform</a>, which is proving to be ideal for just this sort of thing.</p>\n<p>I think I&rsquo;ll continue to showcase a selection here from time-to-time though.</p>\n",
				"content_text": "<img src=\"https://cdn.uploads.micro.blog/108401/2023/blackness.png\" width=\"600\" height=\"617\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/eed78e80-de07-4881-bd9e-33beac8ab172.png\" width=\"600\" height=\"371\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/782e741e-01fa-4eeb-926e-7569be01918a.png\" width=\"600\" height=\"449\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/3d18d4b4-359a-4625-8974-5b4c9abaca43.png\" width=\"600\" height=\"750\" alt=\"\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/png-image.png\" width=\"600\" height=\"802\" alt=\"\">\n\nAnother set of visual inspo bookmarks, as I've [shared before](https://blog.zioibi.com/categories/visual-inspo/). Previously, I was cataloguing these in a service called Savee, which is still a good source, but I don't recommend the tool: significant elements of their Pro plan simply do not work, and their customer service was lacking. I did some looking around at alternatives (eg. [Dropmark](https://dropmark.com), which I used many years ago; [Are.na](https://are.na), which seems popular), but I've now taken to scrapbooking them in [Freeform](https://www.apple.com/newsroom/2022/12/apple-launches-freeform-a-powerful-new-app-designed-for-creative-collaboration/), which is proving to be ideal for just this sort of thing. \n\nI think I'll continue to showcase a selection here from time-to-time though. \n",
				"date_published": "2023-09-10T17:46:10+01:00",
				"url": "https://blog.zioibi.com/2023/09/10/174610.html",
				"tags": ["visual inspo"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/09/i-have-just.html",
				
				"content_html": "<p>This <a href=\"https://www.interviewmagazine.com/music/olivia-rodrigo-and-phoebe-bridgers-let-it-all-out\">conversation between Olivia Rodrigo &amp; Phoebe Bridgers</a> was fun — including the part where they start talking about <em>Beau is Afraid</em>:</p>\n<blockquote>\n<p>RODRIGO: I watched that new Ari Aster movie <em>Beau Is Afraid</em> and I got so scared. I literally had to walk out of the theater. I have never had such a visceral reaction to a movie in my life. It felt like a bad acid trip.</p>\n<p>BRIDGERS: [Laughs] I&rsquo;m so glad you brought that up, because you are right. That is the scariest movie I&rsquo;ve ever seen, but I was laughing the entire time.</p>\n<p>RODRIGO: That&rsquo;s the only reasonable reaction. Your body just can&rsquo;t process it. You have to laugh.</p>\n</blockquote>\n<p>I recently bought <em>Beau is Afraid</em>. When I saw it back in May, it was one of the most intense moviegoing experiences I&rsquo;ve ever had, and I&rsquo;m fascinated to return and pick apart why (particularly, but not exclusively) the opening act worked on me so profoundly. I can see it slotting in next to Aronofsky&rsquo;s <em>mother!</em>, Nicolas Winding Refn&rsquo;s <em>The Neon Demon</em>, and Julia Ducournau&rsquo;s <a href=\"https://blog.zioibi.com/titane\"><em>Titane</em></a> as another film I love, but can put myself through only very infrequently! 🍿</p>\n",
				"content_text": "This [conversation between Olivia Rodrigo & Phoebe Bridgers](https://www.interviewmagazine.com/music/olivia-rodrigo-and-phoebe-bridgers-let-it-all-out) was fun — including the part where they start talking about *Beau is Afraid*: \n\n> RODRIGO: I watched that new Ari Aster movie *Beau Is Afraid* and I got so scared. I literally had to walk out of the theater. I have never had such a visceral reaction to a movie in my life. It felt like a bad acid trip.\n> \n> BRIDGERS: [Laughs] I'm so glad you brought that up, because you are right. That is the scariest movie I've ever seen, but I was laughing the entire time.\n> \n> RODRIGO: That's the only reasonable reaction. Your body just can't process it. You have to laugh.\n\nI recently bought *Beau is Afraid*. When I saw it back in May, it was one of the most intense moviegoing experiences I've ever had, and I'm fascinated to return and pick apart why (particularly, but not exclusively) the opening act worked on me so profoundly. I can see it slotting in next to Aronofsky's *mother!*, Nicolas Winding Refn's *The Neon Demon*, and Julia Ducournau's [*Titane*](https://blog.zioibi.com/titane) as another film I love, but can put myself through only very infrequently! 🍿\n",
				"date_published": "2023-09-10T09:24:08+01:00",
				"url": "https://blog.zioibi.com/2023/09/09/i-have-just.html",
				"tags": ["movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/09/yesterday-afternoon-i.html",
				
				"content_html": "<p>Yesterday afternoon, I was walking into town to meet up with my sister for the first time in months, and to see a movie. About 300m from my front door I rolled my ankle <strong>hard</strong> in a pothole — and I mean, I <em>heard</em> that sucker go as I collapsed.</p>\n<p>The last time I broke a bone was c. 1991, and for a moment there I thought that run was over. This morning, I’m 85% convinced it’s just a bad sprain.</p>\n<p>Mostly I’m posting this to commemorate the death of my 2023 Apple Fitness activity ring closure streak. <!-- raw HTML omitted -->RIP<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Yesterday afternoon, I was walking into town to meet up with my sister for the first time in months, and to see a movie. About 300m from my front door I rolled my ankle **hard** in a pothole — and I mean, I *heard* that sucker go as I collapsed. \n\nThe last time I broke a bone was c. 1991, and for a moment there I thought that run was over. This morning, I’m 85% convinced it’s just a bad sprain.\n\nMostly I’m posting this to commemorate the death of my 2023 Apple Fitness activity ring closure streak. <sc>RIP</sc>\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8880.png\" width=\"600\" height=\"6103\" alt=\"\">\n",
				"date_published": "2023-09-10T08:49:44+01:00",
				"url": "https://blog.zioibi.com/2023/09/09/yesterday-afternoon-i.html",
				"tags": ["personal"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/08/good-morning-its.html",
				
				"content_html": "<p>Good morning. It&rsquo;s not every week that a <a href=\"https://blog.zioibi.com/2021/12/31/the-list.html\">former list-topper</a> releases a new album, so I&rsquo;m excited to see what Olivia Rodrigo has for us on her sophomore record. Plenty of other intriguing propositions also, including Romy&rsquo;s solo debut. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Good morning. It's not every week that a [former list-topper](https://blog.zioibi.com/2021/12/31/the-list.html) releases a new album, so I'm excited to see what Olivia Rodrigo has for us on her sophomore record. Plenty of other intriguing propositions also, including Romy's solo debut. 🎵\r\n\r\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8858.png\" width=\"600\" height=\"3273\" alt=\"\">\n",
				"date_published": "2023-09-08T08:54:09+01:00",
				"url": "https://blog.zioibi.com/2023/09/08/good-morning-its.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/07/id-seen-this.html",
				
				"content_html": "<p>I&rsquo;d seen this piece — Business Insider: <a href=\"https://www.businessinsider.com/social-media-dead-instagram-tiktok-bereal-replaced-group-chats-messaging-2023-8\">&lsquo;Social Media is Dead&rsquo;</a> — doing the rounds recently. Essentially, it argues that there&rsquo;s a move underway from broadcast-style social media, towards smaller, closed-group socialising. Since the main feed has become a place for celebrities, influencers, and brands, it has come to feel less and less like a place for regular people to post:</p>\n<blockquote>\n<p>Culture in general has kept a lot of people from showing up because they don&rsquo;t think their life is aesthetic, or they don&rsquo;t think that they&rsquo;re selling anything, so why would they post on social media?</p>\n</blockquote>\n<p>This rings true. The aspect that&rsquo;s less-discussed is the extent to which the &lsquo;new&rsquo;, less open mode of social sharing is still taking place on some of the same apps:</p>\n<blockquote>\n<p>There&rsquo;s this sublayer of Instagram that&rsquo;s much more true to what the app once was, but it is just not viewable to the general public.</p>\n</blockquote>\n<p>Hence, the decline in public posting from regular users means very little to the companies who own the platforms, because &lsquo;while sharing has tailed off, consuming content hasn&rsquo;t slowed&rsquo;. Meta doesn&rsquo;t really care how much or how little you post, as long as your engagement time stays high. Whether or not you publish your own content, if you&rsquo;re still seeing others', you&rsquo;re still seeing adverts.</p>\n<p>The existential threat to these platforms comes when folks get what they want from their smaller, closed groups, and decide on a media diet that doesn&rsquo;t include corporations and famous people. The mental leap away from viewing mainstream social media as &lsquo;social&rsquo;, and towards viewing it as &lsquo;media&rsquo; is a useful one. If the main feed isn&rsquo;t a place to share anymore, it&rsquo;s just another source of entertainment, interspersed with a lot of adverts.</p>\n",
				"content_text": "I'd seen this piece — Business Insider: ['Social Media is Dead'](https://www.businessinsider.com/social-media-dead-instagram-tiktok-bereal-replaced-group-chats-messaging-2023-8) — doing the rounds recently. Essentially, it argues that there's a move underway from broadcast-style social media, towards smaller, closed-group socialising. Since the main feed has become a place for celebrities, influencers, and brands, it has come to feel less and less like a place for regular people to post: \n\n> Culture in general has kept a lot of people from showing up because they don't think their life is aesthetic, or they don't think that they're selling anything, so why would they post on social media?\n\nThis rings true. The aspect that's less-discussed is the extent to which the 'new', less open mode of social sharing is still taking place on some of the same apps:\n\n> There's this sublayer of Instagram that's much more true to what the app once was, but it is just not viewable to the general public.\n\nHence, the decline in public posting from regular users means very little to the companies who own the platforms, because 'while sharing has tailed off, consuming content hasn't slowed'. Meta doesn't really care how much or how little you post, as long as your engagement time stays high. Whether or not you publish your own content, if you're still seeing others', you're still seeing adverts.\n\nThe existential threat to these platforms comes when folks get what they want from their smaller, closed groups, and decide on a media diet that doesn't include corporations and famous people. The mental leap away from viewing mainstream social media as 'social', and towards viewing it as 'media' is a useful one. If the main feed isn't a place to share anymore, it's just another source of entertainment, interspersed with a lot of adverts. \n",
				"date_published": "2023-09-07T15:53:25+01:00",
				"url": "https://blog.zioibi.com/2023/09/07/id-seen-this.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/07/im-crossing-my.html",
				
				"content_html": "<p>I’m crossing my fingers for Jockstrap to take home the <a href=\"https://www.mercuryprize.com/\">Mercury Prize</a> this evening. I’m not convinced that, in the modern listening landscape, these awards amount to much — better to (accidentally or otherwise) make something that becomes a TikTok meme — but it’d be nice to see them recognised for making a genuinely exceptional record in <em>I Love You Jennifer B</em>.<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<p>At a glance, my other favourites from <a href=\"https://www.mercuryprize.com/news/2023-mercury-prize-with-freenow-albums-of-the-year-revealed\">the shortlist</a> are Olivia Dean, and Young Fathers. Coverage of the prize ceremony will be live on BBC Four from 21:00 (GMT+1) &amp; BBC Radio 6 Music starting a little earlier at 19:00. 🎵</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>I wrote about seeing the band live <a href=\"https://blog.zioibi.com/2023/02/14/jockstrap-the-bullingdon.html\">back in February</a>.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "I’m crossing my fingers for Jockstrap to take home the [Mercury Prize](https://www.mercuryprize.com/) this evening. I’m not convinced that, in the modern listening landscape, these awards amount to much — better to (accidentally or otherwise) make something that becomes a TikTok meme — but it’d be nice to see them recognised for making a genuinely exceptional record in *I Love You Jennifer B*.[^1]\n\nAt a glance, my other favourites from [the shortlist](https://www.mercuryprize.com/news/2023-mercury-prize-with-freenow-albums-of-the-year-revealed) are Olivia Dean, and Young Fathers. Coverage of the prize ceremony will be live on BBC Four from 21:00 (GMT+1) & BBC Radio 6 Music starting a little earlier at 19:00. 🎵 \n\n[^1]: I wrote about seeing the band live [back in February](https://blog.zioibi.com/2023/02/14/jockstrap-the-bullingdon.html).\n",
				"date_published": "2023-09-07T11:39:30+01:00",
				"url": "https://blog.zioibi.com/2023/09/07/im-crossing-my.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/06/last-night-i.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>Last night I went to see <a href=\"https://boxd.it/xX9c\"><em>Passages</em> (2023)</a>, a beautifully-shot love triangle tragedy set in Paris. The mechanism of the film is essentially the central character making a series of selfish, ego-driven decisions (or, more accurately, acting on his own desires without much consideration). Those around him — and principally those with whom he&rsquo;s romantically involved — are seen struggling with the profound repercussions. As the third act arrives, you&rsquo;re desperate for other characters to finally draw a line, and call him out. Judging from overheard conversation during the credits, some people in the audience struggled with the protagonist&rsquo;s lack of development. It&rsquo;s certainly frustrating, but I found it to be an accurate portrayal of narcissism: people like Tomas (Franz Rogowski) rarely change, and certainly not overnight. The point in the film at which his claims to have done so are disbelieved, brings genuine catharsis.</p>\n<p>Ben Whishaw is subtle and tender as Tomas&rsquo;s husband, and Adèle Exarchopoulos is characteristically soulful. These two are the film&rsquo;s principal loci of empathy, your admiration and sympathy increasing as you become evermore infuriated by Tomas.<br>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted --></p>\n<p>Looking for something a little less emotionally fraught, I came home and streamed Céline Devaux&rsquo;s feature debut, <a href=\"https://boxd.it/yQnS\"><em>Tout le monde aime Jeanne</em> (2022)</a> — a light, mature romantic comedy that also touches on loss and depression. The most obviously unique touch is the insertion of kinetic and characterful hand-drawn illustrations (also by Devaux), which certainly make the eponymous protagonist&rsquo;s anxious internal monologue more palatable. I was also taken by the choice to saturate the whole film with bold, rich colour. It somehow served to ground the characters in a vibrant, safe-seeming world, even whilst they struggle. As Laurent Lafitte&rsquo;s Jean says at one point, ‘anxiety is more difficult in beautiful settings’. 🍿</p>\n",
				"content_text": "<img src=\"https://cdn.uploads.micro.blog/108401/2023/passages.png\" width=\"600\" height=\"450\" alt=\"\">\r\n\r\nLast night I went to see [*Passages* (2023)](https://boxd.it/xX9c), a beautifully-shot love triangle tragedy set in Paris. The mechanism of the film is essentially the central character making a series of selfish, ego-driven decisions (or, more accurately, acting on his own desires without much consideration). Those around him — and principally those with whom he's romantically involved — are seen struggling with the profound repercussions. As the third act arrives, you're desperate for other characters to finally draw a line, and call him out. Judging from overheard conversation during the credits, some people in the audience struggled with the protagonist's lack of development. It's certainly frustrating, but I found it to be an accurate portrayal of narcissism: people like Tomas (Franz Rogowski) rarely change, and certainly not overnight. The point in the film at which his claims to have done so are disbelieved, brings genuine catharsis. \r\n\r\nBen Whishaw is subtle and tender as Tomas's husband, and Adèle Exarchopoulos is characteristically soulful. These two are the film's principal loci of empathy, your admiration and sympathy increasing as you become evermore infuriated by Tomas.  \r\n<br>\r\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/tlmaj.png\" width=\"600\" height=\"337\" alt=\"\">\r\n\r\nLooking for something a little less emotionally fraught, I came home and streamed Céline Devaux's feature debut, [*Tout le monde aime Jeanne* (2022)](https://boxd.it/yQnS) — a light, mature romantic comedy that also touches on loss and depression. The most obviously unique touch is the insertion of kinetic and characterful hand-drawn illustrations (also by Devaux), which certainly make the eponymous protagonist's anxious internal monologue more palatable. I was also taken by the choice to saturate the whole film with bold, rich colour. It somehow served to ground the characters in a vibrant, safe-seeming world, even whilst they struggle. As Laurent Lafitte's Jean says at one point, ‘anxiety is more difficult in beautiful settings’. 🍿\n",
				"date_published": "2023-09-06T14:17:39+01:00",
				"url": "https://blog.zioibi.com/2023/09/06/last-night-i.html",
				"tags": ["movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/05/photos-by-rory.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>Last night I was present to watch <a href=\"https://www.chrisfarren.com/\">Chris Farren</a> demolish the hottest, sweatiest room in Oxford. The set list, heavy on (excellent) latest album <a href=\"https://album.link/gb/i/1683023812\"><em>Doom Singer</em></a>, was raucous and played at 110% volume. Adorned with some humour and vibrant projections, at heart this was the purest rock spectacle available in the city on a Monday night. If you&rsquo;re not already a fan, there&rsquo;s a good chance <a href=\"https://youtu.be/Z3W4_jJzYzk?feature=shared\">the video for &lsquo;Cosmic Leash&rsquo;</a> will convert you. 🎵</p>\n",
				"content_text": "<img src=\"https://cdn.uploads.micro.blog/108401/2023/farren.png\" width=\"600\" height=\"600\" alt=\"\">\r\n<span style=\"font-size: 12px; color: #cfcfcf;\">photos by <a href=\"https://www.instagram.com/rorygconstant/\">Rory Constant</a></span> \r\n\r\nLast night I was present to watch [Chris Farren](https://www.chrisfarren.com/) demolish the hottest, sweatiest room in Oxford. The set list, heavy on (excellent) latest album [*Doom Singer*](https://album.link/gb/i/1683023812), was raucous and played at 110% volume. Adorned with some humour and vibrant projections, at heart this was the purest rock spectacle available in the city on a Monday night. If you're not already a fan, there's a good chance [the video for 'Cosmic Leash'](https://youtu.be/Z3W4_jJzYzk?feature=shared) will convert you. 🎵\n",
				"date_published": "2023-09-05T14:52:21+01:00",
				"url": "https://blog.zioibi.com/2023/09/05/photos-by-rory.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/09/01/here-are-the.html",
				
				"content_html": "<p>Here are the newly-released records I’m adding to the queue this week, incl. new Slowdive. 🎵</p>\n<p><img src=\"https://cdn.uploads.micro.blog/108401/2023/nmf20230901.png\" alt=\"\"></p>\n",
				"content_text": "Here are the newly-released records I’m adding to the queue this week, incl. new Slowdive. 🎵\n\n![](https://cdn.uploads.micro.blog/108401/2023/nmf20230901.png)\n",
				"date_published": "2023-09-01T07:31:00+01:00",
				"url": "https://blog.zioibi.com/2023/09/01/here-are-the.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/28/yesterday-i-took.html",
				
				"content_html": "<p>Yesterday, I took a walk back-and-forth along the Kent coast, between Joss Bay and Broadstairs. Participants in <a href=\"https://zioibi.com/siv9\">this year&rsquo;s Sipped Ink read-along</a> will be happy to know that I took a small detour, to stop by Bleak House, where Dickens wrote <em>David Copperfield</em>, and Barbara Kingsolver was inspired to write <em>Demon Copperhead</em>.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>Bonus: the lighthouse pictured here (North Foreland Lighthouse) is the twin of one in Dover, which I <a href=\"https://adam.micro.blog/2015/04/11/000000.html\">visited in 2015</a> — South Foreland Lighthouse.</p>\n",
				"content_text": "Yesterday, I took a walk back-and-forth along the Kent coast, between Joss Bay and Broadstairs. Participants in [this year's Sipped Ink read-along](https://zioibi.com/siv9) will be happy to know that I took a small detour, to stop by Bleak House, where Dickens wrote *David Copperfield*, and Barbara Kingsolver was inspired to write *Demon Copperhead*. \n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/beach.png\" width=\"600\" height=\"449\" alt=\"A thin stretch of sandy beach, beneath white chalk cliffs.\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/img-8760.jpeg\" width=\"600\" height=\"449\" alt=\"The blue sky, and the darker blue ocean, then a sandy beach on which are lined up several small boats.\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/door.png\" width=\"600\" height=\"800\" alt=\"A wooden door with a brass knocker in the shape of a lion's head, and a brass plaque reading: Bleak House.\">\n\n<img src=\"https://cdn.uploads.micro.blog/108401/2023/lighthouse.png\" width=\"600\" height=\"800\" alt=\"A small, white lighthouse set back from the road, seen between trees. There is also a red post box in frame.\">\n\nBonus: the lighthouse pictured here (North Foreland Lighthouse) is the twin of one in Dover, which I [visited in 2015](https://adam.micro.blog/2015/04/11/000000.html) — South Foreland Lighthouse.\n",
				"date_published": "2023-08-28T10:48:25+01:00",
				"url": "https://blog.zioibi.com/2023/08/28/yesterday-i-took.html"
			},
			{
				"id": "http://adam.micro.blog/2023/08/25/another-batch-of.html",
				
				"content_html": "<p>Another batch of recently-harvested visual inspo.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "Another batch of recently-harvested visual inspo.\n\n<img src=\"https://adam.micro.blog/uploads/2023/idgewkfhgjsh.png\" width=\"600\" height=\"414\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/21708464d85bcd5a70bb36.png\" width=\"600\" height=\"750\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/d77429401c6c4b7b3646f0.png\" width=\"600\" height=\"900\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/e6063986e6ba3a512759ec.png\" width=\"600\" height=\"600\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/e3ef499d926eb0b1d5bc3d.png\" width=\"600\" height=\"857\" alt=\"\">\n",
				"date_published": "2023-08-25T19:39:51+01:00",
				"url": "https://blog.zioibi.com/2023/08/25/another-batch-of.html",
				"tags": ["visual inspo"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/25/i-finally-got.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>I finally got around to hanging this Stanley Donwood litho print.</p>\n<p>If you&rsquo;re near London next month, Donwood &amp; Thom Yorke have <a href=\"https://www.tinmanart.com/exhibitions/17-the-crow-flies-part-one-an-exhibition-of-new-paintings-by-stanley-donwood/overview/\">a joint exhibition of new paintings</a> at Tin Man, 6–10 Sep. 🎨</p>\n",
				"content_text": "<img src=\"https://adam.micro.blog/uploads/2023/82d53abb-bfd4-4372-be38-21dd8522cccb.jpg\" width=\"600\" height=\"833\" alt=\"A lithographic print depicting a stylised mushroom cloud explosion in black and white.\">\n\nI finally got around to hanging this Stanley Donwood litho print. \n\nIf you're near London next month, Donwood & Thom Yorke have [a joint exhibition of new paintings](https://www.tinmanart.com/exhibitions/17-the-crow-flies-part-one-an-exhibition-of-new-paintings-by-stanley-donwood/overview/) at Tin Man, 6–10 Sep. 🎨\n",
				"date_published": "2023-08-25T12:34:18+01:00",
				"url": "https://blog.zioibi.com/2023/08/25/i-finally-got.html",
				"tags": ["art"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/25/its-that-time.html",
				
				"content_html": "<p>It&rsquo;s that time of the week again, and this #newmusicfriday is a bumper crop. Surely there&rsquo;s something in here that will impress. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "It's that time of the week again, and this #newmusicfriday is a bumper crop. Surely there's something in here that will impress. 🎵\n\n<img src=\"https://adam.micro.blog/uploads/2023/20230825-1.png\" width=\"600\" height=\"4737\" alt=\"\">\n",
				"date_published": "2023-08-25T10:33:30+01:00",
				"url": "https://blog.zioibi.com/2023/08/25/its-that-time.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/24/on-last-weeks.html",
				
				"content_html": "<p>On last week&rsquo;s episode of <em>The Vergecast</em>, host Nilay Patel <a href=\"https://youtu.be/DzZ_tQhRVvk?t=3320\">requested that listeners send photos of their childhood computer rooms</a>. A photo of me from c. 1992 sprang to mind, so I sent it in. I did not, however, expect to get brutally roasted in the caption.</p>\n<!-- raw HTML omitted -->\n<p>Aside from the weird sartorial decisions, there are a couple of elements of this photo that I like. I&rsquo;m playing <em>Sonic the Hedgehog</em>, which I think puts this somewhere between Christmas 1992 — when I got my Mega Drive — and summer 1993, when we moved out of this house. I remember a good number of the Atari ST games in that box of floppy discs. It&rsquo;s fitting that <em>Lemmings</em> is at the front though, because that was my mum&rsquo;s one and only gaming obsession until <em>Candy Crush</em> some three decades later. I also like the oversized game boxes on the shelf above, which would have held a couple of floppies and an instruction manual, but bigger meant more shelf space. In particular I remember loving that <em>Simpsons</em> game that is right in front of me. And finally, as if this photo wasn&rsquo;t 90s enough, check out the pair of phone books!</p>\n",
				"content_text": "On last week's episode of *The Vergecast*, host Nilay Patel [requested that listeners send photos of their childhood computer rooms](https://youtu.be/DzZ_tQhRVvk?t=3320). A photo of me from c. 1992 sprang to mind, so I sent it in. I did not, however, expect to get brutally roasted in the caption. \n\n<img src=\"https://adam.micro.blog/uploads/2023/screenshot-2023-08-24-at-16.56.24.png\" width=\"600\" height=\"628\" alt=\"\">\n\nAside from the weird sartorial decisions, there are a couple of elements of this photo that I like. I'm playing *Sonic the Hedgehog*, which I think puts this somewhere between Christmas 1992 — when I got my Mega Drive — and summer 1993, when we moved out of this house. I remember a good number of the Atari ST games in that box of floppy discs. It's fitting that *Lemmings* is at the front though, because that was my mum's one and only gaming obsession until *Candy Crush* some three decades later. I also like the oversized game boxes on the shelf above, which would have held a couple of floppies and an instruction manual, but bigger meant more shelf space. In particular I remember loving that *Simpsons* game that is right in front of me. And finally, as if this photo wasn't 90s enough, check out the pair of phone books!\n",
				"date_published": "2023-08-24T17:12:38+01:00",
				"url": "https://blog.zioibi.com/2023/08/24/on-last-weeks.html"
			},
			{
				"id": "http://adam.micro.blog/2023/08/22/i-have-to.html",
				
				"content_html": "<p>I have to admit I&rsquo;m pretty excited about the last (?) expansion for <em>Destiny 2</em>: next year&rsquo;s &lsquo;The Final Shape&rsquo;. It&rsquo;s going to be quite something to wrap up the saga of light &amp; dark that began with the launch of the original game in 2014. A decade&rsquo;s worth of world-building and storytelling, and it looks to be coming to a close <a href=\"https://youtu.be/Ehl6aWUiA4Y\">in quite spectacular fashion</a>. I was also glad to hear — during <a href=\"https://www.youtube.com/live/RqIvKN4gtto\">today&rsquo;s <em>Destiny 2</em> Showcase event</a> — that there&rsquo;s a structure in place to continue the game on, beyond this final large-scale expansion.</p>\n<p>If you also play <em>Destiny</em>, search for me in game as <strong>zioibi<!-- raw HTML omitted -->#6738<!-- raw HTML omitted --></strong> — let&rsquo;s gather some tithes together! 🕹️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I have to admit I'm pretty excited about the last (?) expansion for *Destiny 2*: next year's 'The Final Shape'. It's going to be quite something to wrap up the saga of light & dark that began with the launch of the original game in 2014. A decade's worth of world-building and storytelling, and it looks to be coming to a close [in quite spectacular fashion](https://youtu.be/Ehl6aWUiA4Y). I was also glad to hear — during [today's *Destiny 2* Showcase event](https://www.youtube.com/live/RqIvKN4gtto) — that there's a structure in place to continue the game on, beyond this final large-scale expansion. \r\n\r\nIf you also play *Destiny*, search for me in game as **zioibi<font color=\"#cfcfcf\">#6738</font>** — let's gather some tithes together! 🕹️\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8713.png\" width=\"600\" height=\"337\" alt=\"\">\n",
				"date_published": "2023-08-22T21:01:33+01:00",
				"url": "https://blog.zioibi.com/2023/08/22/i-have-to.html",
				"tags": ["videogames"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/21/meteorite-chess.html",
				"title": "Meteorite Chess",
				"content_html": "<p>If chess isn&rsquo;t your thing (yet), you would be forgiven for thinking that chess is chess. But even for games played by the normal rules of chess, there’s a huge variety of time controls that have dramatic impacts on play. You can, of course, play without any time limit, free to leave <em>days</em> between moves if you wish. Games at the FIDE World Cup — which is in its final stages at the moment — are played with 90 minutes on each player’s clock for the first 40 moves, and an additional 30 minutes added after move 40. Also, 30 seconds are added per move. This is a version of the classical chess format, which has endured throughout the game’s long history. But other time controls have gained popularity, perhaps particularly since the advent of online chess. There is Rapid chess, where players might start with anything from 60 minutes to 10 minutes on the clock; Blitz, where clocks start with five or even three minutes, and sometimes two seconds might be added per move; and Bullet, where games can start with as little as 30 seconds on the clock!</p>\n<p>But those are just the chess formats that use the normal rules. There are also numerous variations that tweak the way the game itself is played. For example, there is Chess960, wherein the order of pieces on each player’s home rank is randomised; Crazyhouse, in which pieces you capture can be redeployed on your side; and 4 Player Chess, in which… there are four players, and four sets of pieces on one (larger) board. And that’s just the tip of the iceberg when it comes to <a href=\"https://en.wikipedia.org/wiki/Chess_variant\">chess variants</a>.<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<p>There has also been an explosion in the number and variety of chess video games, many of which feature fun spins on the game. See, as just two examples, <a href=\"https://shotgun-king.com/\"><em>Shotgun King: The Final Checkmate</em></a>, and Zach Gage’s <a href=\"http://reallybadchess.com/\"><em>Really Bad Chess</em></a>.</p>\n<p>I mention <strong>all of this</strong> because I recently had an idea for a new variation, which I’m calling Meteorite Chess. The game uses the usual setup of chess pieces, and proceeds as a normal game of chess. The twist is that at set intervals (ie. every three or five moves) one square on the board becomes highlighted, and after the subsequent moves, that square is hit by a meteorite. I can see there being two versions of the game: Meteorite &amp; Meteorite Oblivion. In the latter version, when the meteorite hits the highlighted square, any piece on that square is destroyed, and removed from the board. This is the simpler version of the game, but it still requires both players to adapt their play to accommodate squares which become temporarily hazardous. The game design trick would be in making sure that the squares were selected in a fair way. For example, no squares on the 1, 2, 7, or 8 ranks should probably be targeted at the beginning of the game. Perhaps they become eligible to be meteor struck after 30 moves, incentivising players to develop their pieces earlier. The fun of the game would be to embrace its randomness, but there could also be tweaks to guard against the feeling of unfairness — eg. a setting to provide two moves’ worth of warning before a meteor strikes.</p>\n<p>In the non-Oblivion version of the game, things get a little trickier, and perhaps a little more interesting. Here, instead of destroying the piece on the targeted square, the meteorite <em>devolves</em> it to a lesser piece. So, a struck queen becomes a rook; a rook becomes a knight or bishop; a bishop becomes a pawn; and a struck pawn is destroyed. In the majority of instances, this would still prove an incentive for players to avoid the targeted square, <em>but</em> it would give rise to fascinating board states where it might prove beneficial for a player to deliberately move a rook onto the highlighted square, because devolving it into a knight would provide a positional advantage! Again, there are options here to tweak the rules to make things more or less punishing: perhaps a setting that includes some devolving meteorites, and some that outright destroy, as well as the option to either indicate which type of meteorite is coming, or not. Heck, maybe there could even be <em>evolving</em> meteorites, which would increase struck pieces: knight to rook; rook to Queen etc.</p>\n<p>As <a href=\"https://adam.micro.blog/2022/04/21/idea-for-a.html\">I’ve said here before</a>, I’m not a game designer. But if anyone reading this would like to make use of this idea, feel free! ♟️</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>If Crazyhouse sounds like fun to you, take a look at <a href=\"https://en.wikipedia.org/wiki/Bughouse_chess\">Bughouse</a>!&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "If chess isn't your thing (yet), you would be forgiven for thinking that chess is chess. But even for games played by the normal rules of chess, there’s a huge variety of time controls that have dramatic impacts on play. You can, of course, play without any time limit, free to leave *days* between moves if you wish. Games at the FIDE World Cup — which is in its final stages at the moment — are played with 90 minutes on each player’s clock for the first 40 moves, and an additional 30 minutes added after move 40. Also, 30 seconds are added per move. This is a version of the classical chess format, which has endured throughout the game’s long history. But other time controls have gained popularity, perhaps particularly since the advent of online chess. There is Rapid chess, where players might start with anything from 60 minutes to 10 minutes on the clock; Blitz, where clocks start with five or even three minutes, and sometimes two seconds might be added per move; and Bullet, where games can start with as little as 30 seconds on the clock!\n\nBut those are just the chess formats that use the normal rules. There are also numerous variations that tweak the way the game itself is played. For example, there is Chess960, wherein the order of pieces on each player’s home rank is randomised; Crazyhouse, in which pieces you capture can be redeployed on your side; and 4 Player Chess, in which… there are four players, and four sets of pieces on one (larger) board. And that’s just the tip of the iceberg when it comes to [chess variants](https://en.wikipedia.org/wiki/Chess_variant).[^1]\n\nThere has also been an explosion in the number and variety of chess video games, many of which feature fun spins on the game. See, as just two examples, [*Shotgun King: The Final Checkmate*](https://shotgun-king.com/), and Zach Gage’s [*Really Bad Chess*](http://reallybadchess.com/). \n\nI mention **all of this** because I recently had an idea for a new variation, which I’m calling Meteorite Chess. The game uses the usual setup of chess pieces, and proceeds as a normal game of chess. The twist is that at set intervals (ie. every three or five moves) one square on the board becomes highlighted, and after the subsequent moves, that square is hit by a meteorite. I can see there being two versions of the game: Meteorite & Meteorite Oblivion. In the latter version, when the meteorite hits the highlighted square, any piece on that square is destroyed, and removed from the board. This is the simpler version of the game, but it still requires both players to adapt their play to accommodate squares which become temporarily hazardous. The game design trick would be in making sure that the squares were selected in a fair way. For example, no squares on the 1, 2, 7, or 8 ranks should probably be targeted at the beginning of the game. Perhaps they become eligible to be meteor struck after 30 moves, incentivising players to develop their pieces earlier. The fun of the game would be to embrace its randomness, but there could also be tweaks to guard against the feeling of unfairness — eg. a setting to provide two moves’ worth of warning before a meteor strikes. \n\nIn the non-Oblivion version of the game, things get a little trickier, and perhaps a little more interesting. Here, instead of destroying the piece on the targeted square, the meteorite *devolves* it to a lesser piece. So, a struck queen becomes a rook; a rook becomes a knight or bishop; a bishop becomes a pawn; and a struck pawn is destroyed. In the majority of instances, this would still prove an incentive for players to avoid the targeted square, *but* it would give rise to fascinating board states where it might prove beneficial for a player to deliberately move a rook onto the highlighted square, because devolving it into a knight would provide a positional advantage! Again, there are options here to tweak the rules to make things more or less punishing: perhaps a setting that includes some devolving meteorites, and some that outright destroy, as well as the option to either indicate which type of meteorite is coming, or not. Heck, maybe there could even be *evolving* meteorites, which would increase struck pieces: knight to rook; rook to Queen etc. \n\nAs [I’ve said here before](https://adam.micro.blog/2022/04/21/idea-for-a.html), I’m not a game designer. But if anyone reading this would like to make use of this idea, feel free! ♟️\n\n[^1]: If Crazyhouse sounds like fun to you, take a look at [Bughouse](https://en.wikipedia.org/wiki/Bughouse_chess)!\n",
				"date_published": "2023-08-21T17:01:36+01:00",
				"url": "https://blog.zioibi.com/2023/08/21/meteorite-chess.html",
				"tags": ["chess"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/19/as-prep-for.html",
				
				"content_html": "<p>As prep for the debut of <em>Ahsoka</em> this coming week, I’ve just re-watched her live-action appearances thus far. <em>The Mandolorian</em> ‘Chapter 13: The Jedi’ is a lot of fun, but I’d forgotten what a blast <em>The Book of Boba Fett</em> ‘Chapter 6: From the Desert Comes a Stranger’ was. Absolute fan service gold: Cobb Vanth, R2-D2, Luke Skywalker, Ahsoka Tano, &amp; Cad Bane!</p>\n<p>Now re-watching the final five episodes of <em>Star Wars Rebels</em> s4, and then I’ll feel properly ready! ✨</p>\n",
				"content_text": "As prep for the debut of *Ahsoka* this coming week, I’ve just re-watched her live-action appearances thus far. *The Mandolorian* ‘Chapter 13: The Jedi’ is a lot of fun, but I’d forgotten what a blast *The Book of Boba Fett* ‘Chapter 6: From the Desert Comes a Stranger’ was. Absolute fan service gold: Cobb Vanth, R2-D2, Luke Skywalker, Ahsoka Tano, & Cad Bane!\n\nNow re-watching the final five episodes of *Star Wars Rebels* s4, and then I’ll feel properly ready! ✨\n",
				"date_published": "2023-08-19T19:56:19+01:00",
				"url": "https://blog.zioibi.com/2023/08/19/as-prep-for.html",
				"tags": ["starwars"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/18/i-just-added.html",
				
				"content_html": "<p>I just added <a href=\"https://adam.micro.blog/recommended/\">a new page</a> on this site, to collate the best pieces I encounter online. I&rsquo;ve seeded it with a handful of highlights, and I&rsquo;ll add new items at the top as and when I read something deserving of inclusion.</p>\n",
				"content_text": "I just added [a new page](https://adam.micro.blog/recommended/) on this site, to collate the best pieces I encounter online. I've seeded it with a handful of highlights, and I'll add new items at the top as and when I read something deserving of inclusion. \n",
				"date_published": "2023-08-18T13:47:09+01:00",
				"url": "https://blog.zioibi.com/2023/08/18/i-just-added.html"
			},
			{
				"id": "http://adam.micro.blog/2023/08/18/another-diverse-set.html",
				
				"content_html": "<p>Another diverse set this week. Hopes are high that the epic (two hour!) Lord RAJA approaches the heights of 2016’s <em>PARA</em>. 🎵</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/bc21080c98.png\" alt=\"\"></p>\n",
				"content_text": "Another diverse set this week. Hopes are high that the epic (two hour!) Lord RAJA approaches the heights of 2016’s *PARA*. 🎵\n\n![](https://adam.micro.blog/uploads/2023/bc21080c98.png)\n",
				"date_published": "2023-08-18T08:39:07+01:00",
				"url": "https://blog.zioibi.com/2023/08/18/another-diverse-set.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/14/seeing-this-piece.html",
				
				"content_html": "<p>Seeing <a href=\"https://www.theverge.com/2023/8/14/23831109/the-new-york-times-ai-web-scraping-rules-terms-of-service\">this piece</a> about the <em>NY Times</em> prohibiting use of its content to train AI large language models, reminds me to share that OpenAI (the company behind ChatGPT etc.) <a href=\"https://platform.openai.com/docs/plugins/bot\">recently documented</a> a method for excluding the content of sites you own / control from their crawlers and scrapers. You could argue that this is something they should have done <em>prior</em> to scraping most of the open web to feed their LLM, but there&rsquo;s no reason not to implement it now. Simply add the following to your site&rsquo;s <code>robots.txt</code> file:</p>\n<pre tabindex=\"0\"><code>User-agent: ChatGPT-User\nDisallow: /\nUser-agent: GPTBot\nDisallow: /\n</code></pre><p>Reason 151 to publish to a site that you control.</p>\n",
				"content_text": "Seeing [this piece](https://www.theverge.com/2023/8/14/23831109/the-new-york-times-ai-web-scraping-rules-terms-of-service) about the *NY Times* prohibiting use of its content to train AI large language models, reminds me to share that OpenAI (the company behind ChatGPT etc.) [recently documented](https://platform.openai.com/docs/plugins/bot) a method for excluding the content of sites you own / control from their crawlers and scrapers. You could argue that this is something they should have done *prior* to scraping most of the open web to feed their LLM, but there's no reason not to implement it now. Simply add the following to your site's `robots.txt` file: \n\n```\nUser-agent: ChatGPT-User\nDisallow: /\nUser-agent: GPTBot\nDisallow: /\n```\n\nReason 151 to publish to a site that you control.\n",
				"date_published": "2023-08-14T13:11:47+01:00",
				"url": "https://blog.zioibi.com/2023/08/14/seeing-this-piece.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/14/last-nights-loss.html",
				
				"content_html": "<p>Last night’s <a href=\"https://www.mlb.com/gameday/cubs-vs-blue-jays/2023/08/13/717012/final/wrap\">loss to the Blue Jays</a> had me wondering something: why does it feel like the 2023 Cubs rarely manage to close out a series sweep, and why does it feel like they always falter on Sunday?</p>\n<p>I quickly tallied it up. So far this season, the Cubs have played 20 regular season games on a Sunday, and won five of them: a winning percentage of .250</p>\n<p>Their winning percentage for the season as a whole currently stands at .517 — more than double! What is it about Sundays? ⚾️</p>\n",
				"content_text": "Last night’s [loss to the Blue Jays](https://www.mlb.com/gameday/cubs-vs-blue-jays/2023/08/13/717012/final/wrap) had me wondering something: why does it feel like the 2023 Cubs rarely manage to close out a series sweep, and why does it feel like they always falter on Sunday? \n\nI quickly tallied it up. So far this season, the Cubs have played 20 regular season games on a Sunday, and won five of them: a winning percentage of .250\n\nTheir winning percentage for the season as a whole currently stands at .517 — more than double! What is it about Sundays? ⚾️\n",
				"date_published": "2023-08-14T12:06:30+01:00",
				"url": "https://blog.zioibi.com/2023/08/14/last-nights-loss.html",
				"tags": ["baseball"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/14/my-thanks-to.html",
				
				"content_html": "<p>My thanks to <a href=\"https://mastodon.social/@brandrick\">Chris Brandrick</a> for sharing this article — <a href=\"https://www.theguardian.com/games/2023/aug/07/ultimate-rare-40-years-british-videogames-jet-pac-goldeneye-sea-of-thieves\">&lsquo;The Ultimate-Rare story: 40 years of brilliant British games&rsquo;</a> — in this week&rsquo;s issue of his newsletter: <a href=\"https://switchweekly.com/\">Switch Weekly</a>. Somehow, it had entirely escaped my attention that Rare was an evolution of Ultimate!</p>\n<!-- raw HTML omitted -->\n<p><a href=\"https://youtu.be/9Hy29KoBnGY\"><em>Jetpac</em></a> was one of my absolute childhood favourites for the ZX Spectrum, and I have fond memories of <em>Donkey Kong Country</em> exploding my mind at Christmas in 1994. How did I not know they were made by the same people? So many of Rare&rsquo;s titles have brought me joy over the years, including (but not limited to) <em>Killer Instinct</em>, <em>GoldenEye 007</em>, <em>Diddy Kong Racing</em>, <em>Perfect Dark</em>, &amp; <em>Viva Piñata</em>. After reading this piece, I&rsquo;m tempted to check out the <em>Rare Replay</em> compilation of 30 games, which they released for the company&rsquo;s 30th anniversary. I&rsquo;ve just noticed it includes <em>Jetpac</em>!</p>\n",
				"content_text": "My thanks to [Chris Brandrick](https://mastodon.social/@brandrick) for sharing this article — ['The Ultimate-Rare story: 40 years of brilliant British games'](https://www.theguardian.com/games/2023/aug/07/ultimate-rare-40-years-british-videogames-jet-pac-goldeneye-sea-of-thieves) — in this week's issue of his newsletter: [Switch Weekly](https://switchweekly.com/). Somehow, it had entirely escaped my attention that Rare was an evolution of Ultimate! \n\n<img src=\"https://adam-test.micro.blog/uploads/2023/image.png\" width=\"600\" height=\"411\" alt=\"\">\n\n[*Jetpac*](https://youtu.be/9Hy29KoBnGY) was one of my absolute childhood favourites for the ZX Spectrum, and I have fond memories of *Donkey Kong Country* exploding my mind at Christmas in 1994. How did I not know they were made by the same people? So many of Rare's titles have brought me joy over the years, including (but not limited to) *Killer Instinct*, *GoldenEye 007*, *Diddy Kong Racing*, *Perfect Dark*, & *Viva Piñata*. After reading this piece, I'm tempted to check out the *Rare Replay* compilation of 30 games, which they released for the company's 30th anniversary. I've just noticed it includes *Jetpac*!\n",
				"date_published": "2023-08-14T11:32:04+01:00",
				"url": "https://blog.zioibi.com/2023/08/14/my-thanks-to.html"
			},
			{
				"id": "http://adam.micro.blog/2023/08/13/nice-to-see.html",
				
				"content_html": "<p>Nice to see that Jason Heyward&rsquo;s recent success in LA has warranted a piece in the <em>NY Times</em>. He was <a href=\"https://adam.micro.blog/2023/01/31/over-the-last.html\">one of my favourite players</a> to watch, particularly in the early years of his contract with the Cubs, and it&rsquo;s a delight to see him having a season worth noting. The article starts with an unnecessarily pointed dig at Heyward&rsquo;s former club:</p>\n<blockquote>\n<p>he can still help a team, which is more than the Chicago Cubs seemed to think when they decided to cut ties with him last August</p>\n</blockquote>\n<p>But, as the piece goes on, it does lay out the case for his having been let go:</p>\n<blockquote>\n<p>When Heyward’s O.P.S. dropped to career lows in consecutive seasons — .627 in 2021 and .556 in 2022 — it was evident that his time there was done.</p>\n</blockquote>\n<p>Indeed, that&rsquo;s kind of the point of the piece: Heyward&rsquo;s 2023 season to date has been an unexpected upswing:</p>\n<blockquote>\n<p>Heyward’s on-base plus slugging percentage (.797) is his highest over a full season since 2015. He has produced the best isolated power (.216), home run percentage (4.2 percent) and walk rate (11.5 percent) of his career.</p>\n</blockquote>\n<p>Not mentioned are the struggles that have been experienced by Heyward&rsquo;s replacement in Chicago: Seiya Suzuki, whose workload has recently been reduced to give him space to work on his plate approach. There was, however, one piece that stung: Heyward&rsquo;s admission that “The toughest thing for me was not trying to win every day”. The Cubs' post-World Series decline, and quick collapse into a rebuild, are much discussed. It pained me a little to hear that Heyward shared fans' impatience with the front office&rsquo;s strategy. ⚾️</p>\n",
				"content_text": "Nice to see that Jason Heyward's recent success in LA has warranted a piece in the *NY Times*. He was [one of my favourite players](https://adam.micro.blog/2023/01/31/over-the-last.html) to watch, particularly in the early years of his contract with the Cubs, and it's a delight to see him having a season worth noting. The article starts with an unnecessarily pointed dig at Heyward's former club: \n\n> he can still help a team, which is more than the Chicago Cubs seemed to think when they decided to cut ties with him last August\n\nBut, as the piece goes on, it does lay out the case for his having been let go: \n\n> When Heyward’s O.P.S. dropped to career lows in consecutive seasons — .627 in 2021 and .556 in 2022 — it was evident that his time there was done.\n\nIndeed, that's kind of the point of the piece: Heyward's 2023 season to date has been an unexpected upswing: \n\n> Heyward’s on-base plus slugging percentage (.797) is his highest over a full season since 2015. He has produced the best isolated power (.216), home run percentage (4.2 percent) and walk rate (11.5 percent) of his career.\n\nNot mentioned are the struggles that have been experienced by Heyward's replacement in Chicago: Seiya Suzuki, whose workload has recently been reduced to give him space to work on his plate approach. There was, however, one piece that stung: Heyward's admission that “The toughest thing for me was not trying to win every day”. The Cubs' post-World Series decline, and quick collapse into a rebuild, are much discussed. It pained me a little to hear that Heyward shared fans' impatience with the front office's strategy. ⚾️\n",
				"date_published": "2023-08-13T19:56:36+01:00",
				"url": "https://blog.zioibi.com/2023/08/13/nice-to-see.html",
				"tags": ["baseball"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/13/today-i-sent.html",
				
				"content_html": "<p>Today I sent the final newsletter issue of this summer&rsquo;s <a href=\"https://zioibi.com/si\">Sipped Ink</a> read-along, bringing to a close six weeks of enjoying Barbara Kingsolver&rsquo;s fantastic novel <a href=\"https://micro.blog/books/9780571376490\"><em>Demon Copperhead</em></a> (2022). As always with this project, I come away from it feeling both energised by the community — it&rsquo;s great to have carved out a discrete space to discuss books — and a little drained. I was better about my own schedule this year than I have been in the past, when it was too common that the weekend arrived with me still having all the reading to do, let alone the note-taking and newsletter writing. For the most part I stayed on top of it this year, having been better about taking notes during the week, which were easier to flesh out on the weekends.</p>\n<p>It helped that the novel was so good. I don&rsquo;t do any kind of organised reader feedback, but my instinct is that the best of these read-alongs have been when the book is eminently readable. That might sound obvious, but it&rsquo;s actually counter to the spirit in which I started the whole enterprise. Don&rsquo;t get me wrong, it&rsquo;s understandable that participants feel the most engaged with the easier-to-read titles (<em>The Goldfinch</em>, <em>Great Circle</em>, &amp; <em>Demon Copperhead</em> amongst them), but I initially started the read-along as an accountability mechanism to push me through longer, more challenging works (<em>Infinite Jest</em>, <em>2666</em>). This shouldn&rsquo;t be mistaken for a complaint — I also very much enjoy reading these more popular books — but it makes me wonder what the reception would be amongst current participants if I was to move back towards longer or more complex novels.</p>\n<p>Now that the read-along is done, I&rsquo;m flush with the giddy freedom of being able to choose to read whatever I want! There&rsquo;s <a href=\"https://micro.blog/books/9781668016138\">a new Stephen King</a> on the horizon, but that&rsquo;s three weeks away. Before then, I&rsquo;m hoping to pick up a couple from my <a href=\"https://adam.micro.blog/toread\">&lsquo;Want To Read&rsquo;</a> stack.  📚</p>\n",
				"content_text": "Today I sent the final newsletter issue of this summer's [Sipped Ink](https://zioibi.com/si) read-along, bringing to a close six weeks of enjoying Barbara Kingsolver's fantastic novel [*Demon Copperhead*](https://micro.blog/books/9780571376490) (2022). As always with this project, I come away from it feeling both energised by the community — it's great to have carved out a discrete space to discuss books — and a little drained. I was better about my own schedule this year than I have been in the past, when it was too common that the weekend arrived with me still having all the reading to do, let alone the note-taking and newsletter writing. For the most part I stayed on top of it this year, having been better about taking notes during the week, which were easier to flesh out on the weekends. \n\nIt helped that the novel was so good. I don't do any kind of organised reader feedback, but my instinct is that the best of these read-alongs have been when the book is eminently readable. That might sound obvious, but it's actually counter to the spirit in which I started the whole enterprise. Don't get me wrong, it's understandable that participants feel the most engaged with the easier-to-read titles (*The Goldfinch*, *Great Circle*, & *Demon Copperhead* amongst them), but I initially started the read-along as an accountability mechanism to push me through longer, more challenging works (*Infinite Jest*, *2666*). This shouldn't be mistaken for a complaint — I also very much enjoy reading these more popular books — but it makes me wonder what the reception would be amongst current participants if I was to move back towards longer or more complex novels.\n\nNow that the read-along is done, I'm flush with the giddy freedom of being able to choose to read whatever I want! There's [a new Stephen King](https://micro.blog/books/9781668016138) on the horizon, but that's three weeks away. Before then, I'm hoping to pick up a couple from my ['Want To Read'](https://adam.micro.blog/toread) stack.  📚\n",
				"date_published": "2023-08-13T12:31:15+01:00",
				"url": "https://blog.zioibi.com/2023/08/13/today-i-sent.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/11/a-whole-bunch.html",
				
				"content_html": "<p>A whole bunch of genres represented this #newmusicfriday — I&rsquo;ll let you know if anything particularly great surfaces. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A whole bunch of genres represented this #newmusicfriday — I'll let you know if anything particularly great surfaces. 🎵\n\n<img src=\"https://adam.micro.blog/uploads/2023/img-8598.png\" width=\"600\" height=\"2923\" alt=\"\">\n",
				"date_published": "2023-08-11T14:54:33+01:00",
				"url": "https://blog.zioibi.com/2023/08/11/a-whole-bunch.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/09/with-two-weeks.html",
				
				"content_html": "<p>With two weeks until the debut of <em>Ahsoka</em> on Disney+, my prep is going up a gear. I’ve got twelve episodes of my <em>Rebels</em> re-watch to go, and I also hope to re-watch <em>The Mandalorian</em> ‘Chapter 13: The Jedi’ &amp; <em>The Book of Boba Fett</em> ‘Chapter 6: From the Desert Comes a Stranger’. I might even go back through the first season of <em>Tales of the Jedi</em> shorts. New to me though: I’m just starting EK Johnston’s 2016 novel <a href=\"https://micro.blog/books/9781484782316\"><em>Ahsoka</em></a> ✨</p>\n",
				"content_text": "With two weeks until the debut of *Ahsoka* on Disney+, my prep is going up a gear. I’ve got twelve episodes of my *Rebels* re-watch to go, and I also hope to re-watch *The Mandalorian* ‘Chapter 13: The Jedi’ & *The Book of Boba Fett* ‘Chapter 6: From the Desert Comes a Stranger’. I might even go back through the first season of *Tales of the Jedi* shorts. New to me though: I’m just starting EK Johnston’s 2016 novel [*Ahsoka*](https://micro.blog/books/9781484782316) ✨\n",
				"date_published": "2023-08-09T19:52:48+01:00",
				"url": "https://blog.zioibi.com/2023/08/09/with-two-weeks.html",
				"tags": ["starwars"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/09/a-pair-of.html",
				
				"content_html": "<p>A pair of highlighted passages from recommended recent newsletters:</p>\n<blockquote>\n<p>our political and social structures, the philosophies and ways we’ve educated ourselves aren’t up to the task of truly, ethically handling many of our contemporary technologies or sciences of the quantum echelon</p>\n</blockquote>\n<p><!-- raw HTML omitted -->Craig Mod: <em>Roden</em> #082 — <a href=\"https://craigmod.com/roden/082/\">&lsquo;Sandwiches, Oppenheimer, Shooting Film&rsquo;</a><!-- raw HTML omitted --></p>\n<blockquote>\n<p>As much as A.I. has gotten better at making human-like art, creation is arguably the easiest step in the process of cultural formation. Every day thousands if not millions of people propose new ideas and practices, but only a tiny sliver ever win attention, attract adherents, or take on collective meanings. Ironically, generative A.I. has emerged just as we&rsquo;re already emeshed in a human-created crisis of cultural overproduction. Most human-created art today fails to take on social value.</p>\n</blockquote>\n<p><!-- raw HTML omitted -->W. David Marx: <em>Culture: An Owner&rsquo;s Manual</em> — <a href=\"https://culture.ghost.io/our-natural-human-defenses-against-a-i-culture/\">&lsquo;Our Natural Human Defenses Against A.I. Culture&rsquo;</a><!-- raw HTML omitted --></p>\n",
				"content_text": "A pair of highlighted passages from recommended recent newsletters: \n\n> our political and social structures, the philosophies and ways we’ve educated ourselves aren’t up to the task of truly, ethically handling many of our contemporary technologies or sciences of the quantum echelon  \n\n<span style=\"font-size: 14px;\">Craig Mod: *Roden* #082 — ['Sandwiches, Oppenheimer, Shooting Film'](https://craigmod.com/roden/082/)</span>\n\n> As much as A.I. has gotten better at making human-like art, creation is arguably the easiest step in the process of cultural formation. Every day thousands if not millions of people propose new ideas and practices, but only a tiny sliver ever win attention, attract adherents, or take on collective meanings. Ironically, generative A.I. has emerged just as we're already emeshed in a human-created crisis of cultural overproduction. Most human-created art today fails to take on social value.\n\n<span style=\"font-size: 14px;\">W. David Marx: *Culture: An Owner's Manual* — ['Our Natural Human Defenses Against A.I. Culture'](https://culture.ghost.io/our-natural-human-defenses-against-a-i-culture/)</span>\n",
				"date_published": "2023-08-09T18:42:14+01:00",
				"url": "https://blog.zioibi.com/2023/08/09/a-pair-of.html"
			},
			{
				"id": "http://adam.micro.blog/2023/08/09/ive-just-finished.html",
				
				"content_html": "<p>I&rsquo;ve just finished Barbara Kingsolver&rsquo;s superb novel <a href=\"https://micro.blog/books/9780571376490\"><em>Demon Copperhead</em></a> (2022), winner of both the Pulitzer Prize and the Women&rsquo;s Prize for Fiction (and yet, curiously not nominated for the Booker Prize). The book was my pick for this summer&rsquo;s instalment of my annual read-along project, <a href=\"https://zioibi.com/si\">Sipped Ink</a>, and as such, most of what I have to say about it has made its way into <a href=\"https://zioibi.com/siv9\">the weekly newsletters</a> over the last six weeks. I will say that it&rsquo;s absolutely proven to be one of those novels that I&rsquo;m simultaneously sad to finish and glad to have read. Heartbreaking, deeply empathetic, and told in the voice of one the most endearing narrators I&rsquo;ve encountered in a long while. 📚</p>\n",
				"content_text": "I've just finished Barbara Kingsolver's superb novel [*Demon Copperhead*](https://micro.blog/books/9780571376490) (2022), winner of both the Pulitzer Prize and the Women's Prize for Fiction (and yet, curiously not nominated for the Booker Prize). The book was my pick for this summer's instalment of my annual read-along project, [Sipped Ink](https://zioibi.com/si), and as such, most of what I have to say about it has made its way into [the weekly newsletters](https://zioibi.com/siv9) over the last six weeks. I will say that it's absolutely proven to be one of those novels that I'm simultaneously sad to finish and glad to have read. Heartbreaking, deeply empathetic, and told in the voice of one the most endearing narrators I've encountered in a long while. 📚\n",
				"date_published": "2023-08-09T18:25:38+01:00",
				"url": "https://blog.zioibi.com/2023/08/09/ive-just-finished.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/08/in-an-effort.html",
				
				"content_html": "<p>In an effort to consolidate some of my online footprint, I&rsquo;m winding up use of the service I&rsquo;ve previously employed for bookmarking images, and I&rsquo;ll likely post a few here more frequently — for my future reference more than anything else.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "In an effort to consolidate some of my online footprint, I'm winding up use of the service I've previously employed for bookmarking images, and I'll likely post a few here more frequently — for my future reference more than anything else. \n\n<img src=\"https://adam.micro.blog/uploads/2023/6108d2d4-f077-4501-8043-0e829f4818df.png\" width=\"600\" height=\"746\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/d54e664d-5d5b-42b8-8719-d8d1fbc91b4d.png\" width=\"600\" height=\"750\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/05bdd7cb-1268-45a1-af80-0981feb146b0.png\" width=\"600\" height=\"750\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/603fcac5-2587-4549-9988-5a70cbe44bc0.png\" width=\"600\" height=\"748\" alt=\"\">\n",
				"date_published": "2023-08-08T16:47:02+01:00",
				"url": "https://blog.zioibi.com/2023/08/08/in-an-effort.html",
				"tags": ["visual inspo"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/07/patricia-lockwood-on.html",
				
				"content_html": "<p><a href=\"https://www.lrb.co.uk/the-paper/v45/n14/patricia-lockwood/where-be-your-jibes-now\">Patricia Lockwood on David Foster Wallace</a>, for the <em>London Review of Books</em> 📚</p>\n<blockquote>\n<p>As he writes in one of his most typically tall-tale essays, ‘Derivative Sport in Tornado Alley’, he was, as a ‘near-great’ junior tennis player, at his very best in bad conditions. In fiction, he creates them; he serves himself sleet, hail, sun in the eye, all for the chance to play through them.</p>\n</blockquote>\n",
				"content_text": "[Patricia Lockwood on David Foster Wallace](https://www.lrb.co.uk/the-paper/v45/n14/patricia-lockwood/where-be-your-jibes-now), for the *London Review of Books* 📚\n\n> As he writes in one of his most typically tall-tale essays, ‘Derivative Sport in Tornado Alley’, he was, as a ‘near-great’ junior tennis player, at his very best in bad conditions. In fiction, he creates them; he serves himself sleet, hail, sun in the eye, all for the chance to play through them.\n",
				"date_published": "2023-08-07T22:03:29+01:00",
				"url": "https://blog.zioibi.com/2023/08/07/patricia-lockwood-on.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/07/a-few-snaps.html",
				
				"content_html": "<p>A few snaps from yesterday&rsquo;s trip to Bath: decent coffee; incredible pizza; a nice walk down along the canal. Happening past a building once home to Jane Austen was a wonderful surprise!</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "A few snaps from yesterday's trip to Bath: decent coffee; incredible pizza; a nice walk down along the canal. Happening past a building once home to Jane Austen was a wonderful surprise!\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8549.png\" width=\"600\" height=\"800\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8551.jpeg\" width=\"600\" height=\"800\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8561.png\" width=\"600\" height=\"450\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8568.png\" width=\"600\" height=\"800\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8571.png\" width=\"600\" height=\"800\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8574.png\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-08-07T13:15:05+01:00",
				"url": "https://blog.zioibi.com/2023/08/07/a-few-snaps.html"
			},
			{
				"id": "http://adam.micro.blog/2023/08/04/additions-to-the.html",
				
				"content_html": "<p>Additions to the queue on #newmusicfriday — a quieter week, but maybe there&rsquo;s something here. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Additions to the queue on #newmusicfriday — a quieter week, but maybe there's something here. 🎵\n\n<img src=\"https://adam.micro.blog/uploads/2023/image.png\" width=\"245\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-08-04T09:08:50+01:00",
				"url": "https://blog.zioibi.com/2023/08/04/additions-to-the.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/02/another-wes-anderson.html",
				
				"content_html": "<p>Another Wes Anderson note for the day, since I just watched <em>The Afterparty</em> s2e4. Say what you will about the specifics of Anderson&rsquo;s filmmaking style, but imagine having crafted a bespoke look and tone unique enough to be parodied. Other episodes of <em>The Afterparty</em> have co-opted the styles of whole eras (regency period), and genres (romcom; noir; heist), but s4e2 is borrowing solely from Anderson. How many other filmmakers could you do this for and expect wide recognition from the audience of a half hour comedy? Hitchcock? Miyazaki? Tarantino maybe? Even then, I think it would read to many as a broader adoption of the genres in which they operate. 🍿📺</p>\n",
				"content_text": "Another Wes Anderson note for the day, since I just watched *The Afterparty* s2e4. Say what you will about the specifics of Anderson's filmmaking style, but imagine having crafted a bespoke look and tone unique enough to be parodied. Other episodes of *The Afterparty* have co-opted the styles of whole eras (regency period), and genres (romcom; noir; heist), but s4e2 is borrowing solely from Anderson. How many other filmmakers could you do this for and expect wide recognition from the audience of a half hour comedy? Hitchcock? Miyazaki? Tarantino maybe? Even then, I think it would read to many as a broader adoption of the genres in which they operate. 🍿📺\n",
				"date_published": "2023-08-02T14:17:59+01:00",
				"url": "https://blog.zioibi.com/2023/08/02/another-wes-anderson.html",
				"tags": ["movies","tv"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/02/ever-since-i.html",
				
				"content_html": "<p>Ever since I saw <em>Asteroid City</em> a few weeks ago, I&rsquo;ve been pondering a re-watch of Wes Anderson&rsquo;s whole back catalogue. Reading this <a href=\"https://www.subtraction.com/2023/07/26/movies-watched-june-2023/\">piece by Khoi Vinh</a> has suggested a new frame through which to do so:</p>\n<blockquote>\n<p>Anderson is a child at heart, of course, and that shows up countless times in his films, whether it’s in his scripts or his stage dressing or his picture book-like cinematography. However, the flip side of this youthful empathy is that Anderson is essentially lost when it comes to adult characters and, by extension, stories about adults. For me, this is the weakness that sabotages films like <em>The Life Aquatic with Steve Zissou</em> and the abysmal <em>The Darjeeling Limited</em>, which are populated with nonsensical, schematized characters that talk at one another but never truly interact.</p>\n</blockquote>\n<p>My personal ranking of Anderson&rsquo;s movies, as it stands right now, looks like this:</p>\n<p>1 — <em>The Royal Tenenbaums</em><br>\n2 — <em>Asteroid City</em><br>\n3 — <em>The Grand Budapest Hotel</em><br>\n4 — <em>The French Dispatch</em><br>\n5 — <em>Rushmore</em><br>\n6 — <em>Moonrise Kingdom</em><br>\n7 — <em>Isle of Dogs</em><br>\n8 — <em>Fantastic Mr. Fox</em><br>\n9 — <em>The Life Aquatic with Steve Zissou</em><br>\n10 — <em>The Darjeeling Limited</em><br>\n11 — <em>Bottle Rocket</em></p>\n<p>I&rsquo;m not sure I&rsquo;d call <em>The Darjeeling Limited</em> &lsquo;abysmal&rsquo; as Vinh does, but it&rsquo;s one of a few that I&rsquo;ve only seen once. I recall coming away from it very disappointed, and I don&rsquo;t recall now what it was about the film that didn&rsquo;t work for me. I find it interesting that Vinh offers a reason for the relative weakness of both <em>Darjeeling</em> &amp; <em>Life Aquatic</em> that I&rsquo;d not considered before — it might be fun to go back through Anderson&rsquo;s oeuvre with this in mind. (<!-- raw HTML omitted -->FWIW<!-- raw HTML omitted --> <em>Bottle Rocket</em> is another I&rsquo;ve seen only once, and which felt to me like Anderson&rsquo;s <em>Pablo Honey</em>: by no means bad, but containing only glimpses of future greatness.) 🍿</p>\n",
				"content_text": "Ever since I saw *Asteroid City* a few weeks ago, I've been pondering a re-watch of Wes Anderson's whole back catalogue. Reading this [piece by Khoi Vinh](https://www.subtraction.com/2023/07/26/movies-watched-june-2023/) has suggested a new frame through which to do so: \r\n\r\n> Anderson is a child at heart, of course, and that shows up countless times in his films, whether it’s in his scripts or his stage dressing or his picture book-like cinematography. However, the flip side of this youthful empathy is that Anderson is essentially lost when it comes to adult characters and, by extension, stories about adults. For me, this is the weakness that sabotages films like *The Life Aquatic with Steve Zissou* and the abysmal *The Darjeeling Limited*, which are populated with nonsensical, schematized characters that talk at one another but never truly interact.\r\n\r\nMy personal ranking of Anderson's movies, as it stands right now, looks like this:\r\n\r\n1 — *The Royal Tenenbaums*  \r\n2 — *Asteroid City*  \r\n3 — *The Grand Budapest Hotel*  \r\n4 — *The French Dispatch*  \r\n5 — *Rushmore*  \r\n6 — *Moonrise Kingdom*  \r\n7 — *Isle of Dogs*  \r\n8 — *Fantastic Mr. Fox*  \r\n9 — *The Life Aquatic with Steve Zissou*  \r\n10 — *The Darjeeling Limited*  \r\n11 — *Bottle Rocket*  \r\n\r\nI'm not sure I'd call *The Darjeeling Limited* 'abysmal' as Vinh does, but it's one of a few that I've only seen once. I recall coming away from it very disappointed, and I don't recall now what it was about the film that didn't work for me. I find it interesting that Vinh offers a reason for the relative weakness of both *Darjeeling* & *Life Aquatic* that I'd not considered before — it might be fun to go back through Anderson's oeuvre with this in mind. (<sc>FWIW</sc> *Bottle Rocket* is another I've seen only once, and which felt to me like Anderson's *Pablo Honey*: by no means bad, but containing only glimpses of future greatness.) 🍿\n",
				"date_published": "2023-08-02T11:34:04+01:00",
				"url": "https://blog.zioibi.com/2023/08/02/ever-since-i.html",
				"tags": ["movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/02/i-love-this.html",
				
				"content_html": "<p>I love this illustration by <a href=\"https://www.christophniemann.com/\">Christoph Niemann</a>, from <em>A Velocity of Being: Letters to a Young Reader</em> (2019). 🎨</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I love this illustration by [Christoph Niemann](https://www.christophniemann.com/), from *A Velocity of Being: Letters to a Young Reader* (2019). 🎨\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/velocity-christophniemann.png\" width=\"600\" height=\"733\" alt=\"\">\n",
				"date_published": "2023-08-02T10:57:42+01:00",
				"url": "https://blog.zioibi.com/2023/08/02/i-love-this.html",
				"tags": ["art"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/01/new-today-from.html",
				
				"content_html": "<p>New today from a friend&rsquo;s fuzz-rock band, <a href=\"https://desirelinesband.com\">Desire Lines</a>. The &lsquo;Everything is Fine&rsquo; EP is out now on Bandcamp, and major streaming platforms. 🎵<br>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "New today from a friend's fuzz-rock band, [Desire Lines](https://desirelinesband.com). The 'Everything is Fine' EP is out now on Bandcamp, and major streaming platforms. 🎵  \r\n<br>\r\n<iframe style=\"border: 0; width: 350px; height: 470px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2280401654/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/transparent=true/\" seamless><a href=\"https://desirelinesband.bandcamp.com/album/everything-is-fine\">Everything Is Fine by Desire Lines</a></iframe>\n",
				"date_published": "2023-08-01T13:12:26+01:00",
				"url": "https://blog.zioibi.com/2023/08/01/new-today-from.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/08/01/this-morning-the.html",
				
				"content_html": "<p>This morning the longlist was announced for this year’s Booker Prize, and it is not what I had expected. Perhaps my perspective has been mildly warped by the fact that I’m currently leading <a href=\"https://zioibi.com/siv9\">a group read-along</a> of <em>Demon Copperhead</em>, but — having won both the Pulitzer Prize &amp; the Women’s Prize for Fiction — it felt like Barbara Kingsolver’s novel was a lock for the list. Not only that, I had also anticipated spots amongst the thirteen longlisted novels<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> for Eleanor Catton’s <em>Birnam Wood</em>; Catherine Lacy’s <em>Biography of X</em>; Salman Rushdie’s <em>Victory City</em>; and possibly John Banville’s <em>The Singularities</em>. So, all told, I went 0/5 on these predictions!</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/f2bfxtxxkaatnca.png\" alt=\"\"></p>\n<p>The vast majority of these titles are new to me, and I’ve read none of them. I’m not committed to reading the whole list — <a href=\"https://adam.micro.blog/booker21/\">as I did a couple of years ago</a> — but I’ll certainly be looking more closely at a few of these titles in the coming months. 📚</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>the so-called ‘Booker Dozen’&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "This morning the longlist was announced for this year’s Booker Prize, and it is not what I had expected. Perhaps my perspective has been mildly warped by the fact that I’m currently leading [a group read-along](https://zioibi.com/siv9) of *Demon Copperhead*, but — having won both the Pulitzer Prize & the Women’s Prize for Fiction — it felt like Barbara Kingsolver’s novel was a lock for the list. Not only that, I had also anticipated spots amongst the thirteen longlisted novels[^1] for Eleanor Catton’s *Birnam Wood*; Catherine Lacy’s *Biography of X*; Salman Rushdie’s *Victory City*; and possibly John Banville’s *The Singularities*. So, all told, I went 0/5 on these predictions!\n\n![](https://adam.micro.blog/uploads/2023/f2bfxtxxkaatnca.png)\n\nThe vast majority of these titles are new to me, and I’ve read none of them. I’m not committed to reading the whole list — [as I did a couple of years ago](https://adam.micro.blog/booker21/) — but I’ll certainly be looking more closely at a few of these titles in the coming months. 📚\n\n[^1]:\tthe so-called ‘Booker Dozen’\n",
				"date_published": "2023-08-01T10:46:58+01:00",
				"url": "https://blog.zioibi.com/2023/08/01/this-morning-the.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/28/huge-haul-of.html",
				
				"content_html": "<p>Huge haul of albums added to the queue on #newmusicfriday</p>\n<p>I&rsquo;m particularly excited about the new Georgia (who took 7th on <a href=\"https://adam.micro.blog/2020/12/31/the-list.html\">my 2020 end of year list</a>), and the final Brad album, partially recorded before Shawn Smith&rsquo;s passing in 2019. Their <em>Interiors</em> (1997) featured on my list of all-time favourite records, when I put that together a few years ago. 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Huge haul of albums added to the queue on #newmusicfriday \r\n\r\nI'm particularly excited about the new Georgia (who took 7th on [my 2020 end of year list](https://adam.micro.blog/2020/12/31/the-list.html)), and the final Brad album, partially recorded before Shawn Smith's passing in 2019. Their *Interiors* (1997) featured on my list of all-time favourite records, when I put that together a few years ago. 🎵\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/img-8482.png\" width=\"600\" height=\"3650\" alt=\"\">\n",
				"date_published": "2023-07-28T09:21:38+01:00",
				"url": "https://blog.zioibi.com/2023/07/28/huge-haul-of.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/24/over-the-weekend.html",
				
				"content_html": "<p>Over the weekend we took a walk around <a href=\"https://www.botanic-garden.ox.ac.uk/visit-garden\">Oxford Botanic Garden</a>: sat on Lyra &amp; Will&rsquo;s bench (<em>His Dark Materials</em>); met the Cheshire Cat (<em>Alice in Wonderland</em>)&hellip; oh, and saw some incredible plants. Here are a few photos, selected from the dozens that I took! 🌱</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "Over the weekend we took a walk around [Oxford Botanic Garden](https://www.botanic-garden.ox.ac.uk/visit-garden): sat on Lyra & Will's bench (*His Dark Materials*); met the Cheshire Cat (*Alice in Wonderland*)... oh, and saw some incredible plants. Here are a few photos, selected from the dozens that I took! 🌱  \n\n<img src=\"https://adam.micro.blog/uploads/2023/botanic1.png\" width=\"600\" height=\"450\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/botanic2.png\" width=\"600\" height=\"450\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/botanic3.png\" width=\"600\" height=\"450\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/botanic4.png\" width=\"600\" height=\"450\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/botanic5.png\" width=\"600\" height=\"450\" alt=\"\">\n\n<img src=\"https://adam.micro.blog/uploads/2023/img-8431.jpeg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-24T14:10:47+01:00",
				"url": "https://blog.zioibi.com/2023/07/24/over-the-weekend.html"
			},
			{
				"id": "http://adam.micro.blog/2023/07/21/albums-queued-on.html",
				
				"content_html": "<p>Albums queued on #newmusicfriday — there&rsquo;s also a <a href=\"https://album.link/gb/i/1690697566\">Bloc Party EP</a> 🎵</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/img-8355.png\" alt=\"\"></p>\n",
				"content_text": "Albums queued on #newmusicfriday — there's also a [Bloc Party EP](https://album.link/gb/i/1690697566) 🎵\n\n![](https://adam.micro.blog/uploads/2023/img-8355.png)\n",
				"date_published": "2023-07-21T08:53:22+01:00",
				"url": "https://blog.zioibi.com/2023/07/21/albums-queued-on.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/19/top-weezer-songs.html",
				"title": "Top 5 Weezer Songs",
				"content_html": "<p>You can blame this one on <a href=\"https://brett.seybert.me/2023/07/19/the-best-weezer.html\">Brett Seybert</a> — who in turn is blaming it on <a href=\"https://www.welcometohellworld.com/the-world-has-turned-and-left-me-here/\">Luke O’Neil</a> —  but I’ll never pass up a chance to talk Weezer, so here we go.</p>\n<p>To begin, let me say that I’m calling this the ‘Buddy Holly’ Memorial List, for two reasons: a) the band’s most famous song<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> is too easy a pick; b) it’s unbeatable and I need to cheat to get it on this list somehow. So, just for the record, ‘Buddy Holly’ is a perfect song; the guitar lick at 2:09 would be on my list of top 5 <em>moments</em> in recorded music<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup>. It was my introduction to the band, at age 14, in my high school computer room. The inclusion of the (all-time great) music video on the Windows 95 install CD remains both inexplicable, and sort of magical in my mind. So yes, ‘Buddy Holly’ is not on this list, but… you know 😉</p>\n<h3 id=\"jamie-1993\">Jamie (1993)</h3>\n<p>Only fitting then, that my first pick<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote-ref\" role=\"doc-noteref\">3</a></sup> is the b-side from the ‘Buddy Holly’ single. Holy smokes! Has there ever been a better a-side / b-side CD single?<sup id=\"fnref:4\"><a href=\"#fn:4\" class=\"footnote-ref\" role=\"doc-noteref\">4</a></sup> Rivers Cuomo is famously prolific, and he has an ear for melody that is second-to-none. I can’t imagine any other artists dashing off a quirky, sweet paean to their band’s lawyer. That opening feedback, the rumbling riff, the heartfelt lyrics, chant-along bridge, croon-along chorus. Weird and wonderful.</p>\n<h3 id=\"you-gave-your-love-to-me-softly-1995\">You Gave Your Love to Me Softly (1995)</h3>\n<p>Maybe the world’s sweetest 100mph rock ballad? A riff that burns like a lit fuse; another extremely ‘join in at full volume’ chorus; a squealer of a solo… all packed in to less than two minutes. Guaranteed to stick in my head for hours every time I listen to it.</p>\n<h3 id=\"i-just-threw-out-the-love-of-my-dreams-1996\">I Just Threw Out the Love of My Dreams (1996)</h3>\n<p>A sad / sweet synth rock masterpiece with one of my absolute favourite vocal melodies. Rachel Haden is flawless, and the bridge, with its duet vocal, is perfect. Add in Rivers somehow shredding a synth, and building the whole thing to a soaring finish. Unbeatable.</p>\n<h3 id=\"sheila-can-do-it-1996--2020\">Sheila Can Do It (1996 / 2020)</h3>\n<p>How about an album track? And a recent one too, just to prove I’m not an insufferable hipster. For me, this is easily the highlight of Weezer’s last 15 years. That it’s core is essentially unchanged from the 1996 demo version probably says something, but I adore this sing-song vocal melody and playful riff. The bridge and chorus are unimpeachable.</p>\n<h3 id=\"listen-up-2001\">Listen Up (2001)</h3>\n<p>OK, I’m an insufferable hipster. This is probably one of my favourite songs ever, by any artist, and it’s a demo from the peak of Rivers’ hyper-productive period around the Green album when every b-side and off-cut was better than what was ending up on other bands’ albums. The dynamics of this song are a marvel to me, and perfectly capture a seemingly effortless knack for imbuing simple pop melodies with aching beauty. So few artists can pull off that trick with any consistency: among them Lennon &amp; McCartney; Brian Wilson; Rivers Cuomo. If you don’t happen to have the 2001 demo (or BBC live session) lying around, <a href=\"https://youtu.be/58oC65i-AcI\">here’s a YouTube version</a> — enjoy! 🎵</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Is this still true? Do people think of ‘Hash Pipe’ and / or ‘Beverly Hills’ now, when you mention Weezer? If so, shame.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>FWIW, the only thing I know right now would beat it, is the piano part at 1:22 – 2:18 on Nina Simone’s ‘My Baby Just Cares For Me’.&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:3\" role=\"doc-endnote\">\n<p>These are in chronological order.&#160;<a href=\"#fnref:3\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:4\" role=\"doc-endnote\">\n<p>Nirvana’s ‘Lithium’ / ‘Been a Son’ combo, or The White Stripes’ one-two punch ‘Fell In Love With a Girl’ / ‘Let’s Shake Hands’ are the only couple that come to mind that could maybe compete.&#160;<a href=\"#fnref:4\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "You can blame this one on [Brett Seybert](https://brett.seybert.me/2023/07/19/the-best-weezer.html) — who in turn is blaming it on [Luke O’Neil](https://www.welcometohellworld.com/the-world-has-turned-and-left-me-here/) —  but I’ll never pass up a chance to talk Weezer, so here we go. \n\nTo begin, let me say that I’m calling this the ‘Buddy Holly’ Memorial List, for two reasons: a) the band’s most famous song[^1] is too easy a pick; b) it’s unbeatable and I need to cheat to get it on this list somehow. So, just for the record, ‘Buddy Holly’ is a perfect song; the guitar lick at 2:09 would be on my list of top 5 *moments* in recorded music[^2]. It was my introduction to the band, at age 14, in my high school computer room. The inclusion of the (all-time great) music video on the Windows 95 install CD remains both inexplicable, and sort of magical in my mind. So yes, ‘Buddy Holly’ is not on this list, but… you know 😉\n\n### Jamie (1993)\nOnly fitting then, that my first pick[^3] is the b-side from the ‘Buddy Holly’ single. Holy smokes! Has there ever been a better a-side / b-side CD single?[^4] Rivers Cuomo is famously prolific, and he has an ear for melody that is second-to-none. I can’t imagine any other artists dashing off a quirky, sweet paean to their band’s lawyer. That opening feedback, the rumbling riff, the heartfelt lyrics, chant-along bridge, croon-along chorus. Weird and wonderful. \n\n### You Gave Your Love to Me Softly (1995)\nMaybe the world’s sweetest 100mph rock ballad? A riff that burns like a lit fuse; another extremely ‘join in at full volume’ chorus; a squealer of a solo… all packed in to less than two minutes. Guaranteed to stick in my head for hours every time I listen to it. \n\n### I Just Threw Out the Love of My Dreams (1996)\nA sad / sweet synth rock masterpiece with one of my absolute favourite vocal melodies. Rachel Haden is flawless, and the bridge, with its duet vocal, is perfect. Add in Rivers somehow shredding a synth, and building the whole thing to a soaring finish. Unbeatable. \n\n### Sheila Can Do It (1996 / 2020)\nHow about an album track? And a recent one too, just to prove I’m not an insufferable hipster. For me, this is easily the highlight of Weezer’s last 15 years. That it’s core is essentially unchanged from the 1996 demo version probably says something, but I adore this sing-song vocal melody and playful riff. The bridge and chorus are unimpeachable. \n\n### Listen Up (2001)\nOK, I’m an insufferable hipster. This is probably one of my favourite songs ever, by any artist, and it’s a demo from the peak of Rivers’ hyper-productive period around the Green album when every b-side and off-cut was better than what was ending up on other bands’ albums. The dynamics of this song are a marvel to me, and perfectly capture a seemingly effortless knack for imbuing simple pop melodies with aching beauty. So few artists can pull off that trick with any consistency: among them Lennon & McCartney; Brian Wilson; Rivers Cuomo. If you don’t happen to have the 2001 demo (or BBC live session) lying around, [here’s a YouTube version](https://youtu.be/58oC65i-AcI) — enjoy! 🎵\n\n[^1]:\tIs this still true? Do people think of ‘Hash Pipe’ and / or ‘Beverly Hills’ now, when you mention Weezer? If so, shame.\n\n[^2]:\tFWIW, the only thing I know right now would beat it, is the piano part at 1:22 – 2:18 on Nina Simone’s ‘My Baby Just Cares For Me’.\n\n[^3]:\tThese are in chronological order.\n\n[^4]:\tNirvana’s ‘Lithium’ / ‘Been a Son’ combo, or The White Stripes’ one-two punch ‘Fell In Love With a Girl’ / ‘Let’s Shake Hands’ are the only couple that come to mind that could maybe compete.\n",
				"date_published": "2023-07-19T18:06:46+01:00",
				"url": "https://blog.zioibi.com/2023/07/19/top-weezer-songs.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/14/added-to-the.html",
				
				"content_html": "<p>Added to the queue on #newmusicfriday — I’m most excited for the new Palehound, and the Claud debut. 🎵</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/media.png\" alt=\"\"></p>\n",
				"content_text": "Added to the queue on #newmusicfriday — I’m most excited for the new Palehound, and the Claud debut. 🎵\n\n![](https://adam.micro.blog/uploads/2023/media.png)\n",
				"date_published": "2023-07-14T10:20:12+01:00",
				"url": "https://blog.zioibi.com/2023/07/14/added-to-the.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/12/in-the-last.html",
				
				"content_html": "<p>In the last couple of years, since spinning up a Gaming division, Netflix has quietly built an enviable portfolio of titles available (at no extra charge) to subscribers. I’m writing this today because the long-awaited <em>Oxenfree II: Lost Signals</em> has just been released. The developers behind this title (and the original <em>Oxenfree</em>), <a href=\"https://nightschoolstudio.com/\">Night School</a>, were one of the first studios to be acquired by Netflix<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>, signalling that they were serious about games. I had a great time with the original game when it was released in 2016, and this week I picked up a month of Netflix mainly to play the sequel. Such is the company’s strategy, presumably: to add to their content release schedule not just new TV shows, but must-play games — two parallel tracks via which to gain (and keep) subscribers.</p>\n<p>Consider your options if you want to play the new game right now:</p>\n<p>• Steam (PC &amp; Mac): £13.49 (25% launch sale, down from £17.99)<br>\n• Nintendo Switch: £13.49 (25% launch sale, down from £17.99)<br>\n• PlayStation: £14.24 (25% launch sale, down from £18.99)</p>\n<p>Or, you can pick up a month of Netflix (from £4.99), and play the game on your iOS or Android device. Plus, you get to finish season three of <em>Emily in Paris</em>!</p>\n<p>Here’s a list of a few other games on the service that I would recommend:</p>\n<p>• <em>Terra Nil</em> — city-builder / strategy<br>\n• <em>Kentucky Route Zero</em> — truly one-of-a-kind point &amp; click adventure<br>\n• <em>Immortality</em> — one of my absolute favourite games of 2022<br>\n• <em>Spiritfarer</em> — sweet, easygoing management-style game<br>\n• <em>Into the Breach</em> — space-set turn-based strategy<br>\n• <em>Moonlighter</em> — shop management</p>\n<p>And of course, the original <em>Oxenfree</em> — spooky adventure with excellent writing.<br>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p>I’m not affiliated with Netflix in any way, nor would I accept money from anyone to advertise anything, ever<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup>. But, I do believe in sharing cool things when I find them, and in my experience a lot of people with active Netflix subscriptions don’t know that they could also be playing excellent games without spending an extra penny. 🕹️</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>in September of 2021&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>I was actually close to writing a post today about how gross it is to see <a href=\"https://adam.micro.blog/uploads/2023/img-8239.png\">all the SEO clickbait pieces popping</a> up shilling for Prime Day — yuk!&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "In the last couple of years, since spinning up a Gaming division, Netflix has quietly built an enviable portfolio of titles available (at no extra charge) to subscribers. I’m writing this today because the long-awaited *Oxenfree II: Lost Signals* has just been released. The developers behind this title (and the original *Oxenfree*), [Night School](https://nightschoolstudio.com/), were one of the first studios to be acquired by Netflix[^1], signalling that they were serious about games. I had a great time with the original game when it was released in 2016, and this week I picked up a month of Netflix mainly to play the sequel. Such is the company’s strategy, presumably: to add to their content release schedule not just new TV shows, but must-play games — two parallel tracks via which to gain (and keep) subscribers. \n\nConsider your options if you want to play the new game right now: \n\n• Steam (PC & Mac): £13.49 (25% launch sale, down from £17.99)   \n• Nintendo Switch: £13.49 (25% launch sale, down from £17.99)  \n• PlayStation: £14.24 (25% launch sale, down from £18.99)  \n\nOr, you can pick up a month of Netflix (from £4.99), and play the game on your iOS or Android device. Plus, you get to finish season three of *Emily in Paris*! \n\nHere’s a list of a few other games on the service that I would recommend: \n\n• *Terra Nil* — city-builder / strategy  \n• *Kentucky Route Zero* — truly one-of-a-kind point & click adventure  \n• *Immortality* — one of my absolute favourite games of 2022  \n• *Spiritfarer* — sweet, easygoing management-style game   \n• *Into the Breach* — space-set turn-based strategy  \n• *Moonlighter* — shop management  \n\nAnd of course, the original *Oxenfree* — spooky adventure with excellent writing.  \n<br>\n<div style=\"text-align: center; color: #cfcfcf;\">• • •</div> \n\nI’m not affiliated with Netflix in any way, nor would I accept money from anyone to advertise anything, ever[^2]. But, I do believe in sharing cool things when I find them, and in my experience a lot of people with active Netflix subscriptions don’t know that they could also be playing excellent games without spending an extra penny. 🕹️\n\n[^1]:\tin September of 2021\n\n[^2]:\tI was actually close to writing a post today about how gross it is to see [all the SEO clickbait pieces popping](https://adam.micro.blog/uploads/2023/img-8239.png) up shilling for Prime Day — yuk!\n",
				"date_published": "2023-07-12T19:43:26+01:00",
				"url": "https://blog.zioibi.com/2023/07/12/in-the-last.html",
				"tags": ["videogames"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/11/how-high-are.html",
				"title": "How High are the Garden Walls?",
				"content_html": "<p>This afternoon, UK-based tech company <a href=\"https://nothing.tech\">Nothing</a> unveiled their second smartphone: Nothing Phone (2).</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/nothing-phone-2.png\" alt=\"\"><img src=\"https://adam.micro.blog/uploads/2023/ad76e1ee2464c3417d4339.png\" alt=\"\"></p>\n<p>Just as with the original model, I <strong>love</strong> the way this thing looks, and I admire the design ethos behind it: to make tech innovative and fun again, in an age when iteration on established design languages has become the necessary, safe bet for the entrenched market leaders. Oh, it’s also significantly cheaper than an iPhone. Here are the prices at which some flagship devices start:</p>\n<p>• iPhone 14: £849<br>\n• iPhone 14 Pro: £1,099<br>\n• Google Pixel 7: £599<br>\n• Google Pixel 7 Pro: £849<br>\n• Nothing Phone (2): £579</p>\n<p>I have been an iPhone user since 2011’s iPhone 4S. Over that decade-plus — in which I’ve owned four different models — Apple has worked to ensure that the iPhone has increasingly become the centre of a whole ecosystem of devices and services. The upshot of this strategy (and, indeed, the purpose of it), is that there are significant obstacles for anyone considering a move <em>away</em> from Apple’s phone. As an experiment, I thought I’d do some thinking about what it would mean for me to make the switch.</p>\n<p>As a starting point, let’s consider each of the apps currently on my iPhone’s Home Screen:</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/home-screen.png\" alt=\"\"></p>\n<p><strong><a href=\"https://flexibits.com/fantastical\">Fantastical</a></strong> — no Android version is available, but I’m sure there are plenty of calendar apps that would make a fine substitute. However, I would then need to figure out what calendar apps to use on iPad and Mac. At present Fantastical is syncing the iCloud calendars associated with my Apple ID, so I might even need to find a new solution for that.</p>\n<p><strong>Weather</strong> — not a problem; I’m sure there are good Android weather apps.</p>\n<p><strong><a href=\"https://www.apple.com/apple-music/\">Apple Music</a></strong> — there actually <em>is</em> an Android version of Apple’s music service, so I wouldn’t need to make a switch.</p>\n<p><strong><a href=\"https://pocketcasts.com/\">Pocket Casts</a></strong> — this one’s easy, as there’s an Android version.</p>\n<p><strong>Reminders</strong> — again, there are certainly acceptable substitutes for this in the Play Store, <em>but</em> one of my main uses of Reminders is for shopping lists shared with my partner. It works seamlessly because our Apple IDs are associated as a family. Getting the same functionality elsewhere would be relatively easy, but would require asking my partner to download a different app — annoying.</p>\n<p><strong><a href=\"https://culturedcode.com/things/\">Things</a></strong> — no Android version is available, and that’s a significant issue. I’ve used Cultured Code’s task manager to pretty much run my life since January 2010<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. It’s an essential part of how I think about organising things, and I use it everywhere: Mac, iPad, &amp; Apple Watch, but <em>primarily</em> iPhone. Moving away from it would be tricky. My second choice — OmniFocus — also doesn’t have an Android version. I’d have to resort to something like Todoist, which would also incur a paid subscription (unlike Things).</p>\n<p><strong>Photos</strong> — another strong argument for iCloud’s flawless syncing between devices. I’ve been using these things long enough to remember when every photo I took on my phone <em>didn’t</em> automatically appear on all my other devices. But I’m absolutely spoiled by it now, and I don’t want to go back to the days of using middle-man services (eg. syncing to Google Photos, and bridging that to iCloud?) to make sure everything’s available everywhere.</p>\n<p><strong><a href=\"https://hey.com\">HEY</a></strong> — another easy one: there’s an Android version of my email client.</p>\n<p><strong>Messages</strong> — ah, the <a href=\"https://youtu.be/BuaKzm7Kq9Q\">blue bubble vs green bubble</a> dilemma! Amongst friends and family, iMessage is by far my most commonly used messaging platform. Yes, between WhatsApp, Signal, Telegram, &amp; SMS, there are plenty of other options, but the inconvenience of a move away from iMessage isn’t to be underestimated.</p>\n<p><strong><a href=\"https://thebrowser.company/\">Arc</a></strong> — not a huge loss at present, and perhaps The Browser Company will eventually bring this to Android.</p>\n<p><strong><a href=\"https://dayoneapp.com/\">Day One</a></strong> — another cross-platform win: an Android version of this journalling app is available.</p>\n<p><strong><a href=\"https://tapbots.com/ivory/\">Ivory</a></strong> — there’s no Android version of my preferred Mastodon client, and indeed the options look very limited. I’d probably have to switch back to the official app, which is fine, but not a patch on Ivory.</p>\n<p><strong><a href=\"https://getmatter.com\">Matter</a></strong> — my read-it-later service of choice doesn’t have an Android app, so I’d have to switch away from it to an alternative, like Instapaper, Pocket, or Readwise. I don’t do a lot of the actual <em>reading</em> on iPhone though<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup>, so perhaps I could figure out an alternative method of saving items into Matter on the phone, one option being via email.</p>\n<p><strong><a href=\"https://micro.blog\">Micro.blog</a></strong> — a first class Android version of this blogging application is available!</p>\n<p><strong><a href=\"https://marcosatanaka.com/\">MusicBox</a></strong> — Marcos Tanaka’s music tracking app has become an important part of my listening experience. The fact that no Android version is available would put a major kink in my daily work towards compiling my <a href=\"https://adam.micro.blog/thelists\">end of year list</a>.</p>\n<p><strong><a href=\"https://www.reederapp.com/\">Reeder</a></strong> — Similar to Matter (above), my feed-reader of choice (since 2009) is also not available on Android. Again, most of the actual reading gets done elsewhere (iPad &amp; Mac), but I’m not discounting the annoyance of having one device missing from that setup.</p>\n<p><strong><a href=\"https://sonos.com\">Sonos</a></strong> — no issues here: the controller for my home audio system is available on Android.</p>\n<p><strong><a href=\"https://threads.net\">Threads</a></strong> — Meta’s new microblogging platform is by no means an essential part of my digital life, and surely headed to Android in the near future<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote-ref\" role=\"doc-noteref\">3</a></sup>.</p>\n<p><strong>Safari</strong> — I like Safari’s privacy-first approach, but I don’t use any of its syncing features (largely because I use Arc as my browser of choice on Mac). Switching to Firefox or something similar on Android wouldn’t be a major pain point.</p>\n<p><strong><a href=\"https://1password.com\">1Password</a></strong> — luckily my preferred password manager is available everywhere, otherwise this would have been a deal-breaker.</p>\n<p><strong><a href=\"https://bear.app/\">Bear</a></strong> — I’m not married to one particular note-taking application, and I could find something that would work across platforms; perhaps even something with a web / browser version, which would be nice.</p>\n<p><strong><a href=\"https://tot.rocks/\">Tot</a></strong> — this simple scratchpad is an excellent example of a little application that I use all the time, and which relies entirely upon instant iCloud syncing. I <em>could</em> live without it, but I’d prefer not to!</p>\n<p>Looking past the first page, the other stumbling blocks that I can foresee are largely tied to Apple’s own software &amp; services.</p>\n<p>• I use FaceTime with family, all of whom <em>could</em> be persuaded to use a platform agnostic alternative, but why should they change their setups for me?<br>\n<!-- raw HTML omitted -->\n• I use Apple Fitness+ quite a bit, and replacements a) tend to be more expensive, &amp; b) won’t integrate perfectly with my Apple Watch.<br>\n<!-- raw HTML omitted -->\n• Contacts and Wallet both have native Android allegories, but that would mean managing data in both places: eg. adding or updating a contact on both iOS and Android.<br>\n<!-- raw HTML omitted -->\n• There are a lot of little ecosystem touches that would break if I had a non-Apple phone: eg. using the phone keyboard, and auto-filling passwords on Apple TV (much easier than navigating an onscreen keyboard with a remote); setting alarms (and choosing music for them) on my HomePod. In both cases I <em>could</em> pull out the iPad each time, but it’s not ideal.<br>\n<!-- raw HTML omitted -->\n• Not a huge deal, but I also have a case, a MagSafe Wallet, and a MagSafe charger, all of which are highly likely to be compatible with the next iPhone, and are all incompatible with non-Apple options</p>\n<hr>\n<p>In short, switching away from iPhone to an Android device would incur a dozen or so penalties ranging from irksome to genuinely annoying. The penalties for staying <em>with</em> iPhone, of course, are twofold:<br>\n<!-- raw HTML omitted -->\n• No choice as to which operating system you use: you just have what Apple gives you. <a href=\"https://www.apple.com/ios/ios-17-preview/\">iOS 17</a> looks just fine, and has some neat additions, <em>but</em> it is clearly another iteration (and a relatively modest one) on the same design that has persisted since iOS 7 debuted a <strong>decade</strong> ago. Variety is one of Android’s selling points, and Nothing’s OS (for example) has a distinct look that feels genuinely new.<br>\n<!-- raw HTML omitted -->\n• A ~£300 premium on each upgrade. As mentioned, I’ve had four iPhones in 12 years, or an upgrade roughly every three years. If the difference between an iPhone and a perfectly capable Android device is £300 each time, that adds up.</p>\n<p>One of the reasons I have mixed feelings about all of this, is that I’m the same person who was, <a href=\"https://adam.micro.blog/2023/07/05/hey-are-you.html\">not so long ago</a><sup id=\"fnref:4\"><a href=\"#fn:4\" class=\"footnote-ref\" role=\"doc-noteref\">4</a></sup>, espousing the virtues of not tying oneself into centralised social platforms — of operating independent of any one company’s choices over your experience. And yet here I am lamenting the fact that I’ve voluntarily accrued enough Apple hardware, software, and services, that it would be a pain to break free of them. Yes, <em>of course</em> I appreciate on a daily basis how well all of the components of Apple’s ecosystem work together. But I’m not going to pretend there isn’t a downside, and it comes in the form of lock-in.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>I have receipts!&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>That’s reserved largely for the iPad.&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:3\" role=\"doc-endnote\">\n<p>possibly before they launch a web version!?&#160;<a href=\"#fnref:3\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:4\" role=\"doc-endnote\">\n<p>and <a href=\"https://adam.micro.blog/2023/01/01/i-know-im.html\">not for the first time</a>&#160;<a href=\"#fnref:4\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "This afternoon, UK-based tech company [Nothing](https://nothing.tech) unveiled their second smartphone: Nothing Phone (2). \n\n![](https://adam.micro.blog/uploads/2023/nothing-phone-2.png)![](https://adam.micro.blog/uploads/2023/ad76e1ee2464c3417d4339.png)\n\nJust as with the original model, I **love** the way this thing looks, and I admire the design ethos behind it: to make tech innovative and fun again, in an age when iteration on established design languages has become the necessary, safe bet for the entrenched market leaders. Oh, it’s also significantly cheaper than an iPhone. Here are the prices at which some flagship devices start: \n\n• iPhone 14: £849  \n• iPhone 14 Pro: £1,099  \n• Google Pixel 7: £599  \n• Google Pixel 7 Pro: £849  \n• Nothing Phone (2): £579  \n\nI have been an iPhone user since 2011’s iPhone 4S. Over that decade-plus — in which I’ve owned four different models — Apple has worked to ensure that the iPhone has increasingly become the centre of a whole ecosystem of devices and services. The upshot of this strategy (and, indeed, the purpose of it), is that there are significant obstacles for anyone considering a move *away* from Apple’s phone. As an experiment, I thought I’d do some thinking about what it would mean for me to make the switch. \n\nAs a starting point, let’s consider each of the apps currently on my iPhone’s Home Screen: \n\n![](https://adam.micro.blog/uploads/2023/home-screen.png)\n\n**[Fantastical](https://flexibits.com/fantastical)** — no Android version is available, but I’m sure there are plenty of calendar apps that would make a fine substitute. However, I would then need to figure out what calendar apps to use on iPad and Mac. At present Fantastical is syncing the iCloud calendars associated with my Apple ID, so I might even need to find a new solution for that. \n\n**Weather** — not a problem; I’m sure there are good Android weather apps.\n\n**[Apple Music](https://www.apple.com/apple-music/)** — there actually *is* an Android version of Apple’s music service, so I wouldn’t need to make a switch. \n\n**[Pocket Casts](https://pocketcasts.com/)** — this one’s easy, as there’s an Android version. \n\n**Reminders** — again, there are certainly acceptable substitutes for this in the Play Store, *but* one of my main uses of Reminders is for shopping lists shared with my partner. It works seamlessly because our Apple IDs are associated as a family. Getting the same functionality elsewhere would be relatively easy, but would require asking my partner to download a different app — annoying. \n\n**[Things](https://culturedcode.com/things/)** — no Android version is available, and that’s a significant issue. I’ve used Cultured Code’s task manager to pretty much run my life since January 2010[^1]. It’s an essential part of how I think about organising things, and I use it everywhere: Mac, iPad, & Apple Watch, but *primarily* iPhone. Moving away from it would be tricky. My second choice — OmniFocus — also doesn’t have an Android version. I’d have to resort to something like Todoist, which would also incur a paid subscription (unlike Things). \n\n**Photos** — another strong argument for iCloud’s flawless syncing between devices. I’ve been using these things long enough to remember when every photo I took on my phone *didn’t* automatically appear on all my other devices. But I’m absolutely spoiled by it now, and I don’t want to go back to the days of using middle-man services (eg. syncing to Google Photos, and bridging that to iCloud?) to make sure everything’s available everywhere.\n\n**[HEY](https://hey.com)** — another easy one: there’s an Android version of my email client.\n\n**Messages** — ah, the [blue bubble vs green bubble](https://youtu.be/BuaKzm7Kq9Q) dilemma! Amongst friends and family, iMessage is by far my most commonly used messaging platform. Yes, between WhatsApp, Signal, Telegram, & SMS, there are plenty of other options, but the inconvenience of a move away from iMessage isn’t to be underestimated. \n\n**[Arc](https://thebrowser.company/)** — not a huge loss at present, and perhaps The Browser Company will eventually bring this to Android. \n\n**[Day One](https://dayoneapp.com/)** — another cross-platform win: an Android version of this journalling app is available. \n\n**[Ivory](https://tapbots.com/ivory/)** — there’s no Android version of my preferred Mastodon client, and indeed the options look very limited. I’d probably have to switch back to the official app, which is fine, but not a patch on Ivory. \n\n**[Matter](https://getmatter.com)** — my read-it-later service of choice doesn’t have an Android app, so I’d have to switch away from it to an alternative, like Instapaper, Pocket, or Readwise. I don’t do a lot of the actual *reading* on iPhone though[^2], so perhaps I could figure out an alternative method of saving items into Matter on the phone, one option being via email. \n\n**[Micro.blog](https://micro.blog)** — a first class Android version of this blogging application is available!\n\n**[MusicBox](https://marcosatanaka.com/)** — Marcos Tanaka’s music tracking app has become an important part of my listening experience. The fact that no Android version is available would put a major kink in my daily work towards compiling my [end of year list](https://adam.micro.blog/thelists). \n\n**[Reeder](https://www.reederapp.com/)** — Similar to Matter (above), my feed-reader of choice (since 2009) is also not available on Android. Again, most of the actual reading gets done elsewhere (iPad & Mac), but I’m not discounting the annoyance of having one device missing from that setup. \n\n**[Sonos](https://sonos.com)** — no issues here: the controller for my home audio system is available on Android. \n\n**[Threads](https://threads.net)** — Meta’s new microblogging platform is by no means an essential part of my digital life, and surely headed to Android in the near future[^3]. \n\n**Safari** — I like Safari’s privacy-first approach, but I don’t use any of its syncing features (largely because I use Arc as my browser of choice on Mac). Switching to Firefox or something similar on Android wouldn’t be a major pain point. \n\n**[1Password](https://1password.com)** — luckily my preferred password manager is available everywhere, otherwise this would have been a deal-breaker. \n\n**[Bear](https://bear.app/)** — I’m not married to one particular note-taking application, and I could find something that would work across platforms; perhaps even something with a web / browser version, which would be nice. \n\n**[Tot](https://tot.rocks/)** — this simple scratchpad is an excellent example of a little application that I use all the time, and which relies entirely upon instant iCloud syncing. I *could* live without it, but I’d prefer not to! \n\nLooking past the first page, the other stumbling blocks that I can foresee are largely tied to Apple’s own software & services.\n\n• I use FaceTime with family, all of whom *could* be persuaded to use a platform agnostic alternative, but why should they change their setups for me?  \n<br>\n• I use Apple Fitness+ quite a bit, and replacements a) tend to be more expensive, & b) won’t integrate perfectly with my Apple Watch.  \n<br>\n• Contacts and Wallet both have native Android allegories, but that would mean managing data in both places: eg. adding or updating a contact on both iOS and Android.   \n<br>\n• There are a lot of little ecosystem touches that would break if I had a non-Apple phone: eg. using the phone keyboard, and auto-filling passwords on Apple TV (much easier than navigating an onscreen keyboard with a remote); setting alarms (and choosing music for them) on my HomePod. In both cases I *could* pull out the iPad each time, but it’s not ideal.   \n<br>\n• Not a huge deal, but I also have a case, a MagSafe Wallet, and a MagSafe charger, all of which are highly likely to be compatible with the next iPhone, and are all incompatible with non-Apple options  \n\n\n---- \nIn short, switching away from iPhone to an Android device would incur a dozen or so penalties ranging from irksome to genuinely annoying. The penalties for staying *with* iPhone, of course, are twofold:  \n<br>\n• No choice as to which operating system you use: you just have what Apple gives you. [iOS 17](https://www.apple.com/ios/ios-17-preview/) looks just fine, and has some neat additions, *but* it is clearly another iteration (and a relatively modest one) on the same design that has persisted since iOS 7 debuted a **decade** ago. Variety is one of Android’s selling points, and Nothing’s OS (for example) has a distinct look that feels genuinely new.   \n<br>\n• A ~£300 premium on each upgrade. As mentioned, I’ve had four iPhones in 12 years, or an upgrade roughly every three years. If the difference between an iPhone and a perfectly capable Android device is £300 each time, that adds up. \n\nOne of the reasons I have mixed feelings about all of this, is that I’m the same person who was, [not so long ago](https://adam.micro.blog/2023/07/05/hey-are-you.html)[^4], espousing the virtues of not tying oneself into centralised social platforms — of operating independent of any one company’s choices over your experience. And yet here I am lamenting the fact that I’ve voluntarily accrued enough Apple hardware, software, and services, that it would be a pain to break free of them. Yes, *of course* I appreciate on a daily basis how well all of the components of Apple’s ecosystem work together. But I’m not going to pretend there isn’t a downside, and it comes in the form of lock-in. \n\n[^1]:\tI have receipts!\n\n[^2]:\tThat’s reserved largely for the iPad.\n\n[^3]:\tpossibly before they launch a web version!?\n\n[^4]:\tand [not for the first time](https://adam.micro.blog/2023/01/01/i-know-im.html)\n",
				"date_published": "2023-07-11T18:18:07+01:00",
				"url": "https://blog.zioibi.com/2023/07/11/how-high-are.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/07/twoway-mirrors-at.html",
				"title": "Two-way Mirrors at the Mall",
				"content_html": "<p>I forget where now, but one of the most insightful characterisations of centralised social networks that I’ve encountered, is the idea that a few companies tricked everyone into hanging out at the mall. There’s arguably a flaw in the premise of the oft-quoted idea of a singular ‘digital town square for the world’, but if you were to picture a truly <strong>social</strong> space at that magnitude, it likely wouldn’t have billboards strewn throughout it. The conversations wouldn’t be monopolised by attention-seeking celebrities. And you certainly wouldn’t invite weirdly anthropomorphised incarnations of innumerable brands to join the party.</p>\n<p>All of these things were normalised over years of Twitter &amp; Instagram’s dominance of the social media sphere. Spaces that were ostensibly for people to share their experiences and have conversations, came to include — and arguably to be characterised by — the contributions of others who had alternative motives: commonly to garner attention, and/or to sell something. Instead of <em>communication</em>, these platforms became about <em>broadcast</em>.</p>\n<p>After 24 hours playing with Meta’s new microblogging platform — Threads — I’m struck by the extent to which, for all the tsuris in the social media space of late, this established paradigm persists. The platform <em>only</em> has an algorithmically-generated Home feed at present<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>, and whilst this will likely change, it currently plays as a very open admission from Meta that this isn’t designed as a purely social platform. Like latter day Twitter before it — and like its visual-first sister platform, Instagram — Threads is <em>already</em> a place where, yes, you <em>can</em> share your experiences, and socialise with friends, <em>but</em> you do so whilst surrounded by people who eagerly want your attention and your money. This is the promise and the peril of the centralised platform: <em><strong>everyone’s here</strong></em> (but that includes the try-hard brands, and the thirsty celebrities). So, yes, it already feels a little icky, and <a href=\"https://www.threads.net/t/CuW5-eWL34x/\">the advertisers aren’t even there yet</a>. But — <a href=\"https://adam.micro.blog/2023/07/05/hey-are-you.html\">as predicted</a> —  the new platform immediately allowed me to reconnected with some folks who never would have made their way to Mastodon. The colossal power of Instagram’s established social graph did its thing, and <a href=\"https://www.threads.net/t/CuX691ePVBZ/\">48 million Threads accounts were activated in the first ~24 hours</a>. By most estimates, that’s something like <em>four times</em> the size of every combined Mastodon instance, on day one!<br>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p>Whether by design or circumstance, Threads’ much-lauded <a href=\"https://en.wikipedia.org/wiki/ActivityPub\">ActivityPub</a> integration isn’t available at launch. At present it is very much a walled-garden proudly professing its ambitions of federation.<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup> But, overnight, it has become one of the largest entities committed to using the protocol<sup id=\"fnref:3\"><a href=\"#fn:3\" class=\"footnote-ref\" role=\"doc-noteref\">3</a></sup>, and its eventual federation will have consequences for the ActivityPub ecosystem that I don’t think are entirely clear at present. In my experience, reception to the idea on Mastodon has been mixed. Some server admins have pledged to de-federate Threads as soon as it integrates with the protocol; others (including <a href=\"https://omglol.news/2023/06/28/meta-the-fediverse-and-omg-lol\">the admin of my server</a>) have a more balanced view. There have been enough questions floating around, that Mastodon-founder / lead developer <a href=\"https://mastodon.social/@gargron\">Eugen Rochko</a> published <a href=\"https://blog.joinmastodon.org/2023/07/what-to-know-about-threads/\">some notes</a>, seeking to allay fears about Meta’s ability to track Mastodon users, and push adverts to Mastodon servers etc. His conclusion is this:</p>\n<blockquote>\n<p>We have been advocating for interoperability between platforms for years. The biggest hurdle to users switching platforms when those platforms become exploitative is the lock-in of the social graph, the fact that switching platforms means abandoning everyone you know and who knows you. The fact that large platforms are adopting ActivityPub is not only validation of the movement towards decentralized social media, but a path forward for people locked into these platforms to switch to better providers. Which in turn, puts pressure on such platforms to provide better, less exploitative services. This is a clear victory for our cause, hopefully one of many to come.</p>\n</blockquote>\n<p>Whilst there are many unknowns about how all this plays out, I think there’s a good chance that the advent of Threads will redound to the benefit of the social web writ large. Advocates of open protocols like ActivityPub should be optimistic about the arrival of a platform that is already clearly on a path to mass adoption. Whether it’s in weeks’ or months’ time, there will soon be millions more accounts available to follow, almost certainly including people whose posts you will be interested in, but whom would not otherwise have joined a compatible platform. But the best part is, you won’t need to step foot in the mall to follow them. Whatever the Threads experience ultimately becomes, thanks to ActivityPub integration, the option will exist to follow Threads accounts without having to engage with an algorithmically-generated Home feed full of brands and celebrities, without ever having to see an advert, and without giving the surveillance capitalism vampires any more of your data.</p>\n<p>Personally, I intend to keep playing around with Threads for now. Likely as soon as it’s possible, however, I’ll switch to following Threads users via Mastodon. It will be interesting to see how easy or difficult Meta make it for Threads users to find and follow non-Threads sources publishing via ActivityPub. That barrier, whilst it’ll almost certainly be bidirectional, may well involve jumping through some cumbersome hoops not-so-subtly designed to keep people on Meta’s platform. I think I’ll be OK with that. If it leads to a kind of two-way mirror effect, where I can follow Threads users’ posts, but it’s harder for them to find mine… well, that’s arguably a win-win.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>ie. there is no option to see only posts from accounts you follow&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>In this respect (as in others) it’s very similar to Bluesky in its current state.&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:3\" role=\"doc-endnote\">\n<p>Eclipsed only by Tumblr, which reportedly has ~500 million blogs, and is also intending to adopt ActivityPub.&#160;<a href=\"#fnref:3\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "I forget where now, but one of the most insightful characterisations of centralised social networks that I’ve encountered, is the idea that a few companies tricked everyone into hanging out at the mall. There’s arguably a flaw in the premise of the oft-quoted idea of a singular ‘digital town square for the world’, but if you were to picture a truly **social** space at that magnitude, it likely wouldn’t have billboards strewn throughout it. The conversations wouldn’t be monopolised by attention-seeking celebrities. And you certainly wouldn’t invite weirdly anthropomorphised incarnations of innumerable brands to join the party. \n\nAll of these things were normalised over years of Twitter & Instagram’s dominance of the social media sphere. Spaces that were ostensibly for people to share their experiences and have conversations, came to include — and arguably to be characterised by — the contributions of others who had alternative motives: commonly to garner attention, and/or to sell something. Instead of *communication*, these platforms became about *broadcast*.\n\nAfter 24 hours playing with Meta’s new microblogging platform — Threads — I’m struck by the extent to which, for all the tsuris in the social media space of late, this established paradigm persists. The platform *only* has an algorithmically-generated Home feed at present[^1], and whilst this will likely change, it currently plays as a very open admission from Meta that this isn’t designed as a purely social platform. Like latter day Twitter before it — and like its visual-first sister platform, Instagram — Threads is *already* a place where, yes, you *can* share your experiences, and socialise with friends, *but* you do so whilst surrounded by people who eagerly want your attention and your money. This is the promise and the peril of the centralised platform: ***everyone’s here*** (but that includes the try-hard brands, and the thirsty celebrities). So, yes, it already feels a little icky, and [the advertisers aren’t even there yet](https://www.threads.net/t/CuW5-eWL34x/). But — [as predicted](https://adam.micro.blog/2023/07/05/hey-are-you.html) —  the new platform immediately allowed me to reconnected with some folks who never would have made their way to Mastodon. The colossal power of Instagram’s established social graph did its thing, and [48 million Threads accounts were activated in the first ~24 hours](https://www.threads.net/t/CuX691ePVBZ/). By most estimates, that’s something like *four times* the size of every combined Mastodon instance, on day one!  \n<br>\n<div style=\"text-align: center; color: #cfcfcf;\">• • •</div> \n\nWhether by design or circumstance, Threads’ much-lauded [ActivityPub](https://en.wikipedia.org/wiki/ActivityPub) integration isn’t available at launch. At present it is very much a walled-garden proudly professing its ambitions of federation.[^2] But, overnight, it has become one of the largest entities committed to using the protocol[^3], and its eventual federation will have consequences for the ActivityPub ecosystem that I don’t think are entirely clear at present. In my experience, reception to the idea on Mastodon has been mixed. Some server admins have pledged to de-federate Threads as soon as it integrates with the protocol; others (including [the admin of my server](https://omglol.news/2023/06/28/meta-the-fediverse-and-omg-lol)) have a more balanced view. There have been enough questions floating around, that Mastodon-founder / lead developer [Eugen Rochko](https://mastodon.social/@gargron) published [some notes](https://blog.joinmastodon.org/2023/07/what-to-know-about-threads/), seeking to allay fears about Meta’s ability to track Mastodon users, and push adverts to Mastodon servers etc. His conclusion is this: \n\n> We have been advocating for interoperability between platforms for years. The biggest hurdle to users switching platforms when those platforms become exploitative is the lock-in of the social graph, the fact that switching platforms means abandoning everyone you know and who knows you. The fact that large platforms are adopting ActivityPub is not only validation of the movement towards decentralized social media, but a path forward for people locked into these platforms to switch to better providers. Which in turn, puts pressure on such platforms to provide better, less exploitative services. This is a clear victory for our cause, hopefully one of many to come.\n\nWhilst there are many unknowns about how all this plays out, I think there’s a good chance that the advent of Threads will redound to the benefit of the social web writ large. Advocates of open protocols like ActivityPub should be optimistic about the arrival of a platform that is already clearly on a path to mass adoption. Whether it’s in weeks’ or months’ time, there will soon be millions more accounts available to follow, almost certainly including people whose posts you will be interested in, but whom would not otherwise have joined a compatible platform. But the best part is, you won’t need to step foot in the mall to follow them. Whatever the Threads experience ultimately becomes, thanks to ActivityPub integration, the option will exist to follow Threads accounts without having to engage with an algorithmically-generated Home feed full of brands and celebrities, without ever having to see an advert, and without giving the surveillance capitalism vampires any more of your data. \n\nPersonally, I intend to keep playing around with Threads for now. Likely as soon as it’s possible, however, I’ll switch to following Threads users via Mastodon. It will be interesting to see how easy or difficult Meta make it for Threads users to find and follow non-Threads sources publishing via ActivityPub. That barrier, whilst it’ll almost certainly be bidirectional, may well involve jumping through some cumbersome hoops not-so-subtly designed to keep people on Meta’s platform. I think I’ll be OK with that. If it leads to a kind of two-way mirror effect, where I can follow Threads users’ posts, but it’s harder for them to find mine… well, that’s arguably a win-win. \n\n[^1]:\tie. there is no option to see only posts from accounts you follow\n\n[^2]:\tIn this respect (as in others) it’s very similar to Bluesky in its current state.\n\n[^3]:\tEclipsed only by Tumblr, which reportedly has ~500 million blogs, and is also intending to adopt ActivityPub.\n",
				"date_published": "2023-07-07T14:20:34+01:00",
				"url": "https://blog.zioibi.com/2023/07/07/twoway-mirrors-at.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/07/a-few-albums.html",
				
				"content_html": "<p>A few albums added to the queue on #newmusicfriday 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A few albums added to the queue on #newmusicfriday 🎵\n\n<img src=\"https://adam.micro.blog/uploads/2023/20230707-1.png\" width=\"600\" height=\"2177\" alt=\"\">\n",
				"date_published": "2023-07-07T08:51:15+01:00",
				"url": "https://blog.zioibi.com/2023/07/07/a-few-albums.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/06/im-hearing-the.html",
				
				"content_html": "<p>I’m hearing the verb “to bagel” used more in Wimbledon commentary this year, meaning to beat an opponent in a set, without losing a game.</p>\n<p>In principle it’s quite fun, <em>but</em> it undermines my favourite — though likely apocryphal — explanation for where the term “Love” comes from in tennis: that it’s a malapropism of the French, “l’œuf”: the egg.</p>\n<p>🥯🥚🎾</p>\n",
				"content_text": "I’m hearing the verb “to bagel” used more in Wimbledon commentary this year, meaning to beat an opponent in a set, without losing a game. \n\nIn principle it’s quite fun, *but* it undermines my favourite — though likely apocryphal — explanation for where the term “Love” comes from in tennis: that it’s a malapropism of the French, “l’œuf”: the egg.\n\n🥯🥚🎾\n",
				"date_published": "2023-07-06T16:29:15+01:00",
				"url": "https://blog.zioibi.com/2023/07/06/im-hearing-the.html"
			},
			{
				"id": "http://adam.micro.blog/2023/07/05/hey-are-you.html",
				
				"content_html": "<p>Hey, are you on Splooter? Did you start a Bomblo account?<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> Social media in the era of Twitter&rsquo;s (ongoing) collapse is truly wild. Me? I have accounts all over the place: <a href=\"https://social.lol/@zioibi\">Mastodon</a> (as I&rsquo;ve mentioned before), but also Bluesky, Cohost, T2, Post&hellip; and probably more that I&rsquo;m forgetting. There&rsquo;s life out there, to varying degrees, and it&rsquo;s been fun keeping an eye on how things are evolving.</p>\n<p>I&rsquo;ll always keep my own site; it&rsquo;s too important to the way I feel about the web for me not to have a spot that&rsquo;s all my own, and subject to no on else&rsquo;s decision making. No adverts, no cookies, no analytics, and full control over everything I publish. I&rsquo;d encourage anyone who values what they&rsquo;re posting online to  think about adopting the <a href=\"https://indieweb.org/POSSE\">POSSE</a> mindset: &lsquo;Publish (on your) Own Site, Syndicate Elsewhere&rsquo;.</p>\n<p>But the social web has its place too, and right now I feel a little as though I&rsquo;m still looking for a perfect fit.</p>\n<p>• <strong>Twitter</strong> is increasingly a far-right cesspool, and its server architecture seems to be actively on fire.</p>\n<p>• My impression of <strong>Bluesky</strong> has been that it seems chock full of people trying desperately to be funny all the time, which can be exhausting.</p>\n<p>• I dig my <strong>Mastodon</strong> experience, but it’s super niche: mainly people talking about open-source projects, blogging, and the fediverse.</p>\n<p>Today, Meta launched their microblogging platform: <a href=\"https://threads.net\"><strong>Threads</strong></a>, and it feels like it has a genuine chance at mass adoption. Leveraging users' already established Instagram social graph gives it a significant jump start. It&rsquo;s super early, and the v1 released a few hours ago is missing features that may be considered basic (eg. a timeline of accounts you&rsquo;re following; a browser-based interface; hashtags; availability in the <!-- raw HTML omitted -->EU<!-- raw HTML omitted -->!), but it feels like there&rsquo;s a chance it could provide a place for people to just post about brunch again.</p>\n<p>Put another way: a lot of the family, friends, and accounts I previously followed on Twitter were <em>never</em> going to make the jump to Mastodon, but the majority of them already have Instagram accounts, which puts them a click away from Threads. I expect to see a lot of them there fairly soon. If you&rsquo;re also there, <a href=\"https://threads.net/@zioibi\">say hi</a>!</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Please note, these are not real services (yet), as far as I know.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Hey, are you on Splooter? Did you start a Bomblo account?[^1] Social media in the era of Twitter's (ongoing) collapse is truly wild. Me? I have accounts all over the place: [Mastodon](https://social.lol/@zioibi) (as I've mentioned before), but also Bluesky, Cohost, T2, Post... and probably more that I'm forgetting. There's life out there, to varying degrees, and it's been fun keeping an eye on how things are evolving. \n\nI'll always keep my own site; it's too important to the way I feel about the web for me not to have a spot that's all my own, and subject to no on else's decision making. No adverts, no cookies, no analytics, and full control over everything I publish. I'd encourage anyone who values what they're posting online to  think about adopting the [POSSE](https://indieweb.org/POSSE) mindset: 'Publish (on your) Own Site, Syndicate Elsewhere'. \n\nBut the social web has its place too, and right now I feel a little as though I'm still looking for a perfect fit. \n\n• **Twitter** is increasingly a far-right cesspool, and its server architecture seems to be actively on fire.  \n\n• My impression of **Bluesky** has been that it seems chock full of people trying desperately to be funny all the time, which can be exhausting.  \n\n• I dig my **Mastodon** experience, but it’s super niche: mainly people talking about open-source projects, blogging, and the fediverse.  \n\nToday, Meta launched their microblogging platform: [**Threads**](https://threads.net), and it feels like it has a genuine chance at mass adoption. Leveraging users' already established Instagram social graph gives it a significant jump start. It's super early, and the v1 released a few hours ago is missing features that may be considered basic (eg. a timeline of accounts you're following; a browser-based interface; hashtags; availability in the <sc>EU</sc>!), but it feels like there's a chance it could provide a place for people to just post about brunch again. \n\nPut another way: a lot of the family, friends, and accounts I previously followed on Twitter were *never* going to make the jump to Mastodon, but the majority of them already have Instagram accounts, which puts them a click away from Threads. I expect to see a lot of them there fairly soon. If you're also there, [say hi](https://threads.net/@zioibi)!\n\n[^1]: Please note, these are not real services (yet), as far as I know.\n",
				"date_published": "2023-07-06T09:29:42+01:00",
				"url": "https://blog.zioibi.com/2023/07/05/hey-are-you.html",
				"tags": ["tech"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/02/mizuyama-tells-me.html",
				
				"content_html": "<p>Newslettering godfather Craig Mod is currently running a limited time pop-up — <a href=\"https://craigmod.com/ridgeline/165/\"><!-- raw HTML omitted --><em>BASIE!BOP!JAMAICA!</em><!-- raw HTML omitted --></a> — chronicling his visits to several jazz kissa<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> in northern Japan. As with everything he publishes, the mix of detail-oriented observation, humane context, and thoughtful rumination is pitch perfect. Here&rsquo;s a clipping from the latest issue:</p>\n<blockquote>\n<p>Mizuyama tells me how he listens to records: Twenty times, he says standing in the shadows, sipping his fourth whiskey on the rocks, toking his hand-rolled cigarettes. That’s my minimum. Even if I hate the record, I listen to it twenty times. Really listen. Try to understand it. Try to understand what I don’t like about it if I don’t like it. Try to get, truly, what those musicians were saying.</p>\n<p>[…]</p>\n<p>He says, Look — <!-- raw HTML omitted -->music doesn’t change. The music on the album doesn’t change. <em>You</em> change. So if you don’t like it today, maybe you’ll like it tomorrow.<!-- raw HTML omitted --> The onus, he’s saying, is on the listener to reach across the aisle, to consider maybe <em>they</em> got it wrong, to push and pull on the scope of their taste like wet dough until you at least understand, if not love, the art.</p>\n</blockquote>\n<p>I also love Mod&rsquo;s photo of Mizuyama Kazutsugu’s kissa, <a href=\"https://goo.gl/maps/vu42DJsFF5XtvyidA\">Jazz Spot Leaf</a></p>\n<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->Photo by <!-- raw HTML omitted --><a href=\"https://craigmod.com\">Craig Mod</a><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>coffeehouses / cafés specialising in playing jazz from their large vinyl collections&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Newslettering godfather Craig Mod is currently running a limited time pop-up — [<sc>*BASIE!BOP!JAMAICA!*</sc>](https://craigmod.com/ridgeline/165/) — chronicling his visits to several jazz kissa[^1] in northern Japan. As with everything he publishes, the mix of detail-oriented observation, humane context, and thoughtful rumination is pitch perfect. Here's a clipping from the latest issue: \n\n> Mizuyama tells me how he listens to records: Twenty times, he says standing in the shadows, sipping his fourth whiskey on the rocks, toking his hand-rolled cigarettes. That’s my minimum. Even if I hate the record, I listen to it twenty times. Really listen. Try to understand it. Try to understand what I don’t like about it if I don’t like it. Try to get, truly, what those musicians were saying.\n> \n> […]\n> \n> He says, Look — <mark>music doesn’t change. The music on the album doesn’t change. *You* change. So if you don’t like it today, maybe you’ll like it tomorrow.</mark> The onus, he’s saying, is on the listener to reach across the aisle, to consider maybe *they* got it wrong, to push and pull on the scope of their taste like wet dough until you at least understand, if not love, the art.  \n\nI also love Mod's photo of Mizuyama Kazutsugu’s kissa, [Jazz Spot Leaf](https://goo.gl/maps/vu42DJsFF5XtvyidA)\n\n<img src=\"https://adam.micro.blog/uploads/2023/jazzspotleaf.png\" width=\"600\" height=\"903\" alt=\"A warmly lit window on an empty street, below a bright white, lit-up sign that reads simply: JAZZ.\">\n\n<span style=\"font-size: 12px; color: #cfcfcf;\">Photo by <greya>[Craig Mod](https://craigmod.com)</greya></span>\n\n[^1]: coffeehouses / cafés specialising in playing jazz from their large vinyl collections\n",
				"date_published": "2023-07-02T17:01:02+01:00",
				"url": "https://blog.zioibi.com/2023/07/02/mizuyama-tells-me.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/02/were-now-half.html",
				
				"content_html": "<p>We’re now half way through the year, and it’s tempting to pull together a list of my favourite 2023 records to date&hellip; but I think I’ll save that until the <a href=\"/thelists\">end of year list</a>. Instead, here are my favourite ten album covers from the first six months of the year.<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup></p>\n<h3 id=\"10-superviolet-infinite-spring\">10. Superviolet — <em>Infinite Spring</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/superviolet.png\" alt=\"\"></p>\n<p>I’m not 100% sure about the typeface here, though it’s not distracting. I just love the skyscape — which reminds me of <a href=\"https://adam.micro.blog/2018/06/21/010000.html\">long Icelandic summer sunsets</a> — and the use of the moon as a kind of punctuation mark.</p>\n<h3 id=\"9-mandy-indiana-ive-seen-a-way\">9. Mandy, Indiana — <em>I’ve Seen a Way</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/mandy-indiana.png\" alt=\"\"></p>\n<p>At once busy and static — I like the ways in which the sunlight, and the water, bring life to the squared off forms of the walls.</p>\n<h3 id=\"8-nappy-nina-mourning-due\">8. Nappy Nina — <em>Mourning Due</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/nappy-nina.png\" alt=\"\"></p>\n<p>A little on the nose perhaps, given the artist’s name, but this makes me smile every time I see it. I appreciate the effort put into the elegant execution of a simple visual joke.</p>\n<h3 id=\"7-albert-hammond-jr-melodies-on-hiatus\">7. Albert Hammond Jr. — <em>Melodies on Hiatus</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/albert.png\" alt=\"\"></p>\n<p>I’ve been a sucker for Helvetica for a long, long time, and it hasn&rsquo;t stopped working for me yet. I like the balance of bold feature typeface and an abstract background.</p>\n<h3 id=\"6-militarie-gun-life-under-the-gun\">6. Militarie Gun — <em>Life Under the Gun</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/militarie-gun.png\" alt=\"\"></p>\n<p>I like the painterly qualities of this, and the choice to make it a direct overhead vantage. With the human figures’ shadows, it has something of <a href=\"https://adam.micro.blog/uploads/2023/muse.png\">Muse’s <em>Absolution</em></a> (2003) about it.<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup></p>\n<h3 id=\"5-unknown-mortal-orchestra-v\">5. Unknown Mortal Orchestra — <em>V</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/umo.png\" alt=\"\"></p>\n<p>I have no idea of the story behind this photo, but the combination of an active, arresting image with the simple rendering of the album’s title works superbly.</p>\n<h3 id=\"4-kelela-raven\">4. Kelela — <em>Raven</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/kelela.png\" alt=\"\"></p>\n<p>Kelela has a history of strikingly posed record covers, but I think this simple black &amp; white composition is perhaps the best yet. You can almost feel the subtle, living motion in it.</p>\n<h3 id=\"3-lia-kohl-the-ceiling-reposes\">3. Lia Kohl — <em>The Ceiling Reposes</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/lia-kohl.png\" alt=\"\"></p>\n<p>I love the dark blue on grey, the repeated circular form, the choice to obscure part of the photographed image, and the textured grain effect. The thin, cleaner border really makes it.</p>\n<h3 id=\"2-the-japanese-house-in-the-end-it-always-does\">2. The Japanese House — <em>In The End it Always Does</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/the-japanese-house.png\" alt=\"\"></p>\n<p>A similar colour palette to the Lia Kohl (above), and a similar use of subtle whitespace. The imperfection and texture of the hand-drawn arrow has a wonderful <a href=\"https://en.wikipedia.org/wiki/Wabi-sabi\">wabi-sabi</a> character, and I love everything about the simple type treatment, aligned at the right margin.</p>\n<h3 id=\"1-boygenius-the-record\">1. Boygenius — <em>The Record</em></h3>\n<p><img src=\"https://adam.micro.blog/uploads/2023/boygenius.png\" alt=\"\"></p>\n<p>I’m tipping my cards a little here, but this is one of those album covers that has the magical property of <em>feeling</em> like the record <em>sounds</em>. In a beautifully simple image, it evokes warmth and friendship, whilst manifesting the music’s sense of reaching for something.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Ranked here purely on consideration of the artwork, though a few of these are records I’ve very much enjoyed.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>Another album cover I really like.&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "We’re now half way through the year, and it’s tempting to pull together a list of my favourite 2023 records to date... but I think I’ll save that until the [end of year list](/thelists). Instead, here are my favourite ten album covers from the first six months of the year.[^1] \n\n### 10. Superviolet — *Infinite Spring*\n![](https://adam.micro.blog/uploads/2023/superviolet.png)\n\nI’m not 100% sure about the typeface here, though it’s not distracting. I just love the skyscape — which reminds me of [long Icelandic summer sunsets](https://adam.micro.blog/2018/06/21/010000.html) — and the use of the moon as a kind of punctuation mark.\n\n### 9. Mandy, Indiana — *I’ve Seen a Way*\n![](https://adam.micro.blog/uploads/2023/mandy-indiana.png)\n\nAt once busy and static — I like the ways in which the sunlight, and the water, bring life to the squared off forms of the walls. \n\n### 8. Nappy Nina — *Mourning Due*\n![](https://adam.micro.blog/uploads/2023/nappy-nina.png)\n\nA little on the nose perhaps, given the artist’s name, but this makes me smile every time I see it. I appreciate the effort put into the elegant execution of a simple visual joke.\n\n### 7. Albert Hammond Jr. — *Melodies on Hiatus*\n![](https://adam.micro.blog/uploads/2023/albert.png)\n\nI’ve been a sucker for Helvetica for a long, long time, and it hasn't stopped working for me yet. I like the balance of bold feature typeface and an abstract background. \n\n### 6. Militarie Gun — *Life Under the Gun*\n![](https://adam.micro.blog/uploads/2023/militarie-gun.png)\n\nI like the painterly qualities of this, and the choice to make it a direct overhead vantage. With the human figures’ shadows, it has something of [Muse’s *Absolution*](https://adam.micro.blog/uploads/2023/muse.png) (2003) about it.[^2] \n\n### 5. Unknown Mortal Orchestra — *V*\n![](https://adam.micro.blog/uploads/2023/umo.png)\n\nI have no idea of the story behind this photo, but the combination of an active, arresting image with the simple rendering of the album’s title works superbly.\n\n### 4. Kelela — *Raven*\n![](https://adam.micro.blog/uploads/2023/kelela.png)\n\nKelela has a history of strikingly posed record covers, but I think this simple black & white composition is perhaps the best yet. You can almost feel the subtle, living motion in it. \n\n### 3. Lia Kohl — *The Ceiling Reposes*\n![](https://adam.micro.blog/uploads/2023/lia-kohl.png)\n\nI love the dark blue on grey, the repeated circular form, the choice to obscure part of the photographed image, and the textured grain effect. The thin, cleaner border really makes it. \n\n### 2. The Japanese House — *In The End it Always Does*\n![](https://adam.micro.blog/uploads/2023/the-japanese-house.png)\n\nA similar colour palette to the Lia Kohl (above), and a similar use of subtle whitespace. The imperfection and texture of the hand-drawn arrow has a wonderful [wabi-sabi](https://en.wikipedia.org/wiki/Wabi-sabi) character, and I love everything about the simple type treatment, aligned at the right margin. \n\n### 1. Boygenius — *The Record*\n![](https://adam.micro.blog/uploads/2023/boygenius.png)\n\nI’m tipping my cards a little here, but this is one of those album covers that has the magical property of *feeling* like the record *sounds*. In a beautifully simple image, it evokes warmth and friendship, whilst manifesting the music’s sense of reaching for something. \n\n[^1]:\tRanked here purely on consideration of the artwork, though a few of these are records I’ve very much enjoyed.\n\n[^2]: Another album cover I really like.\n",
				"date_published": "2023-07-02T15:47:55+01:00",
				"url": "https://blog.zioibi.com/2023/07/02/were-now-half.html",
				"tags": ["art","music"]
			},
			{
				"id": "http://adam.micro.blog/2023/07/02/first-outing-with.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>First outing with my new two-wheeled friend was a ride along the Thames, out to <a href=\"https://www.proofbakehouse.com/\">Proof</a> this morning.</p>\n",
				"content_text": "<img src=\"https://adam.micro.blog/uploads/2023/20230702-1.png\" width=\"600\" height=\"449\" alt=\"Customers queueing at a white tiled counter, above which a sign reads Proof Social Bakehouse.\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/20230702-2.png\" width=\"600\" height=\"450\" alt=\"Shelves full of tasty-looking baked goods.\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/20230702-3.png\" width=\"600\" height=\"450\" alt=\"Industrial sized baking ovens and metal counter tops.\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/20230702-4.png\" width=\"600\" height=\"450\" alt=\"A blue bicycle leaning against a wooden bridge.\">\r\n\r\nFirst outing with my new two-wheeled friend was a ride along the Thames, out to [Proof](https://www.proofbakehouse.com/) this morning. \n",
				"date_published": "2023-07-02T12:38:40+01:00",
				"url": "https://blog.zioibi.com/2023/07/02/first-outing-with.html",
				"tags": ["coffee","oxford"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/30/a-moment-of.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>A moment of silence please, for Chris Nolan, who is getting completely destroyed in every one of these match-ups at my local Picturehouse. 🍿</p>\n",
				"content_text": "<img src=\"https://adam.micro.blog/uploads/2023/gerwignolan.png\" width=\"600\" height=\"864\" alt=\"A blackboard advertising films in a Gerwig vs Nolan season: Frances Ha vs Inception; Lady Bird vs Interstellar; Little Women vs Dunkirk.\">\r\n\r\nA moment of silence please, for Chris Nolan, who is getting completely destroyed in every one of these match-ups at my local Picturehouse. 🍿\n",
				"date_published": "2023-06-30T17:28:54+01:00",
				"url": "https://blog.zioibi.com/2023/06/30/a-moment-of.html",
				"tags": ["movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/30/here-are-all.html",
				
				"content_html": "<p>Here are all of the newly-released albums that I&rsquo;m adding to my queue on #newmusicfriday \n(I&rsquo;m also excited to check out the new Olivia Rodrigo single: &lsquo;Vampire&rsquo;)</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Here are all of the newly-released albums that I'm adding to my queue on #newmusicfriday \r\n(I'm also excited to check out the new Olivia Rodrigo single: 'Vampire')\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/20230630.png\" width=\"600\" height=\"3286\" alt=\"\">\n",
				"date_published": "2023-06-30T10:03:54+01:00",
				"url": "https://blog.zioibi.com/2023/06/30/here-are-all.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/28/new-member-of.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>New member of the family.</p>\n",
				"content_text": "<img src=\"https://adam.micro.blog/uploads/2023/4631298c-f13a-4b89-bc37-8d7b6ef91f1e.jpg\" width=\"600\" height=\"800\" alt=\"A dark blue bicycle, hanging on a silver metal stand, which is leaning against a white wall.\">\n\nNew member of the family.\n",
				"date_published": "2023-06-28T20:23:00+01:00",
				"url": "https://blog.zioibi.com/2023/06/28/new-member-of.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/27/last-night-i.html",
				
				"content_html": "<p>Last night I rewatched David O Russell’s <em>Amsterdam</em> (2022). It’s the director’s loosest-feeling movie since 2004’s <em>I Heart Huckabees</em>, and I really enjoy the pace at which it moves. There is a gentle, consistent ease with which it trips the traps of its plot, and ushers in one guest star after another. Unlike some mystery movies, which feel as though they’re going out of their way to prove the cleverness of their plot, <em>Amsterdam</em> is content simply to let its central knot unwind at a slow, gentle pull. Instead the focus is on the relationships between the central trio: a little cluster of characters imbued — by Bale, Robbie, &amp; Washington — with just the right level of quirk as to remain endearing throughout the 134 minute run time.</p>\n<p>Special mention should be made of Emmanuel Lubezki’s cinematography. His work has dazzled me in the past: the gritty urgency of Alfonso Cuarón’s <em>Children of Men</em> (2006), and the captivating ballet of the same director’s <em>Gravity</em> (2013); the breadth of <em>The Revenant</em> (2015), and the bravura “single-take” work on <em>Birdman</em> (2014) both with Alejandro G. Iñárritu. Here, in <em>Amsterdam</em>, he employs a palette of greens, browns, and oranges that give the whole film a lush richness. In the few scenes in which they are missing, their omission is as shocking as any plot twist. 🍿</p>\n",
				"content_text": "Last night I rewatched David O Russell’s *Amsterdam* (2022). It’s the director’s loosest-feeling movie since 2004’s *I Heart Huckabees*, and I really enjoy the pace at which it moves. There is a gentle, consistent ease with which it trips the traps of its plot, and ushers in one guest star after another. Unlike some mystery movies, which feel as though they’re going out of their way to prove the cleverness of their plot, *Amsterdam* is content simply to let its central knot unwind at a slow, gentle pull. Instead the focus is on the relationships between the central trio: a little cluster of characters imbued — by Bale, Robbie, & Washington — with just the right level of quirk as to remain endearing throughout the 134 minute run time. \r\n\r\nSpecial mention should be made of Emmanuel Lubezki’s cinematography. His work has dazzled me in the past: the gritty urgency of Alfonso Cuarón’s *Children of Men* (2006), and the captivating ballet of the same director’s *Gravity* (2013); the breadth of *The Revenant* (2015), and the bravura “single-take” work on *Birdman* (2014) both with Alejandro G. Iñárritu. Here, in *Amsterdam*, he employs a palette of greens, browns, and oranges that give the whole film a lush richness. In the few scenes in which they are missing, their omission is as shocking as any plot twist. 🍿\n",
				"date_published": "2023-06-27T10:39:47+01:00",
				"url": "https://blog.zioibi.com/2023/06/27/last-night-i.html",
				"tags": ["movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/26/today-we-ventured.html",
				
				"content_html": "<p>Today we ventured out to Whitstable and Herne Bay, to breathe sea air, and walk the coast a little<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. We had coffee in <a href=\"https://www.instagram.com/coffeeblueprint/\">Blueprint</a>; walked the cute little back streets; a darting sparrow flew between my legs; we ate fish &amp; chips at a place on the seafront.</p>\n<!-- raw HTML omitted -->\n<p>I enjoy the difference between the two towns. Whitstable is very much a place where Blueprint — a small batch roastery that is also a tiny bookshop, and stocks a curated collection of Japanese stationery and Blackwing pencils — feels correctly situated. It’s a place of indie bookshops, cute little florists, and artisanal cheesemongers. Herne Bay (only 9km up the road) feels far closer to a traditional English seaside town: greasy spoon cafes, a pier, seagulls making a play for your ice cream cone.</p>\n<!-- raw HTML omitted -->\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>One of the only significant marks against Oxford as a place to live is that it’s 90km from the ocean, as the crow flies.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Today we ventured out to Whitstable and Herne Bay, to breathe sea air, and walk the coast a little[^1]. We had coffee in [Blueprint](https://www.instagram.com/coffeeblueprint/); walked the cute little back streets; a darting sparrow flew between my legs; we ate fish & chips at a place on the seafront.\n\n<img src=\"https://adam.micro.blog/uploads/2023/whitstablez.png\" width=\"600\" height=\"449\" alt=\"The pebble shore of Whitstable, looking out onto the ocean.\">\n\nI enjoy the difference between the two towns. Whitstable is very much a place where Blueprint — a small batch roastery that is also a tiny bookshop, and stocks a curated collection of Japanese stationery and Blackwing pencils — feels correctly situated. It’s a place of indie bookshops, cute little florists, and artisanal cheesemongers. Herne Bay (only 9km up the road) feels far closer to a traditional English seaside town: greasy spoon cafes, a pier, seagulls making a play for your ice cream cone. \n\n<img src=\"https://adam.micro.blog/uploads/2023/hernez.jpeg\" width=\"600\" height=\"450\" alt=\"A walkway down towards the Herne Bay seafront, with blue sky above the ocean.\">\n\n\n[^1]:\tOne of the only significant marks against Oxford as a place to live is that it’s 90km from the ocean, as the crow flies.\n",
				"date_published": "2023-06-26T16:33:00+01:00",
				"url": "https://blog.zioibi.com/2023/06/26/today-we-ventured.html"
			},
			{
				"id": "http://adam.micro.blog/2023/06/23/a-dozen-albums.html",
				
				"content_html": "<p>A dozen albums added to the queue on #newmusicfriday (which I&rsquo;m ambivalent about, because I’ve fallen way behind!) 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A dozen albums added to the queue on #newmusicfriday (which I'm ambivalent about, because I’ve fallen way behind!) 🎵\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/20230623.png\" width=\"600\" height=\"2192\" alt=\"\">\n",
				"date_published": "2023-06-23T10:15:39+01:00",
				"url": "https://blog.zioibi.com/2023/06/23/a-dozen-albums.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/21/just-finding-a.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p>Just finding a spot to record this. It&rsquo;s always alarming to see data of this kind, which makes the case for catastrophic global warming so clearly. <!-- raw HTML omitted -->Part of the <!-- raw HTML omitted --><a href=\"https://showyourstripes.info/c/europe/unitedkingdom/oxford/\">#showyourstripes</a><!-- raw HTML omitted --> initiative from my alma mater.<!-- raw HTML omitted --></p>\n",
				"content_text": "<img src=\"uploads/2023/tempgraph.png\" width=\"600\" height=\"337\" alt=\"Graph showing the alarming rise in average temperatures over the last 40 years.\">\n\n\nJust finding a spot to record this. It's always alarming to see data of this kind, which makes the case for catastrophic global warming so clearly. <font color=\"#cfcfcf\">Part of the <greya>[#showyourstripes](https://showyourstripes.info/c/europe/unitedkingdom/oxford/)</greya> initiative from my alma mater.</font>\n",
				"date_published": "2023-06-21T11:17:38+01:00",
				"url": "https://blog.zioibi.com/2023/06/21/just-finding-a.html",
				"tags": ["oxford"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/20/back-in-january.html",
				
				"content_html": "<p>Back in January, <a href=\"https://adam.micro.blog/2023/01/05/one-of-the.html\">I posted about</a> how I like to pick up a <a href=\"https://www.wallpaper.com/\"><em>Wallpaper</em><!-- raw HTML omitted -->*<!-- raw HTML omitted --></a> guide when we&rsquo;re planning a trip.</p>\n<!-- raw HTML omitted -->\n<p>Since then, we&rsquo;ve also bought this fun book from <a href=\"https://en.lusterpublishing.com/\">Luster</a>: <em>The 500 Hidden Secrets of Tokyo</em>.</p>\n<!-- raw HTML omitted -->\n<p>And, this week, a book I&rsquo;ve been waiting on was finally republished by <a href=\"https://oroeditions.com/\">ORO Editions</a>: <em>Emergent Tokyo: Designing the Spontaneous City</em>.</p>\n<!-- raw HTML omitted -->\n<p>This one, by architect <a href=\"https://www.jorgealmazan.net/\">Jorge Almazán</a>, is less a travel guide and more a deep explanation of how modern Tokyo came to be: its design, infrastructure etc.</p>\n",
				"content_text": "Back in January, [I posted about](https://adam.micro.blog/2023/01/05/one-of-the.html) how I like to pick up a [*Wallpaper*<sup>*</sup>](https://www.wallpaper.com/) guide when we're planning a trip. \n\n<img src=\"https://adam.micro.blog/uploads/2023/wallpaper.png\" width=\"600\" height=\"600\" alt=\"\">\n\nSince then, we've also bought this fun book from [Luster](https://en.lusterpublishing.com/): *The 500 Hidden Secrets of Tokyo*.\n\n<img src=\"https://adam.micro.blog/uploads/2023/secret.png\" width=\"600\" height=\"600\" alt=\"\">\n\n And, this week, a book I've been waiting on was finally republished by [ORO Editions](https://oroeditions.com/): *Emergent Tokyo: Designing the Spontaneous City*. \n\n<img src=\"https://adam.micro.blog/uploads/2023/emergent.png\" width=\"600\" height=\"600\" alt=\"\">\n\nThis one, by architect [Jorge Almazán](https://www.jorgealmazan.net/), is less a travel guide and more a deep explanation of how modern Tokyo came to be: its design, infrastructure etc. \n",
				"date_published": "2023-06-20T11:38:00+01:00",
				"url": "https://blog.zioibi.com/2023/06/20/back-in-january.html",
				"tags": ["books","travel"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/19/im-a-slow.html",
				"title": "Speed Reading Isn't Reading",
				"content_html": "<p>I&rsquo;m a slow reader; always have been. And as someone who <em>loves</em> to read, and who chose to pursue <a href=\"/essays\">degrees in literature</a>, I&rsquo;ve long had mixed feelings about the deliberateness with which I&rsquo;ve found that I need to approach texts<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. I reflected on this again recently, as I read a <a href=\"https://www.newyorker.com/magazine/2023/06/26/remembering-robert-gottlieb-editor-extraordinaire\">profile of the late Robert Gottlieb</a>:</p>\n<blockquote>\n<p>Gottlieb was a showoff, but not of the athletic sort. When he was in high school, he read “War and Peace” in “a single marathon fourteen-hour session.” As an undergraduate, at Columbia, he read Proust: “seven volumes, seven days.”</p>\n</blockquote>\n<p>Taking the latter of those first, the task of making one&rsquo;s way through <em>In Search of Lost Time</em> in a week, means reading about 181,000 words per day, for seven days straight. That pace is <em>way</em> beyond my reach, even for a single day! I once read <em>The Catcher in the Rye</em> in one day: it&rsquo;s 73,404 words, and left little time for anything else.</p>\n<p>But it&rsquo;s turning to the <em>War and Peace</em> claim that really makes me question whether this story about Gottlieb is apocryphal. Tolstoy&rsquo;s opus is 587,287 words. To read it in a 14 hour sitting as claimed, you&rsquo;d have to go at a little under 42,000 words per hour, or 700 words per minute, non-stop, for 840 minutes.</p>\n<p>It brought to mind that quote, <a href=\"https://quoteinvestigator.com/2015/12/08/speed-reading/\">usually attributed to Woody Allen</a>:</p>\n<blockquote>\n<p>I took a speed-reading course and read <em>War and Peace</em> in twenty minutes. It involves Russia.</p>\n</blockquote>\n<p>Whilst searching for that, I found a <a href=\"https://www.nytimes.com/1995/09/03/opinion/l-war-and-peace-in-20-minutes-if-you-care-what-it-says-read-449395.html\">1995 letter to the Editor of the NY Times</a>, from communications consultant Dr Phyllis Mindell, in which she decries the practice of &lsquo;speed reading&rsquo;. Here are a couple of sections that chimed for me:</p>\n<blockquote>\n<p>Study after study demonstrates that although people can skim at extremely high rates (as much as 100,000 words a minute), <!-- raw HTML omitted -->they gain substantially no comprehension<!-- raw HTML omitted --> in the process.</p>\n</blockquote>\n<p>This is exactly my experience: fly through the text and I end up with no significant understanding of it. Perhaps because:</p>\n<blockquote>\n<p><!-- raw HTML omitted -->[F]ailure must result from any method that assumes that reading is primarily a visual task<!-- raw HTML omitted -->, that one can &ldquo;take in whole pages at a single glance,&rdquo; [&hellip;] or that the approach to reading remains independent of the content of the material to be read or the purposes of reading</p>\n</blockquote>\n<p>Reading is a practice of comprehension, conducted only at first with the eyes, and then primarily with that miraculous organ directly behind them. The letter quotes a wonderful phrasing of this task, by Stanley Elkin:</p>\n<blockquote>\n<p>The most trenchant critiques of &ldquo;speed reading&rdquo; emerge, directly or indirectly, from the strongest readers. The writer Stanley Elkin, for example, called reading <!-- raw HTML omitted -->&ldquo;fine, precise, detailed work, the infinitely small motor managements of diamond cutters and safecrackers that we do in our heads.&quot;<!-- raw HTML omitted --></p>\n</blockquote>\n<p>Just as people who think they&rsquo;re multi-tasking are more likely doing several things poorly, I remain convinced that &lsquo;speed readers&rsquo; are actually just looking at patterns, and not engaged in the act of comprehension that I understand reading to be. 📚<br>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->PS<!-- raw HTML omitted --> It is certainly not my intention here to besmirch the good name of the late Robert Gottlieb, may he rest in peace.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Some things certainly would have been easier if I could have made my way through long novels on syllabi in hours instead of days.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "I'm a slow reader; always have been. And as someone who *loves* to read, and who chose to pursue [degrees in literature](/essays), I've long had mixed feelings about the deliberateness with which I've found that I need to approach texts[^1]. I reflected on this again recently, as I read a [profile of the late Robert Gottlieb](https://www.newyorker.com/magazine/2023/06/26/remembering-robert-gottlieb-editor-extraordinaire): \n\n> Gottlieb was a showoff, but not of the athletic sort. When he was in high school, he read “War and Peace” in “a single marathon fourteen-hour session.” As an undergraduate, at Columbia, he read Proust: “seven volumes, seven days.”\n\nTaking the latter of those first, the task of making one's way through *In Search of Lost Time* in a week, means reading about 181,000 words per day, for seven days straight. That pace is *way* beyond my reach, even for a single day! I once read *The Catcher in the Rye* in one day: it's 73,404 words, and left little time for anything else. \n\nBut it's turning to the *War and Peace* claim that really makes me question whether this story about Gottlieb is apocryphal. Tolstoy's opus is 587,287 words. To read it in a 14 hour sitting as claimed, you'd have to go at a little under 42,000 words per hour, or 700 words per minute, non-stop, for 840 minutes.\n\nIt brought to mind that quote, [usually attributed to Woody Allen](https://quoteinvestigator.com/2015/12/08/speed-reading/):\n\n> I took a speed-reading course and read *War and Peace* in twenty minutes. It involves Russia.\n\nWhilst searching for that, I found a [1995 letter to the Editor of the NY Times](https://www.nytimes.com/1995/09/03/opinion/l-war-and-peace-in-20-minutes-if-you-care-what-it-says-read-449395.html), from communications consultant Dr Phyllis Mindell, in which she decries the practice of 'speed reading'. Here are a couple of sections that chimed for me:\n\n> Study after study demonstrates that although people can skim at extremely high rates (as much as 100,000 words a minute), <mark>they gain substantially no comprehension</mark> in the process.\n\nThis is exactly my experience: fly through the text and I end up with no significant understanding of it. Perhaps because:\n\n> <mark>[F]ailure must result from any method that assumes that reading is primarily a visual task</mark>, that one can \"take in whole pages at a single glance,\" [...] or that the approach to reading remains independent of the content of the material to be read or the purposes of reading\n\nReading is a practice of comprehension, conducted only at first with the eyes, and then primarily with that miraculous organ directly behind them. The letter quotes a wonderful phrasing of this task, by Stanley Elkin:\n\n> The most trenchant critiques of \"speed reading\" emerge, directly or indirectly, from the strongest readers. The writer Stanley Elkin, for example, called reading <mark>\"fine, precise, detailed work, the infinitely small motor managements of diamond cutters and safecrackers that we do in our heads.\"</mark>\n\nJust as people who think they're multi-tasking are more likely doing several things poorly, I remain convinced that 'speed readers' are actually just looking at patterns, and not engaged in the act of comprehension that I understand reading to be. 📚  \n<br>\n<div style=\"text-align: center; color: #cfcfcf;\">• • •</div>\n\n<sc>PS</sc> It is certainly not my intention here to besmirch the good name of the late Robert Gottlieb, may he rest in peace.\n\n[^1]: Some things certainly would have been easier if I could have made my way through long novels on syllabi in hours instead of days. \n",
				"date_published": "2023-06-20T09:26:20+01:00",
				"url": "https://blog.zioibi.com/2023/06/19/im-a-slow.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/17/i-took-a.html",
				
				"content_html": "<p>I took a 15km round trip walk, in the middle of which I sat in the University Parks for a while and read some Dickens. It made for a pleasant Saturday afternoon.</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "I took a 15km round trip walk, in the middle of which I sat in the University Parks for a while and read some Dickens. It made for a pleasant Saturday afternoon.\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/three.png\" width=\"600\" height=\"800\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/ddd.png\" width=\"600\" height=\"450\" alt=\"\">\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/two.png\" width=\"600\" height=\"800\" alt=\"\">\n",
				"date_published": "2023-06-17T21:32:17+01:00",
				"url": "https://blog.zioibi.com/2023/06/17/i-took-a.html",
				"tags": ["oxford"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/16/three-straight-comeback.html",
				
				"content_html": "<p>Three straight comeback wins for a sweep over the (division leading) Pirates has me feeling even more excited about seeing the Cubs in London next weekend, against the (last in the division) Cardinals. ⚾️</p>\n",
				"content_text": "Three straight comeback wins for a sweep over the (division leading) Pirates has me feeling even more excited about seeing the Cubs in London next weekend, against the (last in the division) Cardinals. ⚾️\n",
				"date_published": "2023-06-16T11:23:35+01:00",
				"url": "https://blog.zioibi.com/2023/06/16/three-straight-comeback.html",
				"tags": ["baseball"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/16/new-albums-added.html",
				
				"content_html": "<p>New albums added to the queue on #newmusicfriday 🎵</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "New albums added to the queue on #newmusicfriday 🎵\r\n\r\n<img src=\"https://adam.micro.blog/uploads/2023/bc8f936af5.png\" width=\"600\" height=\"2912\" alt=\"\" />\n",
				"date_published": "2023-06-16T09:03:34+01:00",
				"url": "https://blog.zioibi.com/2023/06/16/new-albums-added.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/15/last-night-the.html",
				
				"content_html": "<p>Last night, the book I&rsquo;ve selected for this year&rsquo;s summer read-along — Barbara Kingsolver&rsquo;s <em>Demon Copperhead</em> — was awarded the <a href=\"https://womensprizeforfiction.co.uk/features/features/news/announcing-the-2023-winner-of-the-womens-prize\">2023 Women&rsquo;s Prize for Fiction</a>. If you&rsquo;d like to join a group of likeminded folks to read the novel <strong>2 Jul – 13 Aug</strong>, you can learn more and sign-up for free <a href=\"https://adam.micro.blog/2023/06/11/sipped-ink-vol.html\">here</a> 📚</p>\n",
				"content_text": "Last night, the book I've selected for this year's summer read-along — Barbara Kingsolver's *Demon Copperhead* — was awarded the [2023 Women's Prize for Fiction](https://womensprizeforfiction.co.uk/features/features/news/announcing-the-2023-winner-of-the-womens-prize). If you'd like to join a group of likeminded folks to read the novel **2 Jul – 13 Aug**, you can learn more and sign-up for free [here](https://adam.micro.blog/2023/06/11/sipped-ink-vol.html) 📚\n",
				"date_published": "2023-06-15T13:23:36+01:00",
				"url": "https://blog.zioibi.com/2023/06/15/last-night-the.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/14/iced-latte-newground.html",
				
				"content_html": "<p>Iced latte @ <a href=\"https://www.newgroundcoffee.com/\">Newground</a> ☕️🧊</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Iced latte @ [Newground](https://www.newgroundcoffee.com/) ☕️🧊\n\n<img src=\"https://adam.micro.blog/uploads/2023/c200526f2c.png\" width=\"600\" height=\"800\" alt=\"\" />\n",
				"date_published": "2023-06-14T09:15:00+01:00",
				"url": "https://blog.zioibi.com/2023/06/14/iced-latte-newground.html",
				"tags": ["coffee"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/13/im-currently-making.html",
				
				"content_html": "<p>I&rsquo;m really enjoying the first season of <a href=\"https://www.netflix.com/browse?jbv=81447461\"><em>Beef</em></a> on Netflix, and I <strong>love</strong> the art used for each episode&rsquo;s title card:</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "I'm really enjoying the first season of [*Beef*](https://www.netflix.com/browse?jbv=81447461) on Netflix, and I **love** the art used for each episode's title card:\n\n<img src=\"https://adam.micro.blog/uploads/2023/afdff69288.png\" width=\"600\" height=\"297\" alt=\"\" />\n\n<img src=\"https://adam.micro.blog/uploads/2023/3a03ef4185.png\" width=\"600\" height=\"295\" alt=\"\" />\n\n<img src=\"https://adam.micro.blog/uploads/2023/1a9254a146.png\" width=\"600\" height=\"297\" alt=\"\" />\n",
				"date_published": "2023-06-13T16:33:25+01:00",
				"url": "https://blog.zioibi.com/2023/06/13/im-currently-making.html",
				"tags": ["art","tv"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/11/sipped-ink-vol.html",
				"title": "Sipped Ink vol. 9",
				"content_html": "<p>In 2014, I started a summer read-along project as a way to (essentially) peer pressure myself into finally completing David Foster Wallace’s giant-sized novel <em>Infinite Jest</em> (1996). I assembled a small group of like-minded readers, and we had a good time reading the book together and sharing our thoughts. Each weekend I sent out an email newsletter, with notes on the week’s reading.</p>\n<p>The read-along has now become an annual summer tradition: a growing group of readers take on a lengthy novel together, and I send out a newsletter each Sunday discussing our progress. So far we’ve read eight novels together, and you can browse the <a href=\"https://zioibi.com/si\">archive of those newsletters right here</a>.</p>\n<p>The time has now come to start the ball rolling on this summer’s read-along, which I’ll be running between <strong>2 Jul – 13 Aug 2023</strong>. When it came to choosing a novel this year, I did a lot of digging around the dark corners of back alley bookshops, browsing the fat, dusty spines of long-forgotten esoteric tomes… and then I chose the novel that won <a href=\"https://www.pulitzer.org/winners/barbara-kingsolver\">the 2023 Pulitzer Prize for Fiction</a>: Barbara Kingsolver’s <em>Demon Copperhead</em> (2022).</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/4df69f5bca.png\" alt=\"A banner announcing that volume nine of the Sipped Ink read-along will begin on 2 July 2023, and cover Barbara Kingsolver’s novel Demon Copperhead.\"></p>\n<p>This transplanting of Dickens’ <em>David Copperfield</em> (1850) to modern-day Virginia has been called ‘a masterpiece in storytelling’ and ‘a once-in-a-generation novel that breaks and mends your heart in the way only the best fiction can’. Sounds pretty good, right?</p>\n<p>If you’d like to learn more about the novel, you could take a look at <a href=\"https://www.faber.co.uk/product/9780571376483-demon-copperhead/\">the publisher’s website</a>. As-and-when you’re excited to sign up for this summer’s read-along, <a href=\"mailto:readalong@zioibi.com?subject=Sign%20me%20up%20for%20Sipped%20Ink%20vol%209&amp;body=Adam%2C%20count%20me%20in%20for%20reading%20Demon%20Copperhead.%20\">click right here</a> and send the resulting email.</p>\n<p>As always, the read-along itself is completely free; the only thing you’ll need is a copy of the book. If you would like to order the paperback, one great option is Bookshop.org — and if you use <a href=\"https://uk.bookshop.org/a/7952/9780571376483\">this link right here</a> I’ll get a little commission, at no extra cost to you!</p>\n<p>At 546 pages, it’s the lowest page count for a read-along novel yet, <em>but</em> the good folks at Faber have chosen a font size for the paperback that’s a little on the small side, so I think — in terms of word count — it’s probably similar to <em>Great Circle</em>, or even Murakami’s <em>The Wind-up Bird Chronicle</em>, which we read together in 2015.</p>\n<p>I&rsquo;ll send out an introductory email to subscribers on <strong>Sun 2 Jul</strong>, and the following weekend an email will arrive on <strong>Sun 9 Jul</strong>, discussing the first 91 pages of the novel. We’ll be reading at about that pace for six weeks, wrapping up on <strong>Sun 13 Aug</strong>.</p>\n<p>If you have any comments or questions about any of this, just <a href=\"mailto:readalong@zioibi.com\">drop me a line</a>. 📚</p>\n",
				"content_text": "In 2014, I started a summer read-along project as a way to (essentially) peer pressure myself into finally completing David Foster Wallace’s giant-sized novel *Infinite Jest* (1996). I assembled a small group of like-minded readers, and we had a good time reading the book together and sharing our thoughts. Each weekend I sent out an email newsletter, with notes on the week’s reading.\n\nThe read-along has now become an annual summer tradition: a growing group of readers take on a lengthy novel together, and I send out a newsletter each Sunday discussing our progress. So far we’ve read eight novels together, and you can browse the [archive of those newsletters right here](https://zioibi.com/si).\n\nThe time has now come to start the ball rolling on this summer’s read-along, which I’ll be running between **2 Jul – 13 Aug 2023**. When it came to choosing a novel this year, I did a lot of digging around the dark corners of back alley bookshops, browsing the fat, dusty spines of long-forgotten esoteric tomes… and then I chose the novel that won [the 2023 Pulitzer Prize for Fiction](https://www.pulitzer.org/winners/barbara-kingsolver): Barbara Kingsolver’s *Demon Copperhead* (2022). \n\n![A banner announcing that volume nine of the Sipped Ink read-along will begin on 2 July 2023, and cover Barbara Kingsolver’s novel Demon Copperhead.](https://adam.micro.blog/uploads/2023/4df69f5bca.png)\n\nThis transplanting of Dickens’ *David Copperfield* (1850) to modern-day Virginia has been called ‘a masterpiece in storytelling’ and ‘a once-in-a-generation novel that breaks and mends your heart in the way only the best fiction can’. Sounds pretty good, right? \n\nIf you’d like to learn more about the novel, you could take a look at [the publisher’s website](https://www.faber.co.uk/product/9780571376483-demon-copperhead/). As-and-when you’re excited to sign up for this summer’s read-along, [click right here](mailto:readalong@zioibi.com?subject=Sign%20me%20up%20for%20Sipped%20Ink%20vol%209&body=Adam%2C%20count%20me%20in%20for%20reading%20Demon%20Copperhead.%20) and send the resulting email. \n\nAs always, the read-along itself is completely free; the only thing you’ll need is a copy of the book. If you would like to order the paperback, one great option is Bookshop.org — and if you use [this link right here](https://uk.bookshop.org/a/7952/9780571376483) I’ll get a little commission, at no extra cost to you!\n\nAt 546 pages, it’s the lowest page count for a read-along novel yet, *but* the good folks at Faber have chosen a font size for the paperback that’s a little on the small side, so I think — in terms of word count — it’s probably similar to *Great Circle*, or even Murakami’s *The Wind-up Bird Chronicle*, which we read together in 2015.\n\nI'll send out an introductory email to subscribers on **Sun 2 Jul**, and the following weekend an email will arrive on **Sun 9 Jul**, discussing the first 91 pages of the novel. We’ll be reading at about that pace for six weeks, wrapping up on **Sun 13 Aug**. \n\nIf you have any comments or questions about any of this, just [drop me a line](mailto:readalong@zioibi.com). 📚\n",
				"date_published": "2023-06-11T20:11:39+01:00",
				"url": "https://blog.zioibi.com/2023/06/11/sipped-ink-vol.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/10/im-just-back.html",
				
				"content_html": "<p>I’m just back from a morning walk along the Thames tow path, and grateful that I thought to cold brew some coffee overnight. ☀️</p>\n",
				"content_text": "I’m just back from a morning walk along the Thames tow path, and grateful that I thought to cold brew some coffee overnight. ☀️\n",
				"date_published": "2023-06-10T10:20:00+01:00",
				"url": "https://blog.zioibi.com/2023/06/10/im-just-back.html"
			},
			{
				"id": "http://adam.micro.blog/2023/06/06/uh-oh-a.html",
				
				"content_html": "<p>Uh oh. A local indie bookshop / coffee place — the excellently named <a href=\"https://gulpfictionbooks.com/\">Gulp Fiction</a> — has rolled out a deal that feels like a personal attack on my <a href=\"https://en.wikipedia.org/wiki/Tsundoku\">tsundoku</a>: a free coffee when you buy a paperback from the new releases table!</p>\n",
				"content_text": "Uh oh. A local indie bookshop / coffee place — the excellently named [Gulp Fiction](https://gulpfictionbooks.com/) — has rolled out a deal that feels like a personal attack on my [tsundoku](https://en.wikipedia.org/wiki/Tsundoku): a free coffee when you buy a paperback from the new releases table!\n",
				"date_published": "2023-06-06T14:47:09+01:00",
				"url": "https://blog.zioibi.com/2023/06/06/uh-oh-a.html",
				"tags": ["books"]
			},
			{
				"id": "http://adam.micro.blog/2023/06/05/151200.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<img src=\"https://adam.micro.blog/uploads/2023/f7e3c9ed84.jpeg\" width=\"600\" height=\"800\" alt=\"A dried flower arrangement in a naked raku bud vase.\" />\n",
				"date_published": "2023-06-05T15:12:00+01:00",
				"url": "https://blog.zioibi.com/2023/06/05/151200.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/05/29/203000.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "<img src=\"https://adam.micro.blog/uploads/2023/fb6717b3b5.jpeg\" width=\"600\" height=\"449\" alt=\"A room full of mirrors and lights of different colours, so that it seems to stretch on forever.\">\n<span style=\"font-size: 12px; color: #cfcfcf;\">Yayoi Kusama, Infinity Mirror Room @ Tate Modern</span>\n",
				"date_published": "2023-05-29T20:30:00+01:00",
				"url": "https://blog.zioibi.com/2023/05/29/203000.html",
				"tags": ["art","photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/05/27/were-visiting-family.html",
				
				"content_html": "<p>We’re visiting family in Kent this weekend, and left to my own devices this morning I took a walk around several of the old haunts. About 14km round trip; stopped half way at Rochester Castle.</p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/13c10f395d.jpg\" alt=\"a square, twelfth century stone castle tower\"></p>\n",
				"content_text": "We’re visiting family in Kent this weekend, and left to my own devices this morning I took a walk around several of the old haunts. About 14km round trip; stopped half way at Rochester Castle. \n\n![a square, twelfth century stone castle tower](https://adam.micro.blog/uploads/2023/13c10f395d.jpg)\n",
				"date_published": "2023-05-27T16:21:44+01:00",
				"url": "https://blog.zioibi.com/2023/05/27/were-visiting-family.html"
			},
			{
				"id": "http://adam.micro.blog/2023/05/26/very-much-enjoyed.html",
				
				"content_html": "<p><img src=\"/uploads/2023/e2799c9b60.png\" alt=\"\"></p>\n<p>Very much enjoyed Raine Allen-Miller&rsquo;s feature debut <em>Rye Lane</em> (2023), and loved Fraser Muggeridge&rsquo;s <a href=\"https://www.designweek.co.uk/issues/20-march-24-march-2023/fraser-muggeridge-rye-lane/\">type treatment</a> for the credits.</p>\n",
				"content_text": "![](/uploads/2023/e2799c9b60.png)\n\nVery much enjoyed Raine Allen-Miller's feature debut *Rye Lane* (2023), and loved Fraser Muggeridge's [type treatment](https://www.designweek.co.uk/issues/20-march-24-march-2023/fraser-muggeridge-rye-lane/) for the credits.\n",
				"date_published": "2023-05-26T17:16:05+01:00",
				"url": "https://blog.zioibi.com/2023/05/26/very-much-enjoyed.html",
				"tags": ["movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/04/18/162200.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://adam.micro.blog/uploads/2023/95069550dc.jpg\" width=\"600\" height=\"450\" alt=\"A white wooden bridge across a narrow river.\">\n",
				"date_published": "2023-04-18T16:22:00+01:00",
				"url": "https://blog.zioibi.com/2023/04/18/162200.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/04/07/141200.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://adam.micro.blog/uploads/2023/31757ffe67.jpg\" width=\"600\" height=\"449\" alt=\"A small boat sits on the bed of a salt marsh at low tide.\">\n",
				"date_published": "2023-04-07T14:12:00+01:00",
				"url": "https://blog.zioibi.com/2023/04/07/141200.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/03/20/so-i-posted.html",
				
				"content_html": "<p>Since I last posted I&rsquo;ve read a couple of books, both of them a little disappointing, but by no means without merit:</p>\n<p>The first was Gabrielle Zevin&rsquo;s much-hyped <em>Tomorrow, and Tomorrow, and Tomorrow</em> (2022), which I found both frustratingly divorced from the practical realities of the video game industry (in which it is set), and too eager to undermine its female lead by placing her into romantic relationships with virtually every male character in the novel.</p>\n<p>The second was Nell Zink&rsquo;s <em>Avalon</em> (2022), which is dense with ideas, but I found the through-lines of its characters to be too faintly pencilled. It&rsquo;s not so much that I was clamouring for capital C, capital D: Character Development — but in a novel centred around a young woman moving through various upheavals in life circumstance, I felt something a little lacking. Perhaps I just wanted to close the novel with a more definite sense of Bran having learned something about herself. Equally, perhaps that was not Zink&rsquo;s project, and she remains an unquestionably fine, endlessly interesting writer.</p>\n<p>I also caught a clutch of good movies; let me bullet point them for you:</p>\n<p>• <em>The Fabelmans</em> (2022) — catnip for those cinephiles for whom Spielberg has been a constant presence since childhood</p>\n<p>• <em>Women Talking</em> (2022) — masterful in every regard</p>\n<p>• <em>Men</em> (2022) — Alex Garland&rsquo;s weirdest, with a truly outré last reel</p>\n<p>• <em>Certain Women</em> (2016) — a rewatch of this favourite on International Women&rsquo;s Day; Kelly Reichardt can do no wrong</p>\n<p>• <em>Wheel of Fortune &amp; Fantasy</em> (2021) — almost the equal of Ryusuke Hamaguchi&rsquo;s other 2021 film: Oscar-winner, <em>Drive My Car</em></p>\n<p>• <em>Empire of Light</em> (2022) — I think I need more room for this one, and may write about it in <a href=\"/newsletter\">the newsletter</a> this weekend.</p>\n<p>• <em>A Human Position</em> (2022) — I loved the pace of this, and the pride it takes lingering on both Norway&rsquo;s natural beauty, and its objects of design.</p>\n",
				"content_text": "Since I last posted I've read a couple of books, both of them a little disappointing, but by no means without merit: \n\nThe first was Gabrielle Zevin's much-hyped *Tomorrow, and Tomorrow, and Tomorrow* (2022), which I found both frustratingly divorced from the practical realities of the video game industry (in which it is set), and too eager to undermine its female lead by placing her into romantic relationships with virtually every male character in the novel. \n\nThe second was Nell Zink's *Avalon* (2022), which is dense with ideas, but I found the through-lines of its characters to be too faintly pencilled. It's not so much that I was clamouring for capital C, capital D: Character Development — but in a novel centred around a young woman moving through various upheavals in life circumstance, I felt something a little lacking. Perhaps I just wanted to close the novel with a more definite sense of Bran having learned something about herself. Equally, perhaps that was not Zink's project, and she remains an unquestionably fine, endlessly interesting writer. \n\nI also caught a clutch of good movies; let me bullet point them for you: \n\n• *The Fabelmans* (2022) — catnip for those cinephiles for whom Spielberg has been a constant presence since childhood\n\n• *Women Talking* (2022) — masterful in every regard\n\n• *Men* (2022) — Alex Garland's weirdest, with a truly outré last reel\n\n• *Certain Women* (2016) — a rewatch of this favourite on International Women's Day; Kelly Reichardt can do no wrong\n\n• *Wheel of Fortune & Fantasy* (2021) — almost the equal of Ryusuke Hamaguchi's other 2021 film: Oscar-winner, *Drive My Car* \n\n• *Empire of Light* (2022) — I think I need more room for this one, and may write about it in [the newsletter](/newsletter) this weekend. \n\n• *A Human Position* (2022) — I loved the pace of this, and the pride it takes lingering on both Norway's natural beauty, and its objects of design. \n",
				"date_published": "2023-03-20T16:28:00+01:00",
				"url": "https://blog.zioibi.com/2023/03/20/so-i-posted.html",
				"tags": ["books","movies"]
			},
			{
				"id": "http://adam.micro.blog/2023/03/01/another-month-is.html",
				
				"content_html": "<p><img src=\"/uploads/2023/fefc99e2ff.png\" alt=\"\"></p>\n<p>Another month is at an end, and whilst I’m not committed to doing this every time, it did cross my mind to drop a ‘favourite record of February’ post<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. This time around, I feel as though I need to split the honours between a pair of albums: Paramore’s <a href=\"https://album.link/gb/i/1646945378\"><em>This Is Why</em></a>, and Screaming Females’ <a href=\"https://album.link/gb/i/1644825845\"><em>Desire Pathway</em></a>. I’ve listened to each of them a bunch since they came out, and both albums have proven to be hugely welcome returns after 5+ year breaks.</p>\n<p>Other notable February releases for me:</p>\n<p>Black Belt Eagle Scout — <em>The Land, The Water, The Sky</em><br>\nHope D — <em>Clash of the Substance</em><sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup><br>\nKelela — <em>Raven</em><br>\nCaroline Polacheck — <em>Desire, I Want to Turn Into You</em><br>\nHania Rani — <em>On Giacometti</em><br>\nThe WAEVE — <em>The WAEVE</em><br>\nWILSN — <em>Those Days Are Over</em><br>\nYo La Tengo — <em>This Stupid World</em><br>\nYoung Fathers — <em>Heavy Heavy</em></p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Just as <a href=\"/2023/02/01/january-is-at.html\">I did for January</a>&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>‘Emerald’ has proven to be an earworm nonpareil&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "![](/uploads/2023/fefc99e2ff.png)\n\nAnother month is at an end, and whilst I’m not committed to doing this every time, it did cross my mind to drop a ‘favourite record of February’ post[^1]. This time around, I feel as though I need to split the honours between a pair of albums: Paramore’s [*This Is Why*](https://album.link/gb/i/1646945378), and Screaming Females’ [*Desire Pathway*](https://album.link/gb/i/1644825845). I’ve listened to each of them a bunch since they came out, and both albums have proven to be hugely welcome returns after 5+ year breaks. \n\nOther notable February releases for me: \n\nBlack Belt Eagle Scout — *The Land, The Water, The Sky*  \nHope D — *Clash of the Substance*[^2]  \nKelela — *Raven*  \nCaroline Polacheck — *Desire, I Want to Turn Into You*  \nHania Rani — *On Giacometti*  \nThe WAEVE — *The WAEVE*  \nWILSN — *Those Days Are Over*  \nYo La Tengo — *This Stupid World*  \nYoung Fathers — *Heavy Heavy*  \n\n[^1]: Just as [I did for January](/2023/02/01/january-is-at.html)\n\n[^2]: ‘Emerald’ has proven to be an earworm nonpareil\n",
				"date_published": "2023-03-01T15:40:00+01:00",
				"url": "https://blog.zioibi.com/2023/03/01/another-month-is.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/03/01/140800.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://adam.micro.blog/uploads/2023/cae4a88af2.jpg\" width=\"600\" height=\"600\" alt=\"A yellow notebook, in which is sat a silver hard drive. There is also a tangle of white cables.\">\n",
				"date_published": "2023-03-01T14:08:00+01:00",
				"url": "https://blog.zioibi.com/2023/03/01/140800.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/02/25/113900.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://adam.micro.blog/uploads/2023/eb3887c7d8.jpg\" width=\"450\" height=\"600\" alt=\"A plastic giraffe figurine, stood in a plant pot with a tall plant.\">\n",
				"date_published": "2023-02-25T11:39:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/25/113900.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/02/18/im-an-inveterate.html",
				
				"content_html": "<p>I’m an inveterate highlighter, firmly established in the practice of scribbling down and squirrelling away those phrases and ideas I come across that send a certain type of vibration through me. Recently, I was doing some digital housekeeping and found a trove of older notes, many of which contained snippets I hadn’t thought about in many years, but which shone for me once more upon re-discovering them.</p>\n<p>I thought it might be fun — and possibly of value — to share some of these clippings, and since I’m also starting to think about bringing my newsletter out of hibernation<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>, I figured that might make a good venue. I&rsquo;ll drop a quote / highlight into future issues, with or without my own commentary as seems appropriate.</p>\n<p>As a trial, here’s a framing of the practice of blogging that I like, from <a href=\"https://www.huffpost.com/entry/hello-by-the-way-whatever_b_17745\">this 2011 piece in <em>Huffpost</em></a>, by Nora Ephron:</p>\n<blockquote>\n<p>One of the most delicious things about the profoundly parasitical world of blogs is that you don’t have to have anything much to say. Or you just have to have a little tiny thing to say. You just might want to say hello. I’m here. And by the way. On the other hand. Nevertheless. Did you see this? Whatever. <!-- raw HTML omitted -->A blog is sort of like an exhale. What you hope is that whatever you’re saying is true for about as long as you’re saying it. Even if it’s not much.<!-- raw HTML omitted --></p>\n</blockquote>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>You can browse the archive, and consider signing up <a href=\"/newsletter\">right here</a>&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "I’m an inveterate highlighter, firmly established in the practice of scribbling down and squirrelling away those phrases and ideas I come across that send a certain type of vibration through me. Recently, I was doing some digital housekeeping and found a trove of older notes, many of which contained snippets I hadn’t thought about in many years, but which shone for me once more upon re-discovering them.\n\nI thought it might be fun — and possibly of value — to share some of these clippings, and since I’m also starting to think about bringing my newsletter out of hibernation[^1], I figured that might make a good venue. I'll drop a quote / highlight into future issues, with or without my own commentary as seems appropriate.\n\nAs a trial, here’s a framing of the practice of blogging that I like, from [this 2011 piece in *Huffpost*](https://www.huffpost.com/entry/hello-by-the-way-whatever_b_17745), by Nora Ephron:\n\n> One of the most delicious things about the profoundly parasitical world of blogs is that you don’t have to have anything much to say. Or you just have to have a little tiny thing to say. You just might want to say hello. I’m here. And by the way. On the other hand. Nevertheless. Did you see this? Whatever. <mark>A blog is sort of like an exhale. What you hope is that whatever you’re saying is true for about as long as you’re saying it. Even if it’s not much.</mark>\n\n[^1]: You can browse the archive, and consider signing up [right here](/newsletter)\n",
				"date_published": "2023-02-18T12:07:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/18/im-an-inveterate.html"
			},
			{
				"id": "http://adam.micro.blog/2023/02/15/193900.html",
				
				"content_html": "<p><img src=\"https://adam.micro.blog/uploads/2023/8c8f465950.jpg\" alt=\"\"></p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/3bb9102b3f.jpg\" alt=\"\"></p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/848ce366d9.jpg\" alt=\"\"></p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/1e69b61117.jpg\" alt=\"\"></p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/73dc847563.jpg\" alt=\"\"></p>\n<p><img src=\"https://adam.micro.blog/uploads/2023/3185a95c37.jpg\" alt=\"\"></p>\n",
				"content_text": "![](https://adam.micro.blog/uploads/2023/8c8f465950.jpg)  \n\n![](https://adam.micro.blog/uploads/2023/3bb9102b3f.jpg)  \n\n![](https://adam.micro.blog/uploads/2023/848ce366d9.jpg)  \n\n![](https://adam.micro.blog/uploads/2023/1e69b61117.jpg)  \n\n![](https://adam.micro.blog/uploads/2023/73dc847563.jpg)  \n\n![](https://adam.micro.blog/uploads/2023/3185a95c37.jpg)\n",
				"date_published": "2023-02-15T19:39:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/15/193900.html",
				"tags": ["photos"]
			},
			{
				"id": "http://adam.micro.blog/2023/02/14/jockstrap-the-bullingdon.html",
				"title": "Jockstrap @ The Bullingdon",
				"content_html": "<p><img src=\"/uploads/2023/ce93c0bc33.png\" alt=\"\"></p>\n<p>Last night I caught a performance by London-based genre-dismantlers <a href=\"https://jockstrapmusic.com\">Jockstrap</a> at The Bullingdon, on Oxford&rsquo;s Cowley Rd. It&rsquo;s a 400-capacity venue that I&rsquo;ve been to for a few shows, but this was the first time I&rsquo;ve seen it packed. The band&rsquo;s current (sold out) tour, in support of debut album <a href=\"https://album.link/gb/i/1625455552\"><em>I Love You Jennifer B</em></a> (2022), is also taking them as far afield as Australia &amp; Japan — a further sign that their frenetic, adventurous sound has struck a nerve.</p>\n<p>The set list was probably about as balanced as Jockstrap can get, pulling from both the softer side of their oeuvre — songs like the pretty &amp; sad <a href=\"https://song.link/gb/i/1625456136\">&lsquo;Glasgow&rsquo;</a>, which Georgia Ellery sings and strums largely solo<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup> — to the down-right unstable (see eg. <a href=\"https://song.link/gb/i/1506237863\">&lsquo;Robert&rsquo;</a>). Most tracks, however, are some mix of styles: the band shifting restlessly between vibes and valences (ie. the danceable middle third of single &lsquo;Concrete Over Water&rsquo;, a song that is otherwise something approaching a ballad).</p>\n<p>One aspect of the sequencing that I really enjoyed, is the way in which following &lsquo;Concrete Over Water&rsquo; (2022) with <a href=\"https://song.link/gb/i/1506237868\">&lsquo;The City&rsquo;</a> (2020) makes the earlier track read as a neat coda to the more recent one.</p>\n<p><a href=\"https://song.link/gb/i/1625455889\">&lsquo;Angst&rsquo;</a> is a three-minute song on the album that sounds as though it was recorded as a four-minute song, and then had its last quarter compressed into the track&rsquo;s final ~25 seconds. The effect is similar to that of scrubbing through those final moments of audio, and I would have guessed that it would be achieved live by employing a sample. It was a delight to see Ellery sing it, whilst Taylor Skye pitch-shifted her vocal.</p>\n<p>The whole performance was admirably tight, and you could tell the spell was working: the crowd unfailingly remained silent throughout the quieter moments, and exploded into motion on the high-energy songs. Personal favourite <a href=\"https://song.link/gb/i/1625455895\">&lsquo;Debra&rsquo;</a> felt like it landed particularly well.</p>\n<p>Finally, what a joy it must be to know you&rsquo;ve got a bona fide banger like <a href=\"https://song.link/gb/i/1625456147\">&lsquo;50/50&rsquo;</a> in your back pocket to drop as a closer. Even though <a href=\"https://youtu.be/cd_MFQIh2zE\">the (no budget) official video</a> could have been shot at last night&rsquo;s show, it only goes some way to depicting how much harder the song hits in person.<br>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p>Re-listening to <em>I Love You Jennifer B</em> ahead of the show (and again this morning) I&rsquo;m experiencing a little regret that I didn&rsquo;t find a spot for it on my <a href=\"/list2022\">end of year top 20</a>. It was one of a few records that made a shortlist, but not the final cut. It&rsquo;s testament to Jockstrap that the live show injects even more vitality to these already super-vibrant songs, and has me second guessing myself.</p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>she is also the violinist in the Mercury Prize-nominated band <a href=\"https://blackcountrynewroad.com/\">Black Country, New Road</a>, and brought out the violin a couple of times during the set, to add yet another flavour to the mix&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "![](/uploads/2023/ce93c0bc33.png)\n\nLast night I caught a performance by London-based genre-dismantlers [Jockstrap](https://jockstrapmusic.com) at The Bullingdon, on Oxford's Cowley Rd. It's a 400-capacity venue that I've been to for a few shows, but this was the first time I've seen it packed. The band's current (sold out) tour, in support of debut album [*I Love You Jennifer B*](https://album.link/gb/i/1625455552) (2022), is also taking them as far afield as Australia & Japan — a further sign that their frenetic, adventurous sound has struck a nerve. \n\nThe set list was probably about as balanced as Jockstrap can get, pulling from both the softer side of their oeuvre — songs like the pretty & sad ['Glasgow'](https://song.link/gb/i/1625456136), which Georgia Ellery sings and strums largely solo[^1] — to the down-right unstable (see eg. ['Robert'](https://song.link/gb/i/1506237863)). Most tracks, however, are some mix of styles: the band shifting restlessly between vibes and valences (ie. the danceable middle third of single 'Concrete Over Water', a song that is otherwise something approaching a ballad). \n\nOne aspect of the sequencing that I really enjoyed, is the way in which following 'Concrete Over Water' (2022) with ['The City'](https://song.link/gb/i/1506237868) (2020) makes the earlier track read as a neat coda to the more recent one. \n\n['Angst'](https://song.link/gb/i/1625455889) is a three-minute song on the album that sounds as though it was recorded as a four-minute song, and then had its last quarter compressed into the track's final ~25 seconds. The effect is similar to that of scrubbing through those final moments of audio, and I would have guessed that it would be achieved live by employing a sample. It was a delight to see Ellery sing it, whilst Taylor Skye pitch-shifted her vocal. \n\nThe whole performance was admirably tight, and you could tell the spell was working: the crowd unfailingly remained silent throughout the quieter moments, and exploded into motion on the high-energy songs. Personal favourite ['Debra'](https://song.link/gb/i/1625455895) felt like it landed particularly well.  \n\nFinally, what a joy it must be to know you've got a bona fide banger like ['50/50'](https://song.link/gb/i/1625456147) in your back pocket to drop as a closer. Even though [the (no budget) official video](https://youtu.be/cd_MFQIh2zE) could have been shot at last night's show, it only goes some way to depicting how much harder the song hits in person.  \n<br>\n<div style=\"text-align: center; color: #cfcfcf;\">• • •</div> \n\nRe-listening to *I Love You Jennifer B* ahead of the show (and again this morning) I'm experiencing a little regret that I didn't find a spot for it on my [end of year top 20](/list2022). It was one of a few records that made a shortlist, but not the final cut. It's testament to Jockstrap that the live show injects even more vitality to these already super-vibrant songs, and has me second guessing myself. \n\n[^1]: she is also the violinist in the Mercury Prize-nominated band [Black Country, New Road](https://blackcountrynewroad.com/), and brought out the violin a couple of times during the set, to add yet another flavour to the mix\n",
				"date_published": "2023-02-14T13:28:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/14/jockstrap-the-bullingdon.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/02/10/now-that-were.html",
				
				"content_html": "<p>Some bullets from my morning:</p>\n<p>• I enjoyed my first spin of the <a href=\"https://album.link/gb/i/1646945378\">new Paramore LP</a>, and added a bunch of other records to the queue.</p>\n<p>• My cycling workout this morning also had <a href=\"https://music.apple.com/gb/playlist/cycling-with-tyrell/pl.b38a637353fb4a92bc40c0c439292190\">a killer 80s soundtrack</a>.</p>\n<p><img src=\"/uploads/2023/a8bc576663.png\" alt=\"\"></p>\n<p>• New in the hopper today, my third bag from <a href=\"https://www.newgroundcoffee.com/\">Newground</a> as I work my way through their offer.</p>\n",
				"content_text": "Some bullets from my morning: \n\n• I enjoyed my first spin of the [new Paramore LP](https://album.link/gb/i/1646945378), and added a bunch of other records to the queue. \n\n• My cycling workout this morning also had [a killer 80s soundtrack](https://music.apple.com/gb/playlist/cycling-with-tyrell/pl.b38a637353fb4a92bc40c0c439292190). \n\n![](/uploads/2023/a8bc576663.png)\n\n• New in the hopper today, my third bag from [Newground](https://www.newgroundcoffee.com/) as I work my way through their offer.\n",
				"date_published": "2023-02-10T12:36:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/10/now-that-were.html"
			},
			{
				"id": "http://adam.micro.blog/2023/02/10/101200.html",
				
				"content_html": "<p>Now that we’re getting Game Boy Advance games on Nintendo Switch Online, here’s my wishlist.</p>\n<p>First, we need to note that amongst the launch line-up are <em>Mario &amp; Luigi: Superstar Saga</em> and <em>The Legend of Zelda: The Minish Cap</em>, both of which would have been on my list. As would <em>F-Zero Maximum Velocity</em> &amp; <em>Metroid Fusion</em>, which have been announced as forthcoming. And one more caveat: given that the Switch remake — <em>Advance Wars 1+2 Re-Boot Camp</em> — now has a new release date (21 Apr), it feels unlikely that the two original games will be added to <!-- raw HTML omitted -->NSO<!-- raw HTML omitted -->, but I guess you never know.</p>\n<p>With all that said, here are the top five further additions I’d love to see:</p>\n<p><strong>1</strong> — <em>Mario vs. Donkey Kong</em><br>\n<strong>2</strong> — <em>Metroid: Zero Mission</em><br>\n<strong>3</strong> — <em>Final Fantasy Tactics</em><br>\n<strong>4</strong> — <em>Sonic Advance</em><br>\n<strong>5</strong> — <em>DK: King of Swing</em></p>\n",
				"content_text": "Now that we’re getting Game Boy Advance games on Nintendo Switch Online, here’s my wishlist. \n\nFirst, we need to note that amongst the launch line-up are *Mario & Luigi: Superstar Saga* and *The Legend of Zelda: The Minish Cap*, both of which would have been on my list. As would *F-Zero Maximum Velocity* & *Metroid Fusion*, which have been announced as forthcoming. And one more caveat: given that the Switch remake — *Advance Wars 1+2 Re-Boot Camp* — now has a new release date (21 Apr), it feels unlikely that the two original games will be added to <sc>NSO</sc>, but I guess you never know.\n\nWith all that said, here are the top five further additions I’d love to see:\n\n**1** — *Mario vs. Donkey Kong*  \n**2** — *Metroid: Zero Mission*  \n**3** — *Final Fantasy Tactics*  \n**4** — *Sonic Advance*  \n**5** — *DK: King of Swing*  \n",
				"date_published": "2023-02-10T10:12:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/10/101200.html",
				"tags": ["videogames"]
			},
			{
				"id": "http://adam.micro.blog/2023/02/06/my-academic-career.html",
				"title": "My Academic Career in 6 Documents",
				"content_html": "<p>Recently, whilst searching shelves for something else entirely, I happened upon the folder of essays I wrote as part of my <!-- raw HTML omitted -->MA<!-- raw HTML omitted --> in English &amp; American Literature. Doing so, I was semi-stunned to note that even the most recent of them — the final thesis — is now more than a decade old<sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote-ref\" role=\"doc-noteref\">1</a></sup>. Nevertheless, rather than merely continue sitting in a folder upstairs, I figured it might be time to at least give them a home online<sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote-ref\" role=\"doc-noteref\">2</a></sup>.</p>\n<p>You never know who might stumble upon these things after a <em>highly</em> specific search engine query! If that&rsquo;s you, I hope something here is of interest.</p>\n<p>• <code>2006</code> <a href=\"/uploads/2023/4217516de8.pdf\">Seekers After Truth — The Writings of Chuck Palahniuk</a><br>\n• <code>2011</code> <a href=\"/uploads/2023/48f66368f8.pdf\">Modernism&rsquo;s Refiguring of Perspective in Literature and the Visual Arts</a><br>\n• <code>2011</code> <a href=\"/uploads/2023/67ebbd17ba.pdf\">Bodies of Water in <em>Heart of Darkness</em> &amp; <em>In The Skin of a Lion</em></a><br>\n• <code>2012</code> <a href=\"/uploads/2023/e4717a1e09.pdf\">Fragmentation and Palimpsest in Pound&rsquo;s <em>Pisan Cantos</em> &amp; HD&rsquo;s <em>Trilogy</em></a><br>\n• <code>2012</code> <a href=\"/uploads/2023/93bafc9f29.pdf\">Multi-authorial Strategies in <em>Pale Fire</em> &amp; <em>House of Leaves</em></a><br>\n• <code>2012</code> <a href=\"/uploads/2023/bf9357dbc8.pdf\">Towards a Genealogy of American Literary Minimalism</a></p>\n<p>As always, you can send any comments, criticisms, and questions via <a href=\"mailto:hello@zioibi.com\">email</a></p>\n<section class=\"footnotes\" role=\"doc-endnotes\">\n<hr>\n<ol>\n<li id=\"fn:1\" role=\"doc-endnote\">\n<p>Heck, it <em>shouldn&rsquo;t</em> be a surprise; I have <a href=\"/mastered\">a decade-old blogpost</a> about it.&#160;<a href=\"#fnref:1\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n<li id=\"fn:2\" role=\"doc-endnote\">\n<p>I&rsquo;ve also dug out an older piece: my undergraduate thesis 🫣&#160;<a href=\"#fnref:2\" class=\"footnote-backref\" role=\"doc-backlink\">&#x21a9;&#xfe0e;</a></p>\n</li>\n</ol>\n</section>\n",
				"content_text": "Recently, whilst searching shelves for something else entirely, I happened upon the folder of essays I wrote as part of my <sc>MA</sc> in English & American Literature. Doing so, I was semi-stunned to note that even the most recent of them — the final thesis — is now more than a decade old[^1]. Nevertheless, rather than merely continue sitting in a folder upstairs, I figured it might be time to at least give them a home online[^2].\n\nYou never know who might stumble upon these things after a *highly* specific search engine query! If that's you, I hope something here is of interest. \n\n• `2006` [Seekers After Truth — The Writings of Chuck Palahniuk](/uploads/2023/4217516de8.pdf)  \n• `2011` [Modernism's Refiguring of Perspective in Literature and the Visual Arts](/uploads/2023/48f66368f8.pdf)  \n• `2011` [Bodies of Water in *Heart of Darkness* & *In The Skin of a Lion*](/uploads/2023/67ebbd17ba.pdf)  \n• `2012` [Fragmentation and Palimpsest in Pound's *Pisan Cantos* & HD's *Trilogy*](/uploads/2023/e4717a1e09.pdf)  \n• `2012` [Multi-authorial Strategies in *Pale Fire* & *House of Leaves*](/uploads/2023/93bafc9f29.pdf)  \n• `2012` [Towards a Genealogy of American Literary Minimalism](/uploads/2023/bf9357dbc8.pdf)  \n\nAs always, you can send any comments, criticisms, and questions via [email](mailto:hello@zioibi.com) \n\n[^1]: Heck, it *shouldn't* be a surprise; I have [a decade-old blogpost](/mastered) about it.\n\n[^2]: I've also dug out an older piece: my undergraduate thesis 🫣\n",
				"date_published": "2023-02-06T12:13:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/06/my-academic-career.html"
			},
			{
				"id": "http://adam.micro.blog/2023/02/01/metric-roundhouse-london.html",
				
				"content_html": "<!-- raw HTML omitted -->\n<p><!-- raw HTML omitted -->Metric @ Roundhouse, London<!-- raw HTML omitted --></p>\n",
				"content_text": "\n\n<img src=\"https://adam.micro.blog/uploads/2023/bdd8e3526a.jpg\" width=\"600\" height=\"374\" alt=\"Musicians on a stage, lit by several purple and pink lights.\">\n\n<span style=\"font-size: 12px; color: #cfcfcf;\">Metric @ Roundhouse, London</span>\n",
				"date_published": "2023-02-01T23:12:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/01/metric-roundhouse-london.html",
				"tags": ["photos","music"]
			},
			{
				"id": "http://adam.micro.blog/2023/02/01/january-is-at.html",
				
				"content_html": "<p><img src=\"/uploads/2023/be4d9c11fa.png\" alt=\"\"></p>\n<p>January is at an end, and I thought I&rsquo;d share a few records I enjoyed that came out in the first month of 2023. Top of the pile is <a href=\"https://album.link/gb/i/1648671176\"><em>A Short Diary</em></a> from Sebastian Rochford &amp; Kit Downes — a subtle, delicate set of percussion &amp; piano-led jazz that I&rsquo;ve had on repeat since it came out on <!-- raw HTML omitted -->ECM<!-- raw HTML omitted --> a couple of weeks ago. Others I&rsquo;ve enjoyed, in no particular order:</p>\n<p>Fireworks — <em>Higher Lonely Power</em><br>\nLiela Moss — <em>Internal Working Model</em><br>\nJadu Heart — <em>Derealised</em><br>\nJonah Yano — <em>Portrait of a Dog</em><br>\nThe Tubs — <em>Dead Meat</em><br>\nWhite Reaper — <em>Asking For A Ride</em><br>\nkhai dreams — <em>ABSOLUTE HEARTBREAK</em><br>\nBass Drum of Death — <em>Say I Won&rsquo;t</em><br>\nIlliterate Light — <em>Sunburned</em><br>\n<!-- raw HTML omitted --></p>\n<!-- raw HTML omitted -->\n<p>Today, we’re headed into London to catch Metric — who made my <a href=\"/list2022\">favourite record of last year</a> — live at the Roundhouse!</p>\n",
				"content_text": "![](/uploads/2023/be4d9c11fa.png)\n\nJanuary is at an end, and I thought I'd share a few records I enjoyed that came out in the first month of 2023. Top of the pile is [*A Short Diary*](https://album.link/gb/i/1648671176) from Sebastian Rochford & Kit Downes — a subtle, delicate set of percussion & piano-led jazz that I've had on repeat since it came out on <sc>ECM</sc> a couple of weeks ago. Others I've enjoyed, in no particular order: \n\nFireworks — *Higher Lonely Power*  \nLiela Moss — *Internal Working Model*  \nJadu Heart — *Derealised*  \nJonah Yano — *Portrait of a Dog*  \nThe Tubs — *Dead Meat*  \nWhite Reaper — *Asking For A Ride*  \nkhai dreams — *ABSOLUTE HEARTBREAK*  \nBass Drum of Death — *Say I Won't*  \nIlliterate Light — *Sunburned*  \n<br>\n<div style=\"text-align: center; color: #cfcfcf;\">• • •</div> \n\nToday, we’re headed into London to catch Metric — who made my [favourite record of last year](/list2022) — live at the Roundhouse!\n",
				"date_published": "2023-02-01T08:30:00+01:00",
				"url": "https://blog.zioibi.com/2023/02/01/january-is-at.html",
				"tags": ["music"]
			},
			{
				"id": "http://adam.micro.blog/2023/01/31/i-am-super.html",
				
				"content_html": "<p><img src=\"/uploads/2023/fdc7e7374b.png\" alt=\"\"></p>\n<p>I am super excited to jump into <a href=\"https://www.play-season.com/\"><em>Season: A Letter to the Future</em></a> (from Scavengers Studio) when it releases on PlayStation in a few hours' time. I&rsquo;ve intentionally avoided pretty much all coverage since first seeing <a href=\"https://youtu.be/ZCMHnKpt4IM\">the announcement trailer</a>, and being instantly certain this was going to be one for me. A chill game about exploring a beautiful world, and collating its stories? Sign me up!</p>\n<p><img src=\"/uploads/2023/1c14abaf1d.png\" alt=\"\"></p>\n",
				"content_text": "![](/uploads/2023/fdc7e7374b.png)\n\nI am super excited to jump into [*Season: A Letter to the Future*](https://www.play-season.com/) (from Scavengers Studio) when it releases on PlayStation in a few hours' time. I've intentionally avoided pretty much all coverage since first seeing [the announcement trailer](https://youtu.be/ZCMHnKpt4IM), and being instantly certain this was going to be one for me. A chill game about exploring a beautiful world, and collating its stories? Sign me up!\n\n![](/uploads/2023/1c14abaf1d.png)\n",
				"date_published": "2023-01-31T12:25:00+01:00",
				"url": "https://blog.zioibi.com/2023/01/31/i-am-super.html",
				"tags": ["videogames"]
			},
			{
				"id": "http://adam.micro.blog/2023/01/31/over-the-last.html",
				
				"content_html": "<p>Over the last five seasons, for pretty much every game of baseball that I watched, you&rsquo;d find me wearing a replica <a href=\"https://www.baseball-reference.com/players/h/heywaja01.shtml\">Jason Heyward</a> jersey. A <em>lot</em> has been written during that period about the wisdom of Heyward&rsquo;s contract with the Cubs (eight years; $184M), and I don&rsquo;t aim to add to it here. At his best, I always found Heyward a magnetic player to watch. His <a href=\"https://www.mlb.com/video/heyward-s-walk-off-grand-slam-c2126932683?q=BatterId%20%3D%20%5B518792%5D%20AND%20HitResult%20%3D%20%5B%22Home%20Run%22%5D%20Order%20By%20Timestamp%20DESC&amp;cp=MIXED&amp;p=1\">game-winning walk-off grand slam</a> against the Phillies in 2018 is something I&rsquo;ll never forget, and there are plenty of <a href=\"https://www.mlb.com/video/jason-heyward-homers-6-on-a-fly-ball-to-left-field?q=BatterId%20%3D%20%5B518792%5D%20AND%20HitResult%20%3D%20%5B%22Home%20Run%22%5D%20Order%20By%20Timestamp%20DESC&amp;cp=MIXED&amp;p=0\">other highlights</a>. Not to mention the consistently <a href=\"https://youtu.be/NKxkwI8-wA8\">stunning defence</a> that won him no fewer than five gold gloves, and the fact that he seems to be a <a href=\"https://www.mlb.com/news/jason-heyward-named-cubs-robert-clemente-award-nominee\">genuinely wonderful person</a> away from the diamond.</p>\n<p>The Cubs having released him in November, I&rsquo;m sure <a href=\"https://youtu.be/d6-3KLVIqKE\">going to miss the guy</a> this coming season.</p>\n<p><img src=\"/uploads/2023/058e08782b.png\" alt=\"\"></p>\n<p>Heyward&rsquo;s departure sent me shopping for a new jersey. One consideration is longevity: no one wants to drop money on a shirt, only to find the player has been traded away from the club a season later. Following that logic, I might have picked up a jersey that read <!-- raw HTML omitted --><a href=\"https://www.baseball-reference.com/players/s/suzukse01.shtml\">SUZUKI</a> #27<!-- raw HTML omitted --> (signed through 2026), or even <!-- raw HTML omitted --><a href=\"https://www.baseball-reference.com/players/s/swansda01.shtml\">SWANSON</a> #7<!-- raw HTML omitted --> (signed through 2029). In the end, however, I went a different direction. When you happen to share a surname with <a href=\"https://www.baseball-reference.com/players/w/woodke02.shtml\">one of your team&rsquo;s legends</a>, sometimes you have to lean into it!</p>\n<p><img src=\"/uploads/2023/d3a3e7ce12.png\" alt=\"\"></p>\n<p>I could not be more excited to wear this <a href=\"https://www.mlb.com/gameday/cubs-vs-cardinals/2023/06/25/717623\">at London Stadium this summer</a>, rooting for the Cubbies in person, for the first time!</p>\n",
				"content_text": "Over the last five seasons, for pretty much every game of baseball that I watched, you'd find me wearing a replica [Jason Heyward](https://www.baseball-reference.com/players/h/heywaja01.shtml) jersey. A *lot* has been written during that period about the wisdom of Heyward's contract with the Cubs (eight years; $184M), and I don't aim to add to it here. At his best, I always found Heyward a magnetic player to watch. His [game-winning walk-off grand slam](https://www.mlb.com/video/heyward-s-walk-off-grand-slam-c2126932683?q=BatterId%20%3D%20%5B518792%5D%20AND%20HitResult%20%3D%20%5B%22Home%20Run%22%5D%20Order%20By%20Timestamp%20DESC&cp=MIXED&p=1) against the Phillies in 2018 is something I'll never forget, and there are plenty of [other highlights](https://www.mlb.com/video/jason-heyward-homers-6-on-a-fly-ball-to-left-field?q=BatterId%20%3D%20%5B518792%5D%20AND%20HitResult%20%3D%20%5B%22Home%20Run%22%5D%20Order%20By%20Timestamp%20DESC&cp=MIXED&p=0). Not to mention the consistently [stunning defence](https://youtu.be/NKxkwI8-wA8) that won him no fewer than five gold gloves, and the fact that he seems to be a [genuinely wonderful person](https://www.mlb.com/news/jason-heyward-named-cubs-robert-clemente-award-nominee) away from the diamond.\n\nThe Cubs having released him in November, I'm sure [going to miss the guy](https://youtu.be/d6-3KLVIqKE) this coming season.\n\n![](/uploads/2023/058e08782b.png)\n\nHeyward's departure sent me shopping for a new jersey. One consideration is longevity: no one wants to drop money on a shirt, only to find the player has been traded away from the club a season later. Following that logic, I might have picked up a jersey that read <sc>[SUZUKI](https://www.baseball-reference.com/players/s/suzukse01.shtml) #27</sc> (signed through 2026), or even <sc>[SWANSON](https://www.baseball-reference.com/players/s/swansda01.shtml) #7</sc> (signed through 2029). In the end, however, I went a different direction. When you happen to share a surname with [one of your team's legends](https://www.baseball-reference.com/players/w/woodke02.shtml), sometimes you have to lean into it!\n\n![](/uploads/2023/d3a3e7ce12.png)\n\nI could not be more excited to wear this [at London Stadium this summer](https://www.mlb.com/gameday/cubs-vs-cardinals/2023/06/25/717623), rooting for the Cubbies in person, for the first time!\n",
				"date_published": "2023-01-31T09:55:00+01:00",
				"url": "https://blog.zioibi.com/2023/01/31/over-the-last.html",
				"tags": ["sport","baseball"]
			},
			{
				"id": "http://adam.micro.blog/2023/01/30/for-my-birthday.html",
				
				"content_html": "<p>For my birthday last week, I successfully dropped sufficient hints to my partner such that I was gifted this Lego set: the helpful explorer droid <a href=\"https://starwars.fandom.com/wiki/BD-1\">BD-1</a>, from the <em>Star Wars</em> video game <em>Jedi: Fallen Order</em> (2021) (and its soon-to-be-released sequel).</p>\n<p>It has been an unalloyed pleasure to piece this little guy together. I put a few episodes of <em>Star Wars: Rebels</em> on in the background, and studied the instruction booklet as though it contained the secret to eternal life.</p>\n<p><img src=\"/uploads/2023/14dbc1e933.png\" alt=\"\">\n<img src=\"/uploads/2023/73ab622bc3.png\" alt=\"\"></p>\n",
				"content_text": "For my birthday last week, I successfully dropped sufficient hints to my partner such that I was gifted this Lego set: the helpful explorer droid [BD-1](https://starwars.fandom.com/wiki/BD-1), from the *Star Wars* video game *Jedi: Fallen Order* (2021) (and its soon-to-be-released sequel). \n\nIt has been an unalloyed pleasure to piece this little guy together. I put a few episodes of *Star Wars: Rebels* on in the background, and studied the instruction booklet as though it contained the secret to eternal life. \n\n![](/uploads/2023/14dbc1e933.png)\n![](/uploads/2023/73ab622bc3.png)\n",
				"date_published": "2023-01-30T11:55:00+01:00",
				"url": "https://blog.zioibi.com/2023/01/30/for-my-birthday.html",
				"tags": ["starwars"]
			},
			{
				"id": "http://adam.micro.blog/2023/01/17/103100.html",
				
				"content_html": "<!-- raw HTML omitted -->\n",
				"content_text": "\n\n<img src=\"https://adam.micro.blog/uploads/2023/275bc858b2.jpg\" width=\"600\" height=\"600\" alt=\"Coffee being made in a conical glass dripper.\">\n",
				"date_published": "2023-01-17T10:31:00+01:00",
				"url": "https://blog.zioibi.com/2023/01/17/103100.html",
				"tags": ["photos","coffee"]
			}
	]
}
